[NoCoverage] Foreach_
Adebipe/Router/Router.php:53:9
     private function _executeRoute(ReflectionMethod $method, array $parameters, Injector $injector): Response
     {
         // Execute before Annotations
-        foreach ($method->getAttributes() as $attribute) {
-            if (is_subclass_of($attribute->getName(), BeforeRoute::class)) {
-                $beforeRoute = $attribute->newInstance();
-                $execute = new ReflectionMethod($beforeRoute, 'execute');
-                $response = $injector->execute($execute, $beforeRoute, $parameters);
-                if ($response instanceof Response) {
-                    return $response;
-                }
-                if ($response === false) {
-                    return new Response('An error occured', 500);
-                }
-                if ($response !== true) {
-                    throw new \Exception('BeforeRoute ' . $attribute->getName() . ' returned an invalid value');
-                }
-            }
-        }
+        foreach (array() as $attribute) {
         $response = $injector->execute($method, null, $parameters);
         // Check if the response is an instance of Response

[NoCoverage] IfNegation
Adebipe/Router/Router.php:54:13
     {
         // Execute before Annotations
         foreach ($method->getAttributes() as $attribute) {
-            if (is_subclass_of($attribute->getName(), BeforeRoute::class)) {
-                $beforeRoute = $attribute->newInstance();
-                $execute = new ReflectionMethod($beforeRoute, 'execute');
-                $response = $injector->execute($execute, $beforeRoute, $parameters);
-                if ($response instanceof Response) {
-                    return $response;
-                }
-                if ($response === false) {
-                    return new Response('An error occured', 500);
-                }
-                if ($response !== true) {
-                    throw new \Exception('BeforeRoute ' . $attribute->getName() . ' returned an invalid value');
-                }
-            }
+            if (!is_subclass_of($attribute->getName(), BeforeRoute::class)) {
         }
         $response = $injector->execute($method, null, $parameters);

[NoCoverage] InstanceOf_
Adebipe/Router/Router.php:58:17
                 $beforeRoute = $attribute->newInstance();
                 $execute = new ReflectionMethod($beforeRoute, 'execute');
                 $response = $injector->execute($execute, $beforeRoute, $parameters);
-                if ($response instanceof Response) {
+                if (false) {
                     return $response;
                 }

[NoCoverage] InstanceOf_
Adebipe/Router/Router.php:58:17
                 $beforeRoute = $attribute->newInstance();
                 $execute = new ReflectionMethod($beforeRoute, 'execute');
                 $response = $injector->execute($execute, $beforeRoute, $parameters);
-                if ($response instanceof Response) {
+                if (true) {
                     return $response;
                 }

[NoCoverage] Identical
Adebipe/Router/Router.php:61:17
                 if ($response instanceof Response) {
                     return $response;
                 }
-                if ($response === false) {
+                if ($response !== false) {
                     return new Response('An error occured', 500);
                 }

[NoCoverage] FalseValue
Adebipe/Router/Router.php:61:17
                 if ($response instanceof Response) {
                     return $response;
                 }
-                if ($response === false) {
+                if ($response === true) {
                     return new Response('An error occured', 500);
                 }

[NoCoverage] DecrementInteger
Adebipe/Router/Router.php:62:21
                     return $response;
                 }
                 if ($response === false) {
-                    return new Response('An error occured', 500);
+                    return new Response('An error occured', 499);
                 }
                 if ($response !== true) {

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:62:21
                     return $response;
                 }
                 if ($response === false) {
-                    return new Response('An error occured', 500);
+                    return new Response('An error occured', 501);
                 }
                 if ($response !== true) {

[NoCoverage] NotIdentical
Adebipe/Router/Router.php:64:17
                 if ($response === false) {
                     return new Response('An error occured', 500);
                 }
-                if ($response !== true) {
+                if ($response === true) {
                     throw new \Exception('BeforeRoute ' . $attribute->getName() . ' returned an invalid value');
                 }

[NoCoverage] TrueValue
Adebipe/Router/Router.php:64:17
                 if ($response === false) {
                     return new Response('An error occured', 500);
                 }
-                if ($response !== true) {
+                if ($response !== false) {
                     throw new \Exception('BeforeRoute ' . $attribute->getName() . ' returned an invalid value');
                 }

[NoCoverage] Concat
Adebipe/Router/Router.php:65:21
                     return new Response('An error occured', 500);
                 }
                 if ($response !== true) {
-                    throw new \Exception('BeforeRoute ' . $attribute->getName() . ' returned an invalid value');
+                    throw new \Exception($attribute->getName() . 'BeforeRoute ' . ' returned an invalid value');
                 }
             }

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:65:21
                     return new Response('An error occured', 500);
                 }
                 if ($response !== true) {
-                    throw new \Exception('BeforeRoute ' . $attribute->getName() . ' returned an invalid value');
+                    throw new \Exception('BeforeRoute ' . ' returned an invalid value');
                 }
             }

[NoCoverage] LogicalNot
Adebipe/Router/Router.php:71:9
         }
         $response = $injector->execute($method, null, $parameters);
         // Check if the response is an instance of Response
-        if (!($response instanceof Response)) {
+        if ($response instanceof Response) {
             throw new \Exception('Response is not an instance of Response');
         }

[NoCoverage] InstanceOf_
Adebipe/Router/Router.php:71:9
         }
         $response = $injector->execute($method, null, $parameters);
         // Check if the response is an instance of Response
-        if (!($response instanceof Response)) {
+        if (!false) {
             throw new \Exception('Response is not an instance of Response');
         }

[NoCoverage] Throw_
Adebipe/Router/Router.php:72:13
         $response = $injector->execute($method, null, $parameters);
         // Check if the response is an instance of Response
         if (!($response instanceof Response)) {
-            throw new \Exception('Response is not an instance of Response');
+            new \Exception('Response is not an instance of Response');
         }
         return $response;

[NoCoverage] PublicVisibility
Adebipe/Router/Router.php:85:5
      *
      * @return Response
      */
-    public function getResponse(Request $request, Injector $injector): Response
+    protected function getResponse(Request $request, Injector $injector) : Response
     {
         $header = [];

[NoCoverage] Identical
Adebipe/Router/Router.php:90:13
         $header = [];
         $allowedOrigin = Settings::getConfig('APP.CORS');
         if ($request->origin) {
-            if ($allowedOrigin === "*") {
+            if ($allowedOrigin !== "*") {
                 $allowedOrigin = [$request->origin];
             }

[NoCoverage] IfNegation
Adebipe/Router/Router.php:93:13
             if ($allowedOrigin === "*") {
                 $allowedOrigin = [$request->origin];
             }
-            if (in_array($request->origin, $allowedOrigin)) {
-                $header['Access-Control-Allow-Origin'] = $request->origin;
-            } else {
-                return new \Adebipe\Router\Response('Not allowed', 403);
-            }
+            if (!in_array($request->origin, $allowedOrigin)) {
         }
         // Remove double slashes or more in the uri

[NoCoverage] DecrementInteger
Adebipe/Router/Router.php:96:17
             if (in_array($request->origin, $allowedOrigin)) {
                 $header['Access-Control-Allow-Origin'] = $request->origin;
             } else {
-                return new \Adebipe\Router\Response('Not allowed', 403);
+                return new \Adebipe\Router\Response('Not allowed', 402);
             }
         }

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:96:17
             if (in_array($request->origin, $allowedOrigin)) {
                 $header['Access-Control-Allow-Origin'] = $request->origin;
             } else {
-                return new \Adebipe\Router\Response('Not allowed', 403);
+                return new \Adebipe\Router\Response('Not allowed', 404);
             }
         }

[NoCoverage] Coalesce
Adebipe/Router/Router.php:100:9
             }
         }
         // Remove double slashes or more in the uri
-        $request->uri = preg_replace('(\/+)', '/', $request->uri) ?? '';
+        $request->uri = '' ?? preg_replace('(\\/+)', '/', $request->uri);
 
         if (is_file("public" . $request->uri)) {

[NoCoverage] IfNegation
Adebipe/Router/Router.php:102:9
         // Remove double slashes or more in the uri
         $request->uri = preg_replace('(\/+)', '/', $request->uri) ?? '';
 
-        if (is_file("public" . $request->uri)) {
-            // The request is a file
-            $this->_logger->info('Get file: ' . $request->uri);
-            $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
-            return new Response(
-                file_get_contents("public" . $request->uri) ?: "Error",
-                200,
-                [
-                    'Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]
-                ]
-            );
-        }
+        if (!is_file("public" . $request->uri)) {
         // update the routes
         $this->_routeKeeper->updateRoutes();

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:102:9
         // Remove double slashes or more in the uri
         $request->uri = preg_replace('(\/+)', '/', $request->uri) ?? '';
 
-        if (is_file("public" . $request->uri)) {
+        if (is_file($request->uri)) {
             // The request is a file
             $this->_logger->info('Get file: ' . $request->uri);

[NoCoverage] MethodCallRemoval
Adebipe/Router/Router.php:104:13
 
         if (is_file("public" . $request->uri)) {
             // The request is a file
-            $this->_logger->info('Get file: ' . $request->uri);
+            
             $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
             return new Response(

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:104:13
 
         if (is_file("public" . $request->uri)) {
             // The request is a file
-            $this->_logger->info('Get file: ' . $request->uri);
+            $this->_logger->info('Get file: ');
             $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
             return new Response(

[NoCoverage] Concat
Adebipe/Router/Router.php:105:13
         if (is_file("public" . $request->uri)) {
             // The request is a file
             $this->_logger->info('Get file: ' . $request->uri);
-            $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
+            $mime = json_decode(file_get_contents('/mime.json' . __DIR__) ?: "[]", true);
             return new Response(
                 file_get_contents("public" . $request->uri) ?: "Error",

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:105:13
         if (is_file("public" . $request->uri)) {
             // The request is a file
             $this->_logger->info('Get file: ' . $request->uri);
-            $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
+            $mime = json_decode(file_get_contents(__DIR__) ?: "[]", true);
             return new Response(
                 file_get_contents("public" . $request->uri) ?: "Error",

[NoCoverage] Concat
Adebipe/Router/Router.php:107:17
             $this->_logger->info('Get file: ' . $request->uri);
             $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
             return new Response(
-                file_get_contents("public" . $request->uri) ?: "Error",
+                return new Response(file_get_contents($request->uri . "public") ?: "Error", 200, ['Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]]);
                 200,
                 [

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:107:17
             $this->_logger->info('Get file: ' . $request->uri);
             $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
             return new Response(
-                file_get_contents("public" . $request->uri) ?: "Error",
+                return new Response(file_get_contents("public") ?: "Error", 200, ['Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]]);
                 200,
                 [

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:108:17
             $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
             return new Response(
                 file_get_contents("public" . $request->uri) ?: "Error",
-                200,
+                return new Response(file_get_contents("public" . $request->uri) ?: "Error", 201, ['Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]]);
                 [
                     'Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]

[NoCoverage] DecrementInteger
Adebipe/Router/Router.php:108:17
             $mime = json_decode(file_get_contents(__DIR__ . '/mime.json') ?: "[]", true);
             return new Response(
                 file_get_contents("public" . $request->uri) ?: "Error",
-                200,
+                return new Response(file_get_contents("public" . $request->uri) ?: "Error", 199, ['Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]]);
                 [
                     'Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]

[NoCoverage] Concat
Adebipe/Router/Router.php:110:21
                 file_get_contents("public" . $request->uri) ?: "Error",
                 200,
                 [
-                    'Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]
+                    return new Response(file_get_contents("public" . $request->uri) ?: "Error", 200, ['Content-Type' => $mime[pathinfo($request->uri . "public", PATHINFO_EXTENSION)]]);
                 ]
             );

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:110:21
                 file_get_contents("public" . $request->uri) ?: "Error",
                 200,
                 [
-                    'Content-Type' => $mime[pathinfo("public" . $request->uri, PATHINFO_EXTENSION)]
+                    return new Response(file_get_contents("public" . $request->uri) ?: "Error", 200, ['Content-Type' => $mime[pathinfo("public", PATHINFO_EXTENSION)]]);
                 ]
             );

[NoCoverage] MethodCallRemoval
Adebipe/Router/Router.php:115:9
             );
         }
         // update the routes
-        $this->_routeKeeper->updateRoutes();
+        
         $this->_logger->info('Get response for request: ' . $request->uri);
         // Find the route

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/Router.php:116:9
         }
         // update the routes
         $this->_routeKeeper->updateRoutes();
-        $this->_logger->info('Get response for request: ' . $request->uri);
+        $this->_logger->info($request->uri);
         // Find the route
         $result = $this->_routeKeeper->findRoute($request->uri, $request->method);

[NoCoverage] MethodCallRemoval
Adebipe/Router/Router.php:116:9
         }
         // update the routes
         $this->_routeKeeper->updateRoutes();
-        $this->_logger->info('Get response for request: ' . $request->uri);
+        
         // Find the route
         $result = $this->_routeKeeper->findRoute($request->uri, $request->method);

[NoCoverage] Identical
Adebipe/Router/Router.php:120:9
         // Find the route
         $result = $this->_routeKeeper->findRoute($request->uri, $request->method);
         // Check if the route is not found
-        if ($result === null) {
+        if ($result !== null) {
             throw new \Exception('An error occured while finding the route');
         }

[NoCoverage] Throw_
Adebipe/Router/Router.php:121:13
         $result = $this->_routeKeeper->findRoute($request->uri, $request->method);
         // Check if the route is not found
         if ($result === null) {
-            throw new \Exception('An error occured while finding the route');
+            new \Exception('An error occured while finding the route');
         }
         // Check if the route is not found

[NoCoverage] IfNegation
Adebipe/Router/Router.php:124:9
             throw new \Exception('An error occured while finding the route');
         }
         // Check if the route is not found
-        if (is_int($result[0])) {
-            return new Response($result[1], $result[0]);
-        }
+        if (!is_int($result[0])) {
         $route = $result[0];
         $request->router_params = $result[1];

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:124:9
             throw new \Exception('An error occured while finding the route');
         }
         // Check if the route is not found
-        if (is_int($result[0])) {
+        if (is_int($result[1])) {
             return new Response($result[1], $result[0]);
         }

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:125:13
         }
         // Check if the route is not found
         if (is_int($result[0])) {
-            return new Response($result[1], $result[0]);
+            return new Response($result[2], $result[0]);
         }
         $route = $result[0];

[NoCoverage] DecrementInteger
Adebipe/Router/Router.php:125:13
         }
         // Check if the route is not found
         if (is_int($result[0])) {
-            return new Response($result[1], $result[0]);
+            return new Response($result[0], $result[0]);
         }
         $route = $result[0];

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:127:9
         if (is_int($result[0])) {
             return new Response($result[1], $result[0]);
         }
-        $route = $result[0];
+        $route = $result[1];
         $request->router_params = $result[1];
         $add_to_injector = [

[NoCoverage] DecrementInteger
Adebipe/Router/Router.php:128:9
             return new Response($result[1], $result[0]);
         }
         $route = $result[0];
-        $request->router_params = $result[1];
+        $request->router_params = $result[0];
         $add_to_injector = [
             Request::class => $request,

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:128:9
             return new Response($result[1], $result[0]);
         }
         $route = $result[0];
-        $request->router_params = $result[1];
+        $request->router_params = $result[2];
         $add_to_injector = [
             Request::class => $request,

[NoCoverage] DecrementInteger
Adebipe/Router/Router.php:132:9
         $add_to_injector = [
             Request::class => $request,
         ];
-        $add_to_injector = array_merge($add_to_injector, $result[1]);
+        $add_to_injector = array_merge($add_to_injector, $result[0]);
         $response = $this->_executeRoute($route, $add_to_injector, $injector);
         return $response;

[NoCoverage] IncrementInteger
Adebipe/Router/Router.php:132:9
         $add_to_injector = [
             Request::class => $request,
         ];
-        $add_to_injector = array_merge($add_to_injector, $result[1]);
+        $add_to_injector = array_merge($add_to_injector, $result[2]);
         $response = $this->_executeRoute($route, $add_to_injector, $injector);
         return $response;
