[Killed] Identical
Adebipe/Core/Utils/ConfigRunner.php:23:9
     public function __construct()
     {
         $env = getenv('ENV');
-        if ($env === false) {
+        if ($env !== false) {
             throw new \Exception("The environment variable ENV is not set");
         }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Exception:
The environment variable ENV is not set
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(19): Adebipe\Services\ConfigRunner->__construct()
#1 /tmp/infection/interceptor.autoload.11f9a3d5f858b094632e5506133959c9.infection.php(13): require_once('...')
#2 /home/runner/work/Adebipe/Adebipe/vendor/phpu

[Killed] FalseValue
Adebipe/Core/Utils/ConfigRunner.php:23:9
     public function __construct()
     {
         $env = getenv('ENV');
-        if ($env === false) {
+        if ($env === true) {
             throw new \Exception("The environment variable ENV is not set");
         }
killedBy: ConfigRunnerTest::testNoEnv
statusReason: 1) ConfigRunnerTest::testNoEnv
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 6, Assertions: 16, Failures: 1.

[Killed] Throw_
Adebipe/Core/Utils/ConfigRunner.php:24:13
     {
         $env = getenv('ENV');
         if ($env === false) {
-            throw new \Exception("The environment variable ENV is not set");
+            new \Exception("The environment variable ENV is not set");
         }
         $files = [
killedBy: ConfigRunnerTest::testNoEnv
statusReason: 1) ConfigRunnerTest::testNoEnv
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 2, Assertions: 6, Failures: 1.

[Killed] Concat
Adebipe/Core/Utils/ConfigRunner.php:28:13
         }
         $files = [
             ".env",
-            ".env." . $env,
+            $files = [".env", $env . ".env.", ".env.local", ".env." . $env . ".local"];
             ".env.local",
             ".env." . $env . ".local"
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:16

FAILURES!
Tests: 5, Assertions: 13, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/ConfigRunner.php:28:13
         }
         $files = [
             ".env",
-            ".env." . $env,
+            $files = [".env", ".env.", ".env.local", ".env." . $env . ".local"];
             ".env.local",
             ".env." . $env . ".local"
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:16

FAILURES!
Tests: 5, Assertions: 13, Failures: 1.

[Killed] Concat
Adebipe/Core/Utils/ConfigRunner.php:30:13
             ".env",
             ".env." . $env,
             ".env.local",
-            ".env." . $env . ".local"
+            $files = [".env", ".env." . $env, ".env.local", ".env." . ".local" . $env];
         ];
         foreach ($files as $file) {
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:17

FAILURES!
Tests: 5, Assertions: 14, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/ConfigRunner.php:30:13
             ".env",
             ".env." . $env,
             ".env.local",
-            ".env." . $env . ".local"
+            $files = [".env", ".env." . $env, ".env.local", ".env." . $env];
         ];
         foreach ($files as $file) {
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:17

FAILURES!
Tests: 5, Assertions: 14, Failures: 1.

[Killed] Foreach_
Adebipe/Core/Utils/ConfigRunner.php:32:9
             ".env.local",
             ".env." . $env . ".local"
         ];
-        foreach ($files as $file) {
-            if (is_file($file)) {
-                $this->_readEnvFile($file);
-            }
-        }
+        foreach (array() as $file) {
         // If the config file is set
         if ($config_name = $this->_variable['CONFIG'] ?? null) {
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] IfNegation
Adebipe/Core/Utils/ConfigRunner.php:33:13
             ".env." . $env . ".local"
         ];
         foreach ($files as $file) {
-            if (is_file($file)) {
-                $this->_readEnvFile($file);
-            }
+            if (!is_file($file)) {
         }
         // If the config file is set
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] MethodCallRemoval
Adebipe/Core/Utils/ConfigRunner.php:34:17
         ];
         foreach ($files as $file) {
             if (is_file($file)) {
-                $this->_readEnvFile($file);
+                
             }
         }
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] Identical
Adebipe/Core/Utils/ConfigRunner.php:40:13
         // If the config file is set
         if ($config_name = $this->_variable['CONFIG'] ?? null) {
             $config_dir = $this->_variable['CONFIG_DIR'] ?? null;
-            if ($config_dir === null) {
+            if ($config_dir !== null) {
                 $config_dir = 'config/';
             }
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/ConfigRunner.php:43:13
             if ($config_dir === null) {
                 $config_dir = 'config/';
             }
-            $config_path = $config_dir . '/' . $config_name . '.php';
+            $config_path = $config_dir . '/' . $config_name;
             $this->_readConfigFile($config_path);
         }
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] Concat
Adebipe/Core/Utils/ConfigRunner.php:43:13
             if ($config_dir === null) {
                 $config_dir = 'config/';
             }
-            $config_path = $config_dir . '/' . $config_name . '.php';
+            $config_path = '/' . $config_dir . $config_name . '.php';
             $this->_readConfigFile($config_path);
         }
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] MethodCallRemoval
Adebipe/Core/Utils/ConfigRunner.php:44:13
                 $config_dir = 'config/';
             }
             $config_path = $config_dir . '/' . $config_name . '.php';
-            $this->_readConfigFile($config_path);
+            
         }
         foreach ($this->_variable as $key => $value) {
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] Foreach_
Adebipe/Core/Utils/ConfigRunner.php:46:9
             $config_path = $config_dir . '/' . $config_name . '.php';
             $this->_readConfigFile($config_path);
         }
-        foreach ($this->_variable as $key => $value) {
-            Settings::addEnvVariable($key, $value);
-        }
+        foreach (array() as $key => $value) {
     }
 
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:14

FAILURES!
Tests: 5, Assertions: 11, Failures: 1.

[Killed] MethodCallRemoval
Adebipe/Core/Utils/ConfigRunner.php:47:13
             $this->_readConfigFile($config_path);
         }
         foreach ($this->_variable as $key => $value) {
-            Settings::addEnvVariable($key, $value);
+            
         }
     }
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:14

FAILURES!
Tests: 5, Assertions: 11, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/ConfigRunner.php:70:9
      */
     public function atStart(Logger $logger = null): void
     {
-        if (!$logger) {
+        if ($logger) {
             throw new \Exception("Logger service not found");
         }
killedBy: ConfigRunnerTest::testLoggerInfo
statusReason: 1) ConfigRunnerTest::testLoggerError
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to a member function info() on null" at
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php:64
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:44
.

ERRORS!
Tests: 4, Assertions: 8, Errors

[Killed] Throw_
Adebipe/Core/Utils/ConfigRunner.php:71:13
     public function atStart(Logger $logger = null): void
     {
         if (!$logger) {
-            throw new \Exception("Logger service not found");
+            new \Exception("Logger service not found");
         }
         $logger->info('Initialize the environment variables');
killedBy: ConfigRunnerTest::testLoggerError
statusReason: 1) ConfigRunnerTest::testLoggerError
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to a member function info() on null" at
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php:64
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:44
.

FAILURES!
Tests: 4, Assertions: 9, Fail

[Killed] MethodCallRemoval
Adebipe/Core/Utils/ConfigRunner.php:73:9
         if (!$logger) {
             throw new \Exception("Logger service not found");
         }
-        $logger->info('Initialize the environment variables');
+        
     }
 
killedBy: ConfigRunnerTest::testLoggerInfo
statusReason: 1) ConfigRunnerTest::testLoggerInfo
Failed asserting that '[2024-03-11 16:58:59] (  ERROR)            MsQl : PDO can't be opened\n
' matches PCRE pattern "/Initialize the environment variables/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:35

FAILURES!
Tests: 3, Assertions: 8, Failures: 1.

[Killed] IfNegation
Adebipe/Core/Utils/ConfigRunner.php:94:9
      */
     private function _readConfigFile(string $config_path): void
     {
-        if (is_file($config_path)) {
-            $config = include_once $config_path;
-            Settings::addConfigArray($config['config'] ?? [], false);
-            foreach ($config['env_var'] ?? [] as $key => $value) {
-                $this->_variable[$key] = $value;
-            }
-        }
+        if (!is_file($config_path)) {
     }
 
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] MethodCallRemoval
Adebipe/Core/Utils/ConfigRunner.php:96:13
     {
         if (is_file($config_path)) {
             $config = include_once $config_path;
-            Settings::addConfigArray($config['config'] ?? [], false);
+            
             foreach ($config['env_var'] ?? [] as $key => $value) {
                 $this->_variable[$key] = $value;
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] FalseValue
Adebipe/Core/Utils/ConfigRunner.php:96:13
     {
         if (is_file($config_path)) {
             $config = include_once $config_path;
-            Settings::addConfigArray($config['config'] ?? [], false);
+            Settings::addConfigArray($config['config'] ?? [], true);
             foreach ($config['env_var'] ?? [] as $key => $value) {
                 $this->_variable[$key] = $value;
killedBy: SettingTest::testAddConfig
statusReason: 1) SettingTest::testAddConfig
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
+    'DIR' => 'src/'
+    'CORE' => [...]

[Killed] Coalesce
Adebipe/Core/Utils/ConfigRunner.php:97:13
         if (is_file($config_path)) {
             $config = include_once $config_path;
             Settings::addConfigArray($config['config'] ?? [], false);
-            foreach ($config['env_var'] ?? [] as $key => $value) {
+            foreach ([] ?? $config['env_var'] as $key => $value) {
                 $this->_variable[$key] = $value;
             }
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:18

FAILURES!
Tests: 5, Assertions: 15, Failures: 1.

[Killed] Foreach_
Adebipe/Core/Utils/ConfigRunner.php:97:13
         if (is_file($config_path)) {
             $config = include_once $config_path;
             Settings::addConfigArray($config['config'] ?? [], false);
-            foreach ($config['env_var'] ?? [] as $key => $value) {
-                $this->_variable[$key] = $value;
-            }
+            foreach (array() as $key => $value) {
         }
     }
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:18

FAILURES!
Tests: 5, Assertions: 15, Failures: 1.

[Killed] While_
Adebipe/Core/Utils/ConfigRunner.php:117:9
         if ($file === false) {
             return;
         }
-        while (!feof($file)) {
-            $line = fgets($file);
-            // @infection-ignore-all
-            if ($line === false) {
-                continue;
-            }
-            $line = trim($line);
-            if (empty($line)) {
-                continue;
-            }
-            if (str_starts_with($line, "#")) {
-                continue;
-            }
-            if (strpos($line, '=') === false) {
-                throw new \Exception("Invalid line in the file " . $name . ": " . $line);
-            }
-            $line = explode('=', $line);
-            $this->_variable[$line[0]] = $line[1];
-        }
+        while (false) {
     }
 }
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] LogicalNot
Adebipe/Core/Utils/ConfigRunner.php:117:9
         if ($file === false) {
             return;
         }
-        while (!feof($file)) {
+        while (feof($file)) {
             $line = fgets($file);
             // @infection-ignore-all
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] UnwrapTrim
Adebipe/Core/Utils/ConfigRunner.php:123:13
             if ($line === false) {
                 continue;
             }
-            $line = trim($line);
+            $line = $line;
             if (empty($line)) {
                 continue;
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Exception:
Invalid line in the file .env.test: 

#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php(27): Adebipe\Services\ConfigRunner->_readEnvFile()
#1 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(19): Adebipe\Services\ConfigRunner->__construct()
#2 /tmp/infection/intercepto

[Killed] Continue_
Adebipe/Core/Utils/ConfigRunner.php:125:17
             }
             $line = trim($line);
             if (empty($line)) {
-                continue;
+                break;
             }
             if (str_starts_with($line, "#")) {
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:16

FAILURES!
Tests: 5, Assertions: 13, Failures: 1.

[Killed] IfNegation
Adebipe/Core/Utils/ConfigRunner.php:127:13
             if (empty($line)) {
                 continue;
             }
-            if (str_starts_with($line, "#")) {
-                continue;
-            }
+            if (!str_starts_with($line, "#")) {
             if (strpos($line, '=') === false) {
                 throw new \Exception("Invalid line in the file " . $name . ": " . $line);
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i

[Killed] Continue_
Adebipe/Core/Utils/ConfigRunner.php:128:17
                 continue;
             }
             if (str_starts_with($line, "#")) {
-                continue;
+                break;
             }
             if (strpos($line, '=') === false) {
killedBy: ConfigRunnerTest::testIfIsEnvFileExists
statusReason: 1) ConfigRunnerTest::testIfIsEnvFileExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:16

FAILURES!
Tests: 5, Assertions: 13, Failures: 1.

[Killed] FalseValue
Adebipe/Core/Utils/ConfigRunner.php:130:13
             if (str_starts_with($line, "#")) {
                 continue;
             }
-            if (strpos($line, '=') === false) {
+            if (strpos($line, '=') === true) {
                 throw new \Exception("Invalid line in the file " . $name . ": " . $line);
             }
killedBy: ConfigRunnerTest::testException
statusReason: 1) ConfigRunnerTest::testException
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 10, Assertions: 22, Failures: 1.

[Killed] Identical
Adebipe/Core/Utils/ConfigRunner.php:130:13
             if (str_starts_with($line, "#")) {
                 continue;
             }
-            if (strpos($line, '=') === false) {
+            if (strpos($line, '=') !== false) {
                 throw new \Exception("Invalid line in the file " . $name . ": " . $line);
             }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Exception:
Invalid line in the file .env: CONFIG_DIR=src/Config
#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php(27): Adebipe\Services\ConfigRunner->_readEnvFile()
#1 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(19): Adebipe\Services\ConfigRunner->__construct()
#2 /tmp/infec

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/ConfigRunner.php:131:17
                 continue;
             }
             if (strpos($line, '=') === false) {
-                throw new \Exception("Invalid line in the file " . $name . ": " . $line);
+                throw new \Exception("Invalid line in the file " . $name . $line);
             }
             $line = explode('=', $line);
killedBy: ConfigRunnerTest::testException
statusReason: 1) ConfigRunnerTest::testException
Failed asserting that exception message 'Invalid line in the file tests/other/test.enververiovzebjkcpiozepjd' matches '/^Invalid line in the file .+: .+$/'.

FAILURES!
Tests: 6, Assertions: 13, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/ConfigRunner.php:131:17
                 continue;
             }
             if (strpos($line, '=') === false) {
-                throw new \Exception("Invalid line in the file " . $name . ": " . $line);
+                throw new \Exception("Invalid line in the file " . ": " . $line);
             }
             $line = explode('=', $line);
killedBy: ConfigRunnerTest::testException
statusReason: 1) ConfigRunnerTest::testException
Failed asserting that exception message 'Invalid line in the file : erveriovzebjkcpiozepjd' matches '/^Invalid line in the file .+: .+$/'.

FAILURES!
Tests: 6, Assertions: 13, Failures: 1.

[Killed] IncrementInteger
Adebipe/Core/Utils/ConfigRunner.php:134:13
                 throw new \Exception("Invalid line in the file " . $name . ": " . $line);
             }
             $line = explode('=', $line);
-            $this->_variable[$line[0]] = $line[1];
+            $this->_variable[$line[0]] = $line[2];
         }
     }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: TypeError:
Adebipe\Services\Settings::addEnvVariable(): Argument #2 ($value) must be of type string, null given, called in /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php on line 40
#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php(40): Adebipe\Services\

[Killed] IncrementInteger
Adebipe/Core/Utils/ConfigRunner.php:134:13
                 throw new \Exception("Invalid line in the file " . $name . ": " . $line);
             }
             $line = explode('=', $line);
-            $this->_variable[$line[0]] = $line[1];
+            $this->_variable[$line[1]] = $line[1];
         }
     }
statusReason: Failed opening required '/home/runner/work/Adebipe/Adebipe/vendor/fidry/cpu-core-counter/bin/../vendor/autoload.php' (include_path='.:/usr/share/php')
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Typed static property Adebipe\Cli\MakeClasses::$injector must not be accessed before initialization
#0 /home/runner/work/Adebipe/Adebipe/public/index.php(6): i
