[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:26:5
      *
      * @return void
      */
-    public function addService(object $service): void
+    protected function addService(object $service) : void
     {
         $this->_services[$service::class] = $service;
statusReason: [2024-03-11 16:59:01] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:01] (   INFO)     MakeClasses : Initialize the services
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Container::addService() from scope Adebipe\Cli\MakeClasses
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(22): Adebipe

[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:38:5
      *
      * @return object
      */
-    public function getService(string $name): object
+    protected function getService(string $name) : object
     {
         if (!isset($this->_services[$name])) {
killedBy: ConfigRunnerTest::testLoggerInfo
statusReason: 1) ContainerTest::testGetInvalidService
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to protected method Adebipe\Services\Container::getService() from scope ContainerTest" at
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:35
.

ERRORS!
Tests: 8, Assertions: 13, Errors: 2, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Container.php:56:9
     private function _createClass(ReflectionClass $reflection): object
     {
         $injector = $this->getService(Injector::class);
-        if (!$injector instanceof Injector) {
+        if ($injector instanceof Injector) {
             throw new \Exception('The injector is not an instance of Injector');
         }
killedBy: ContainerTest::testCreateClass
statusReason: 1) ContainerTest::testCreateClassWithInvalidInjector
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method FalseInjector::createClass()" at
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:54
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:37
/home/runner/work/Adebipe/Ade

[Killed] InstanceOf_
Adebipe/Core/Utils/Container.php:56:9
     private function _createClass(ReflectionClass $reflection): object
     {
         $injector = $this->getService(Injector::class);
-        if (!$injector instanceof Injector) {
+        if (!false) {
             throw new \Exception('The injector is not an instance of Injector');
         }
killedBy: ContainerTest::testCreateClass
statusReason: 1) ContainerTest::testCreateClass
Exception: The injector is not an instance of Injector

/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:52
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:37
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:72

ERRORS!

[Killed] Throw_
Adebipe/Core/Utils/Container.php:57:13
     {
         $injector = $this->getService(Injector::class);
         if (!$injector instanceof Injector) {
-            throw new \Exception('The injector is not an instance of Injector');
+            new \Exception('The injector is not an instance of Injector');
         }
         return $injector->createClass($reflection);
killedBy: ContainerTest::testCreateClassWithInvalidInjector
statusReason: 1) ContainerTest::testCreateClassWithInvalidInjector
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method FalseInjector::createClass()" at
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:54
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:37
/home/runner/work/Adebipe/Ade

[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:67:5
      *
      * @return array<object>
      */
-    public function getServices(): array
+    protected function getServices() : array
     {
         return $this->_services;
killedBy: ContainerTest::testAddGetServices
statusReason: 1) ContainerTest::testAddGetServices
Error: Call to protected method Adebipe\Services\Container::getServices() from scope ContainerTest

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:26

ERRORS!
Tests: 9, Assertions: 21, Errors: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:79:5
      *
      * @return void
      */
-    public function addReflection(ReflectionClass $reflection): void
+    protected function addReflection(ReflectionClass $reflection) : void
     {
         $this->_reflections_classes[$reflection->getName()] = $reflection;
statusReason: [2024-03-11 16:59:01] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:01] (   INFO)     MakeClasses : Initialize the services
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Container::addReflection() from scope Adebipe\Cli\MakeClasses
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(22): Adeb

[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:91:5
      *
      * @return ReflectionClass
      */
-    public function getReflection(string $name): ReflectionClass
+    protected function getReflection(string $name) : ReflectionClass
     {
         if (!isset($this->_reflections_classes[$name])) {
killedBy: ContainerTest::testGetReflection
statusReason: 1) ContainerTest::testGetReflection
Error: Call to protected method Adebipe\Services\Container::getReflection() from scope ContainerTest

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:40

2) ContainerTest::testAddGetReflection
Error: Call to protected method Adebipe\Services\Container::getReflection() from scope ContainerTest

[Killed] LogicalNot
Adebipe/Core/Utils/Container.php:93:9
      */
     public function getReflection(string $name): ReflectionClass
     {
-        if (!isset($this->_reflections_classes[$name])) {
+        if (isset($this->_reflections_classes[$name])) {
             throw new \Exception('Service not found');
         }
killedBy: ContainerTest::testGetInvalidService
statusReason: 1) ContainerTest::testGetInvalidService
Failed asserting that exception of type "TypeError" matches expected exception "Exception". Message was: "Adebipe\Services\Container::getReflection(): Return value must be of type ReflectionClass, null returned" at
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:88
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Cont

[Killed] Throw_
Adebipe/Core/Utils/Container.php:94:13
     public function getReflection(string $name): ReflectionClass
     {
         if (!isset($this->_reflections_classes[$name])) {
-            throw new \Exception('Service not found');
+            new \Exception('Service not found');
         }
         return $this->_reflections_classes[$name];
killedBy: ContainerTest::testGetInvalidService
statusReason: 1) ContainerTest::testGetInvalidService
Failed asserting that exception of type "TypeError" matches expected exception "Exception". Message was: "Adebipe\Services\Container::getReflection(): Return value must be of type ReflectionClass, null returned" at
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Container.php:88
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Cont

[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:104:5
      *
      * @return array<ReflectionClass>
      */
-    public function getReflections(): array
+    protected function getReflections() : array
     {
         return $this->_reflections_classes;
killedBy: ContainerTest::testGetReflections
statusReason: 1) ContainerTest::testGetReflections
Error: Call to protected method Adebipe\Services\Container::getReflections() from scope ContainerTest

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:51

ERRORS!
Tests: 9, Assertions: 22, Errors: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Container.php:116:5
      *
      * @return array
      */
-    public function getSubclassInterfaces(string $subclass): array
+    protected function getSubclassInterfaces(string $subclass) : array
     {
         $interfaces = [];
killedBy: ContainerTest::testGetSubclassInterfaces
statusReason: 1) ContainerTest::testGetSubclassInterfaces
Error: Call to protected method Adebipe\Services\Container::getSubclassInterfaces() from scope ContainerTest

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:100

ERRORS!
Tests: 9, Assertions: 14, Errors: 1.

[Killed] Foreach_
Adebipe/Core/Utils/Container.php:119:9
     public function getSubclassInterfaces(string $subclass): array
     {
         $interfaces = [];
-        foreach ($this->_services as $name => $service) {
-            if (is_subclass_of($service, $subclass)) {
-                $interfaces[$name] = $service;
-            }
-        }
+        foreach (array() as $name => $service) {
         return $interfaces;
     }
killedBy: ContainerTest::testGetSubclassInterfaces
statusReason: 1) ContainerTest::testGetSubclassInterfaces
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:102

FAILURES!
Tests: 9, Assertions: 16, Failures: 1.

[Killed] IfNegation
Adebipe/Core/Utils/Container.php:120:13
     {
         $interfaces = [];
         foreach ($this->_services as $name => $service) {
-            if (is_subclass_of($service, $subclass)) {
-                $interfaces[$name] = $service;
-            }
+            if (!is_subclass_of($service, $subclass)) {
         }
         return $interfaces;
killedBy: ContainerTest::testGetSubclassInterfaces
statusReason: 1) ContainerTest::testGetSubclassInterfaces
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ContainerTest.php:102

FAILURES!
Tests: 9, Assertions: 16, Failures: 1.
