[Killed] PublicVisibility
Adebipe/Core/Utils/Injector.php:33:5
      *
      * @return void
      */
-    public function addService(RegisterServiceInterface $class): void
+    protected function addService(RegisterServiceInterface $class) : void
     {
         $this->_logger->debug('Add service: ' . $class::class);
statusReason: [2024-03-11 16:59:02] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Initialize the services
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Injector::addService() from scope Adebipe\Cli\MakeClasses
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(22): Adebipe\

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:35:9
      */
     public function addService(RegisterServiceInterface $class): void
     {
-        $this->_logger->debug('Add service: ' . $class::class);
+        $this->_logger->debug($class::class);
         $this->_services[$class::class] = $class;
     }
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Failed asserting that '[2024-03-11 16:59:02] (  DEBUG)        Injector : FalseRegisterClass\n
' matches PCRE pattern "/\: Add service\: ..*$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Concat
Adebipe/Core/Utils/Injector.php:35:9
      */
     public function addService(RegisterServiceInterface $class): void
     {
-        $this->_logger->debug('Add service: ' . $class::class);
+        $this->_logger->debug($class::class . 'Add service: ');
         $this->_services[$class::class] = $class;
     }
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Failed asserting that '[2024-03-11 16:59:02] (  DEBUG)        Injector : FalseRegisterClassAdd service: \n
' matches PCRE pattern "/\: Add service\: ..*$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Injector.php:46:5
      *
      * @return ?RegisterServiceInterface The service
      */
-    public function getService(string $name): ?RegisterServiceInterface
+    protected function getService(string $name) : ?RegisterServiceInterface
     {
         if (isset($this->_services[$name])) {
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Error: Call to protected method Adebipe\Services\Injector::getService() from scope InjectorTest

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:27

ERRORS!
Tests: 7, Assertions: 10, Errors: 1.

[Killed] Identical
Adebipe/Core/Utils/Injector.php:71:13
             $param_name = $param->getName();
             $param_type = $param->getType();
 
-            if ($param_type === null) {
+            if ($param_type !== null) {
                 throw new \Exception(
                     'Param ' . $param_name . ' in method ' . $method->getName() .
statusReason: [2024-03-11 16:59:02] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] Throw_
Adebipe/Core/Utils/Injector.php:72:17
             $param_type = $param->getType();
 
             if ($param_type === null) {
-                throw new \Exception(
-                    'Param ' . $param_name . ' in method ' . $method->getName() .
-                        ' in class ' . $method->getDeclaringClass()->getName() . ' has no type'
-                );
+                new \Exception('Param ' . $param_name . ' in method ' . $method->getName() . ' in class ' . $method->getDeclaringClass()->getName() . ' has no type');
             }
             $result = $this->_findParamsWithType($param_type, $params);
killedBy: InjectorTest::testInjectParamsNoType
statusReason: 1) InjectorTest::testInjectParamsNoType
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Injector.php:90
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Injector.php:66
/home/runner/work/Adebipe/Adebipe/tests/abstract/Invoker.php:18
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:37
.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:73:21
 
             if ($param_type === null) {
                 throw new \Exception(
-                    'Param ' . $param_name . ' in method ' . $method->getName() .
-                        ' in class ' . $method->getDeclaringClass()->getName() . ' has no type'
+                    throw new \Exception('Param ' . $param_name . ' in method ' . $method->getName() . ' in class ' . ' has no type');' has no type'
                 );
             }
killedBy: InjectorTest::testInjectParamsNoType
statusReason: 1) InjectorTest::testInjectParamsNoType
Failed asserting that exception message 'Param not in method noType in class  has no type' matches '/^Param .+ in method .+ in class .+ has no type$/'.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] Concat
Adebipe/Core/Utils/Injector.php:73:21
 
             if ($param_type === null) {
                 throw new \Exception(
-                    'Param ' . $param_name . ' in method ' . $method->getName() .
-                        ' in class ' . $method->getDeclaringClass()->getName() . ' has no type'
+                    throw new \Exception('Param ' . $param_name . ' in method ' . ' in class ' . $method->getName() . $method->getDeclaringClass()->getName() . ' has no type');' has no type'
                 );
             }
killedBy: InjectorTest::testInjectParamsNoType
statusReason: 1) InjectorTest::testInjectParamsNoType
Failed asserting that exception message 'Param not in method  in class noTypeFalseRegisterClass has no type' matches '/^Param .+ in method .+ in class .+ has no type$/'.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] NotIdentical
Adebipe/Core/Utils/Injector.php:78:13
                 );
             }
             $result = $this->_findParamsWithType($param_type, $params);
-            if ($result !== null) {
+            if ($result === null) {
                 $find_params[] = $result;
             } elseif (isset($params[$param_name])) {
statusReason: [2024-03-11 16:59:02] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:02] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] ElseIfNegation
Adebipe/Core/Utils/Injector.php:82:13
                 $find_params[] = $result;
             } elseif (isset($params[$param_name])) {
                 $find_params[] = $params[$param_name];
-            } elseif ($param->isDefaultValueAvailable()) {
-                $find_params[] = $param->getDefaultValue();
-            } elseif ($param->allowsNull()) {
+            } elseif (!$param->isDefaultValueAvailable()) {
                 $find_params[] = null;
             } else {
killedBy: InjectorTest::testTypeInjection
statusReason: 1) InjectorTest::testNoFoundValue
Failed asserting that exception message 'Internal error: Failed to retrieve the default value' matches '/^Param .+ in method .+ in class .+ can't be injected$/'.

ERRORS!
Tests: 4, Assertions: 6, Errors: 1, Failures: 1.

[Killed] ElseIfNegation
Adebipe/Core/Utils/Injector.php:84:13
                 $find_params[] = $params[$param_name];
             } elseif ($param->isDefaultValueAvailable()) {
                 $find_params[] = $param->getDefaultValue();
-            } elseif ($param->allowsNull()) {
-                $find_params[] = null;
-            } else {
+            } elseif (!$param->allowsNull()) {
                 throw new \Exception(
                     'Param ' . $param_name . ' in method ' . $method->getName() .
killedBy: InjectorTest::testTypeInjection
statusReason: 1) InjectorTest::testTypeInjection
Exception: Param wantNull in method otherType in class FalseRegisterClass can't be injected

/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Injector.php:76
/home/runner/work/Adebipe/Adebipe/tests/abstract/Invoker.php:18
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:46

2) InjectorTest::testExecuteMethod

[Killed] Throw_
Adebipe/Core/Utils/Injector.php:87:17
             } elseif ($param->allowsNull()) {
                 $find_params[] = null;
             } else {
-                throw new \Exception(
-                    'Param ' . $param_name . ' in method ' . $method->getName() .
-                        ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected'
-                );
+                new \Exception('Param ' . $param_name . ' in method ' . $method->getName() . ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected');
             }
         }
killedBy: InjectorTest::testNoFoundValue
statusReason: 1) InjectorTest::testNoFoundValue
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:88:21
                 $find_params[] = null;
             } else {
                 throw new \Exception(
-                    'Param ' . $param_name . ' in method ' . $method->getName() .
+                    throw new \Exception('Param ' . $param_name . $method->getName() . ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected');
                         ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected'
                 );
killedBy: InjectorTest::testNoFoundValue
statusReason: 1) InjectorTest::testNoFoundValue
Failed asserting that exception message 'Param nototherType in class FalseRegisterClass can't be injected' matches '/^Param .+ in method .+ in class .+ can't be injected$/'.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:88:21
                 $find_params[] = null;
             } else {
                 throw new \Exception(
-                    'Param ' . $param_name . ' in method ' . $method->getName() .
+                    throw new \Exception('Param ' . ' in method ' . $method->getName() . ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected');
                         ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected'
                 );
killedBy: InjectorTest::testNoFoundValue
statusReason: 1) InjectorTest::testNoFoundValue
Failed asserting that exception message 'Param  in method otherType in class FalseRegisterClass can't be injected' matches '/^Param .+ in method .+ in class .+ can't be injected$/'.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] UnwrapStrReplace
Adebipe/Core/Utils/Injector.php:107:9
      */
     private function _findParamsWithType(\ReflectionType $type, array $params = []): mixed
     {
-        $not_null = str_replace("?", "", $type->__toString());
+        $not_null = $type->__toString();
         if (in_array($not_null, array_keys($this->_services))) {
             return $this->_services[$not_null];
statusReason: [2024-03-11 16:59:03] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] IfNegation
Adebipe/Core/Utils/Injector.php:108:9
     private function _findParamsWithType(\ReflectionType $type, array $params = []): mixed
     {
         $not_null = str_replace("?", "", $type->__toString());
-        if (in_array($not_null, array_keys($this->_services))) {
-            return $this->_services[$not_null];
-        }
+        if (!in_array($not_null, array_keys($this->_services))) {
         if (in_array($not_null, array_keys($params))) {
             return $params[$not_null];
statusReason: [2024-03-11 16:59:03] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] IfNegation
Adebipe/Core/Utils/Injector.php:111:9
         if (in_array($not_null, array_keys($this->_services))) {
             return $this->_services[$not_null];
         }
-        if (in_array($not_null, array_keys($params))) {
-            return $params[$not_null];
-        }
+        if (!in_array($not_null, array_keys($params))) {
         return null;
     }
killedBy: InjectorTest::testTypeInjection
statusReason: 1) InjectorTest::testTypeInjection
Exception: Param not in method otherType in class FalseRegisterClass can't be injected

/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Injector.php:76
/home/runner/work/Adebipe/Adebipe/tests/abstract/Invoker.php:18
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:46

2) InjectorTest::testExecuteMethod

[Killed] PublicVisibility
Adebipe/Core/Utils/Injector.php:126:5
      *
      * @return mixed The result of the function
      */
-    public function execute(\ReflectionMethod $method, ?object $class, array $params = []): mixed
+    protected function execute(\ReflectionMethod $method, ?object $class, array $params = []) : mixed
     {
         $params = $this->_injectParams($method, $params);
statusReason: [2024-03-11 16:59:03] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] PublicVisibility
Adebipe/Core/Utils/Injector.php:141:5
      *
      * @return object The created class
      */
-    public function createClass(\ReflectionClass $class, array $params = []): object
+    protected function createClass(\ReflectionClass $class, array $params = []) : object
     {
         $constructor = $class->getConstructor();
statusReason: [2024-03-11 16:59:04] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:04] (   INFO)     MakeClasses : Initialize the services
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Injector::createClass() from scope Adebipe\Cli\MakeClasses
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(22): Adebipe

[Killed] Identical
Adebipe/Core/Utils/Injector.php:144:9
     public function createClass(\ReflectionClass $class, array $params = []): object
     {
         $constructor = $class->getConstructor();
-        if ($constructor === null) {
+        if ($constructor !== null) {
             $this->_logger->debug('Class ' . $class->getName() . ' has no constructor');
             return $class->newInstance();
statusReason: [2024-03-11 16:59:03] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:03] (   INFO)     MakeClasses : Initialize the services
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to a member function isPublic() on null
#0 /home/runner/work/Adebipe/Adebipe/services/Cli/MakeClasses.php(43): Adebipe\Services\Injector->createClass()
#1 /home/runn

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:145:13
     {
         $constructor = $class->getConstructor();
         if ($constructor === null) {
-            $this->_logger->debug('Class ' . $class->getName() . ' has no constructor');
+            $this->_logger->debug('Class ' . $class->getName());
             return $class->newInstance();
         }
killedBy: InjectorTest::testCreateClassNoConstructor
statusReason: 1) InjectorTest::testCreateClassNoConstructor
Failed asserting that '[2024-03-11 16:59:04] (  DEBUG)        Injector : Class FalseInjector\n
' matches PCRE pattern "/\: Class .+ has no constructor$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:81

FAILURES!
Tests: 7, Assertions: 11, Failures: 1.

[Killed] Concat
Adebipe/Core/Utils/Injector.php:145:13
     {
         $constructor = $class->getConstructor();
         if ($constructor === null) {
-            $this->_logger->debug('Class ' . $class->getName() . ' has no constructor');
+            $this->_logger->debug('Class ' . ' has no constructor' . $class->getName());
             return $class->newInstance();
         }
killedBy: InjectorTest::testCreateClassNoConstructor
statusReason: 1) InjectorTest::testCreateClassNoConstructor
Failed asserting that '[2024-03-11 16:59:04] (  DEBUG)        Injector : Class  has no constructorFalseInjector\n
' matches PCRE pattern "/\: Class .+ has no constructor$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:81

FAILURES!
Tests: 7, Assertions: 11, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Injector.php:148:9
             $this->_logger->debug('Class ' . $class->getName() . ' has no constructor');
             return $class->newInstance();
         }
-        if (!$constructor->isPublic()) {
+        if ($constructor->isPublic()) {
             throw new \Exception('Constructor of class ' . $class->getName() . ' is not public');
         }
statusReason: [2024-03-11 16:59:04] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:04] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:04] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:04] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:04] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] Concat
Adebipe/Core/Utils/Injector.php:149:13
             return $class->newInstance();
         }
         if (!$constructor->isPublic()) {
-            throw new \Exception('Constructor of class ' . $class->getName() . ' is not public');
+            throw new \Exception('Constructor of class ' . ' is not public' . $class->getName());
         }
         $params = $this->_injectParams($constructor, $params);
killedBy: InjectorTest::testCreateClassNoPublic
statusReason: 1) InjectorTest::testCreateClassNoPublic
Failed asserting that exception message 'Constructor of class  is not publicFalseRegisterClass' matches '/^Constructor of class .+ is not public$/'.

FAILURES!
Tests: 6, Assertions: 10, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:149:13
             return $class->newInstance();
         }
         if (!$constructor->isPublic()) {
-            throw new \Exception('Constructor of class ' . $class->getName() . ' is not public');
+            throw new \Exception('Constructor of class ' . ' is not public');
         }
         $params = $this->_injectParams($constructor, $params);
killedBy: InjectorTest::testCreateClassNoPublic
statusReason: 1) InjectorTest::testCreateClassNoPublic
Failed asserting that exception message 'Constructor of class  is not public' matches '/^Constructor of class .+ is not public$/'.

FAILURES!
Tests: 6, Assertions: 10, Failures: 1.
