[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:37:9
     public function __construct()
     {
         $log_folder = Settings::getConfig("CORE.LOGGER.LOG_FOLDER");
-        if (!$log_folder) {
+        if ($log_folder) {
             $log_folder = 'logs';
         }
killedBy: LoggerTest::testIfLogFolderExists
statusReason: 1) LoggerTest::testIfLogFolderExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:34

FAILURES!
Tests: 18, Assertions: 38, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:40:9
         if (!$log_folder) {
             $log_folder = 'logs';
         }
-        if (!is_dir($log_folder)) {
+        if (is_dir($log_folder)) {
             mkdir($log_folder);
         }
killedBy: LoggerTest::testIfLogFolderExists
statusReason: 1) LoggerTest::testIfLogFolderExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:34

FAILURES!
Tests: 18, Assertions: 38, Failures: 1.

[Killed] FunctionCallRemoval
Adebipe/Core/Utils/Logger.php:41:13
             $log_folder = 'logs';
         }
         if (!is_dir($log_folder)) {
-            mkdir($log_folder);
+            
         }
         $log_level = Settings::getConfig("CORE.LOGGER.LOG_LEVEL");
killedBy: LoggerTest::testIfLogFolderExists
statusReason: 1) LoggerTest::testIfLogFolderExists
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:34

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] Identical
Adebipe/Core/Utils/Logger.php:44:9
             mkdir($log_folder);
         }
         $log_level = Settings::getConfig("CORE.LOGGER.LOG_LEVEL");
-        if ($log_level === null) {
+        if ($log_level !== null) {
             $log_level = 1;
         }
killedBy: LoggerTest::testNoLogLevel
statusReason: 1) LoggerTest::testNoLogLevel
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'INFO'
+'DEBUG'

[Killed] IncrementInteger
Adebipe/Core/Utils/Logger.php:45:13
         }
         $log_level = Settings::getConfig("CORE.LOGGER.LOG_LEVEL");
         if ($log_level === null) {
-            $log_level = 1;
+            $log_level = 2;
         }
         $this->_loglevel = intval($log_level);
killedBy: LoggerTest::testNoLogLevel
statusReason: 1) LoggerTest::testNoLogLevel
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'INFO'
+'WARNING'

[Killed] LogicalOrNegation
Adebipe/Core/Utils/Logger.php:48:9
             $log_level = 1;
         }
         $this->_loglevel = intval($log_level);
-        if ($this->_loglevel < 0 || $this->_loglevel > 4) {
+        if (!($this->_loglevel < 0 || $this->_loglevel > 4)) {
             throw new \Exception('Invalid log level');
         }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Exception:
Invalid log level
#0 /home/runner/work/Adebipe/Adebipe/services/Cli/MakeClasses.php(37): Adebipe\Services\Logger->__construct()
#1 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(22): Adebipe\Cli\MakeClasses::makeClasses()
#2 /tmp/infection/interceptor.autoload.a73d42ac9dfc4203088b2b0cd0b33f70.infec

[Killed] LogicalOr
Adebipe/Core/Utils/Logger.php:48:9
             $log_level = 1;
         }
         $this->_loglevel = intval($log_level);
-        if ($this->_loglevel < 0 || $this->_loglevel > 4) {
+        if ($this->_loglevel < 0 && $this->_loglevel > 4) {
             throw new \Exception('Invalid log level');
         }
killedBy: LoggerTest::testLogLevelNeg
statusReason: 1) LoggerTest::testLogLevelNeg
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 20, Assertions: 41, Failures: 1.

[Killed] Throw_
Adebipe/Core/Utils/Logger.php:49:13
         }
         $this->_loglevel = intval($log_level);
         if ($this->_loglevel < 0 || $this->_loglevel > 4) {
-            throw new \Exception('Invalid log level');
+            new \Exception('Invalid log level');
         }
         if (!Settings::getConfig("CORE.LOGGER.LOG_IN_FILE")) {
killedBy: LoggerTest::testLogLevelNeg
statusReason: 1) LoggerTest::testLogLevelNeg
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:51:9
         if ($this->_loglevel < 0 || $this->_loglevel > 4) {
             throw new \Exception('Invalid log level');
         }
-        if (!Settings::getConfig("CORE.LOGGER.LOG_IN_FILE")) {
+        if (Settings::getConfig("CORE.LOGGER.LOG_IN_FILE")) {
             $this->_logFile = STDOUT;
         } else {
killedBy: LoggerTest::testStdoutLog
statusReason: 1) LoggerTest::testStdoutLog
--- Expected
+++ Actual
@@ @@
-resource(2) of type (stream)
+resource(1926) of type (stream)

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:91

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Logger.php:54:13
         if (!Settings::getConfig("CORE.LOGGER.LOG_IN_FILE")) {
             $this->_logFile = STDOUT;
         } else {
-            $this->_logFile = fopen($log_folder . "/" . date('Y-m-d-H-i-s') . '.log', 'wb');
+            $this->_logFile = fopen("/" . date('Y-m-d-H-i-s') . '.log', 'wb');
         }
         $this->info('Starting Logger');
statusReason: 1) LoggerTest::testFileLog
TypeError: fwrite(): Argument #1 ($stream) must be of type resource, bool given

/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php:152
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php:176
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php:44
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/

[Killed] Concat
Adebipe/Core/Utils/Logger.php:54:13
         if (!Settings::getConfig("CORE.LOGGER.LOG_IN_FILE")) {
             $this->_logFile = STDOUT;
         } else {
-            $this->_logFile = fopen($log_folder . "/" . date('Y-m-d-H-i-s') . '.log', 'wb');
+            $this->_logFile = fopen("/" . $log_folder . date('Y-m-d-H-i-s') . '.log', 'wb');
         }
         $this->info('Starting Logger');
statusReason: 1) LoggerTest::testFileLog
TypeError: fwrite(): Argument #1 ($stream) must be of type resource, bool given

/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php:152
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php:176
/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php:44
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/

[Killed] MethodCallRemoval
Adebipe/Core/Utils/Logger.php:56:9
         } else {
             $this->_logFile = fopen($log_folder . "/" . date('Y-m-d-H-i-s') . '.log', 'wb');
         }
-        $this->info('Starting Logger');
+        
     }
 
killedBy: LoggerTest::testLogStartingInfo
statusReason: 1) LoggerTest::testLogStartingInfo
TypeError: PHPUnit\Framework\Assert::assertMatchesRegularExpression(): Argument #2 ($string) must be of type string, null given, called in /home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php on line 84

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:84

2) LoggerTest::testNoSentryConnectionDebug
T

[Killed] PublicVisibility
Adebipe/Core/Utils/Logger.php:64:5
      *
      * @return string
      */
-    public function getLogLevels(): string
+    protected function getLogLevels() : string
     {
         return array_keys(self::$_loglevels)[$this->_loglevel];
killedBy: LoggerTest::testIsLogLevel
statusReason: 1) LoggerTest::testIsLogLevel
Error: Call to protected method Adebipe\Services\Logger::getLogLevels() from scope LoggerTest

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:20

2) LoggerTest::testNoLogLevel
Error: Call to protected method Adebipe\Services\Logger::getLogLevels() from scope LoggerTest

[Killed] LogicalAndAllSubExprNegation
Adebipe/Core/Utils/Logger.php:77:9
     public function atStart(): void
     {
         $class = Settings::getConfig("CORE.LOGGER.ERROR_CLASS");
-        if (!empty($class) && class_exists($class)) {
+        if (empty($class) && !class_exists($class)) {
             $instance = new $class();
             if (!$instance instanceof ErrorSenderInterface) {
statusReason: [2024-03-11 16:59:05] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:05] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:05] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:05] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:05] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:77:9
     public function atStart(): void
     {
         $class = Settings::getConfig("CORE.LOGGER.ERROR_CLASS");
-        if (!empty($class) && class_exists($class)) {
+        if (empty($class) && class_exists($class)) {
             $instance = new $class();
             if (!$instance instanceof ErrorSenderInterface) {
killedBy: LoggerTest::testSentryClass
statusReason: 1) LoggerTest::testSentryClass
Failed asserting that '[2024-03-11 16:59:05] (  DEBUG)          Logger : No sentry\n
' does not match PCRE pattern "/No sentry/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:144

FAILURES!
Tests: 15, Assertions: 21, Failures: 1.

[Killed] InstanceOf_
Adebipe/Core/Utils/Logger.php:79:13
         $class = Settings::getConfig("CORE.LOGGER.ERROR_CLASS");
         if (!empty($class) && class_exists($class)) {
             $instance = new $class();
-            if (!$instance instanceof ErrorSenderInterface) {
+            if (!true) {
                 throw new \Exception('The error sender must implement ErrorSenderInterface');
             }
killedBy: LoggerTest::testIsNotSentryClass
statusReason: 1) LoggerTest::testIsNotSentryClass
Failed asserting that exception message 'Cannot assign FalseSentryMock to property Adebipe\Services\Logger::$_sender of type Adebipe\Services\ErrorSenderInterface' contains 'The error sender must implement ErrorSenderInterface'.

FAILURES!
Tests: 16, Assertions: 23, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:79:13
         $class = Settings::getConfig("CORE.LOGGER.ERROR_CLASS");
         if (!empty($class) && class_exists($class)) {
             $instance = new $class();
-            if (!$instance instanceof ErrorSenderInterface) {
+            if ($instance instanceof ErrorSenderInterface) {
                 throw new \Exception('The error sender must implement ErrorSenderInterface');
             }
killedBy: LoggerTest::testSentryClass
statusReason: 1) LoggerTest::testIsNotSentryClass
Failed asserting that exception message 'Cannot assign FalseSentryMock to property Adebipe\Services\Logger::$_sender of type Adebipe\Services\ErrorSenderInterface' contains 'The error sender must implement ErrorSenderInterface'.

ERRORS!
Tests: 16, Assertions: 21, Errors: 1, Failures: 1.

[Killed] Throw_
Adebipe/Core/Utils/Logger.php:80:17
         if (!empty($class) && class_exists($class)) {
             $instance = new $class();
             if (!$instance instanceof ErrorSenderInterface) {
-                throw new \Exception('The error sender must implement ErrorSenderInterface');
+                new \Exception('The error sender must implement ErrorSenderInterface');
             }
             $this->_sender = $instance;
killedBy: LoggerTest::testIsNotSentryClass
statusReason: 1) LoggerTest::testIsNotSentryClass
Failed asserting that exception message 'Cannot assign FalseSentryMock to property Adebipe\Services\Logger::$_sender of type Adebipe\Services\ErrorSenderInterface' contains 'The error sender must implement ErrorSenderInterface'.

FAILURES!
Tests: 16, Assertions: 23, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Logger.php:83:13
                 throw new \Exception('The error sender must implement ErrorSenderInterface');
             }
             $this->_sender = $instance;
-            $this->info($class . ' sentry loaded');
+            $this->info($class);
         } else {
             $this->debug("No sentry");
killedBy: LoggerTest::testSentryClass
statusReason: 1) LoggerTest::testSentryClass
Failed asserting that '[2024-03-11 16:59:05] (   INFO)          Logger : SentryMock\n
' matches PCRE pattern "/SentryMock sentry loaded/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:145

FAILURES!
Tests: 15, Assertions: 22, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Logger.php:83:13
                 throw new \Exception('The error sender must implement ErrorSenderInterface');
             }
             $this->_sender = $instance;
-            $this->info($class . ' sentry loaded');
+            $this->info(' sentry loaded');
         } else {
             $this->debug("No sentry");
killedBy: LoggerTest::testSentryClass
statusReason: 1) LoggerTest::testSentryClass
Failed asserting that '[2024-03-11 16:59:05] (   INFO)          Logger :  sentry loaded\n
' matches PCRE pattern "/SentryMock sentry loaded/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:145

FAILURES!
Tests: 15, Assertions: 22, Failures: 1.

[Killed] MethodCallRemoval
Adebipe/Core/Utils/Logger.php:85:13
             $this->_sender = $instance;
             $this->info($class . ' sentry loaded');
         } else {
-            $this->debug("No sentry");
+            
         }
 
killedBy: LoggerTest::testNoSentryConnection
statusReason: 1) LoggerTest::testNoSentryConnection
Failed asserting that '[2024-03-11 16:59:06] (   INFO)          Logger : Starting Logger\n
' matches PCRE pattern "/No sentry/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:124

FAILURES!
Tests: 13, Assertions: 19, Failures: 1.

[Killed] FunctionCallRemoval
Adebipe/Core/Utils/Logger.php:88:9
             $this->debug("No sentry");
         }
 
-        set_error_handler(
-            function (int $errno, string $errstr, string $errfile, int $errline): bool {
-                $this->warning($errstr . ' in ' . $errfile . ' on line ' . $errline);
-                /* @infection-ignore-all */
-                return true;
-            },
-            E_WARNING
-        );
+        
     }
 
killedBy: LoggerTest::testEndLogger
statusReason: 1) LoggerTest::testEndLogger
Failed asserting that '[2024-03-11 16:59:06] (   INFO)          Logger : Starting Logger\n
' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(WARNING\)( )+Logger \: Undefined array key 1 in .+ on line \d{1,}/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:236

FAILURES!
Tests: 22, Assertions: 29, Failures: 1, Warn

[Killed] Concat
Adebipe/Core/Utils/Logger.php:90:17
 
         set_error_handler(
             function (int $errno, string $errstr, string $errfile, int $errline): bool {
-                $this->warning($errstr . ' in ' . $errfile . ' on line ' . $errline);
+                $this->warning(' in ' . $errstr . $errfile . ' on line ' . $errline);
                 /* @infection-ignore-all */
                 return true;
killedBy: LoggerTest::testEndLogger
statusReason: 1) LoggerTest::testEndLogger
Failed asserting that '[2024-03-11 16:59:06] (WARNING)          Logger :  in Undefined array key 1/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php on line 234\n
' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(WARNING\)( )+Logger \: Undefined array key 1 in .+ on line \d{1,}/".

/home/runner/work/Adebipe/Adebipe/test

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Logger.php:90:17
 
         set_error_handler(
             function (int $errno, string $errstr, string $errfile, int $errline): bool {
-                $this->warning($errstr . ' in ' . $errfile . ' on line ' . $errline);
+                $this->warning($errstr . ' in ' . ' on line ' . $errline);
                 /* @infection-ignore-all */
                 return true;
killedBy: LoggerTest::testEndLogger
statusReason: 1) LoggerTest::testEndLogger
Failed asserting that '[2024-03-11 16:59:06] (WARNING)          Logger : Undefined array key 1 in  on line 234\n
' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(WARNING\)( )+Logger \: Undefined array key 1 in .+ on line \d{1,}/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:236

FAILURES!
Tests: 22, Assertions:

[Killed] MethodCallRemoval
Adebipe/Core/Utils/Logger.php:105:9
      */
     public function atEnd(): void
     {
-        $this->info('Stopping Logger');
+        
         restore_error_handler();
         if ($this->_logFile !== STDOUT) {
killedBy: LoggerTest::testEndLogger
statusReason: 1) LoggerTest::testEndLogger
Failed asserting that '[2024-03-11 16:59:06] (WARNING)          Logger : Undefined array key 1 in /home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php on line 234\n
' matches PCRE pattern "/Stopping Logger/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:238

FAILURES!
Tests: 22, Assertions: 30, Failur

[Killed] FunctionCallRemoval
Adebipe/Core/Utils/Logger.php:106:9
     public function atEnd(): void
     {
         $this->info('Stopping Logger');
-        restore_error_handler();
+        
         if ($this->_logFile !== STDOUT) {
             fclose($this->_logFile);
killedBy: LoggerTest::testEndLogger
statusReason: 1) LoggerTest::testEndLogger
Failed asserting that '[2024-03-11 16:59:06] (WARNING)          Logger : Undefined array key 1 in /home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php on line 239\n
' does not match PCRE pattern "/Undefined array key 1 in/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:240

FAILURES!
Tests: 22, Assert

[Killed] NotIdentical
Adebipe/Core/Utils/Logger.php:107:9
     {
         $this->info('Stopping Logger');
         restore_error_handler();
-        if ($this->_logFile !== STDOUT) {
+        if ($this->_logFile === STDOUT) {
             fclose($this->_logFile);
         }
killedBy: LoggerTest::testNoSentryConnection
statusReason: 1) LoggerTest::testIsNotSentryClass
Failed asserting that exception message 'fwrite(): supplied resource is not a valid stream resource' contains 'The error sender must implement ErrorSenderInterface'.

ERRORS!
Tests: 16, Assertions: 19, Errors: 3, Failures: 1.

[Killed] FalseValue
Adebipe/Core/Utils/Logger.php:133:9
         $call_class = end($call_class);
         $log_format = "[%s] (%' 7s) %' 15s : ";
         $log = vsprintf($log_format, array(date('Y-m-d H:i:s'), $type, $call_class));
-        if (strpos($message, PHP_EOL) !== false) {
+        if (strpos($message, PHP_EOL) !== true) {
             $message_line = explode(PHP_EOL, $message);
             $message = "";
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Failed asserting that '[2024-03-11 16:59:06] (  DEBUG)        Injector : Add service: FalseRegisterClass\n
                                                  \n
' matches PCRE pattern "/\: Add service\: ..*$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:26

FAILURES!

[Killed] NotIdentical
Adebipe/Core/Utils/Logger.php:133:9
         $call_class = end($call_class);
         $log_format = "[%s] (%' 7s) %' 15s : ";
         $log = vsprintf($log_format, array(date('Y-m-d H:i:s'), $type, $call_class));
-        if (strpos($message, PHP_EOL) !== false) {
+        if (strpos($message, PHP_EOL) === false) {
             $message_line = explode(PHP_EOL, $message);
             $message = "";
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Failed asserting that '[2024-03-11 16:59:06] (  DEBUG)        Injector : Add service: FalseRegisterClass\n
                                                  \n
' matches PCRE pattern "/\: Add service\: ..*$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:26

FAILURES!

[Killed] Foreach_
Adebipe/Core/Utils/Logger.php:136:13
         if (strpos($message, PHP_EOL) !== false) {
             $message_line = explode(PHP_EOL, $message);
             $message = "";
-            foreach ($message_line as $line) {
-                $message .= $line . PHP_EOL . str_repeat(' ', strlen($log));
-            }
+            foreach (array() as $line) {
         }
         $log .= $message . PHP_EOL;
killedBy: LoggerTest::testMultilineString
statusReason: 1) LoggerTest::testMultilineString
Failed asserting that '[2024-03-11 16:59:07] (   INFO)      LoggerTest : \n
' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(( )+INFO\)( )+LoggerTest : Ceci est une info
( ){50}Ceci est une autre info
( ){50}$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:254

[Killed] UnwrapStrRepeat
Adebipe/Core/Utils/Logger.php:137:17
             $message_line = explode(PHP_EOL, $message);
             $message = "";
             foreach ($message_line as $line) {
-                $message .= $line . PHP_EOL . str_repeat(' ', strlen($log));
+                $message .= $line . PHP_EOL . ' ';
             }
         }
killedBy: LoggerTest::testMultilineString
statusReason: 1) LoggerTest::testMultilineString
Failed asserting that '[2024-03-11 16:59:07] (   INFO)      LoggerTest : Ceci est une info\n
 Ceci est une autre info\n
 \n
' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(( )+INFO\)( )+LoggerTest : Ceci est une info
( ){50}Ceci est une autre info
( ){50}$/".

[Killed] Concat
Adebipe/Core/Utils/Logger.php:137:17
             $message_line = explode(PHP_EOL, $message);
             $message = "";
             foreach ($message_line as $line) {
-                $message .= $line . PHP_EOL . str_repeat(' ', strlen($log));
+                $message .= PHP_EOL . $line . str_repeat(' ', strlen($log));
             }
         }
killedBy: LoggerTest::testMultilineString
statusReason: 1) LoggerTest::testMultilineString
Failed asserting that '[2024-03-11 16:59:06] (   INFO)      LoggerTest : \n
Ceci est une info                                                  \n
Ceci est une autre info                                                  \n
' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(( )+INFO\)( )+LoggerTest : Ceci est une info
( ){50}Ceci est une autre info

[Killed] Concat
Adebipe/Core/Utils/Logger.php:140:9
                 $message .= $line . PHP_EOL . str_repeat(' ', strlen($log));
             }
         }
-        $log .= $message . PHP_EOL;
+        $log .= PHP_EOL . $message;
         return $log;
     }
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Failed asserting that '[2024-03-11 16:59:07] (  DEBUG)        Injector : \n
Add service: FalseRegisterClass' matches PCRE pattern "/\: Add service\: ..*$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:26

FAILURES!
Tests: 7, Assertions: 14, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Logger.php:140:9
                 $message .= $line . PHP_EOL . str_repeat(' ', strlen($log));
             }
         }
-        $log .= $message . PHP_EOL;
+        $log .= $message;
         return $log;
     }
killedBy: LoggerTest::testString
statusReason: 1) LoggerTest::testString
Failed asserting that '[2024-03-11 16:59:07] (   INFO)      LoggerTest : Ceci est une info' matches PCRE pattern "/^\[\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}\] \(( )+INFO\)( )+LoggerTest : Ceci est une info
$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:247

FAILURES!
Tests: 45, Assertions: 79, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:154:9
      */
     private function _log(string $type, string $message): void
     {
-        if (!isset(self::$_loglevels[$type])) {
+        if (isset(self::$_loglevels[$type])) {
             throw new \Exception('Invalid log type');
         }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Exception:
Invalid log type
#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php(176): Adebipe\Services\Logger->_log()
#1 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php(44): Adebipe\Services\Logger->info()
#2 /home/runner/work/Adebipe/Adebipe/services/Cli/MakeClasses.

[Killed] Throw_
Adebipe/Core/Utils/Logger.php:155:13
     private function _log(string $type, string $message): void
     {
         if (!isset(self::$_loglevels[$type])) {
-            throw new \Exception('Invalid log type');
+            new \Exception('Invalid log type');
         }
         if ($this->_loglevel > self::$_loglevels[$type]) {
killedBy: LoggerTest::testLog
statusReason: 1) LoggerTest::testLog
Failed asserting that exception with message "Invalid log type" is thrown

FAILURES!
Tests: 26, Assertions: 35, Failures: 1.

[Killed] GreaterThan
Adebipe/Core/Utils/Logger.php:157:9
         if (!isset(self::$_loglevels[$type])) {
             throw new \Exception('Invalid log type');
         }
-        if ($this->_loglevel > self::$_loglevels[$type]) {
+        if ($this->_loglevel >= self::$_loglevels[$type]) {
             return;
         }
killedBy: ConfigRunnerTest::testLoggerInfo
statusReason: 1) ConfigRunnerTest::testLoggerInfo
Failed asserting that '[2024-03-11 16:59:07] (  ERROR)            MsQl : PDO can't be opened\n
' matches PCRE pattern "/Initialize the environment variables/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:35

FAILURES!
Tests: 3, Assertions: 8, Failures: 1.

[Killed] GreaterThanNegotiation
Adebipe/Core/Utils/Logger.php:157:9
         if (!isset(self::$_loglevels[$type])) {
             throw new \Exception('Invalid log type');
         }
-        if ($this->_loglevel > self::$_loglevels[$type]) {
+        if ($this->_loglevel <= self::$_loglevels[$type]) {
             return;
         }
killedBy: ConfigRunnerTest::testLoggerInfo
statusReason: 1) ConfigRunnerTest::testLoggerInfo
Failed asserting that '[2024-03-11 16:59:07] (  DEBUG)          Logger : No sentry\n
' matches PCRE pattern "/Initialize the environment variables/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:35

FAILURES!
Tests: 3, Assertions: 8, Failures: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Logger.php:188:5
      *
      * @return void
      */
-    public function debug(string $message): void
+    protected function debug(string $message) : void
     {
         $this->_log('DEBUG', $message);
statusReason: [2024-03-11 16:59:07] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:07] (   INFO)     MakeClasses : Initialize the services
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Logger::debug() from scope Adebipe\Services\Injector
#0 /home/runner/work/Adebipe/Adebipe/services/Cli/MakeClasses.php(41): Adeb

[Killed] MethodCallRemoval
Adebipe/Core/Utils/Logger.php:190:9
      */
     public function debug(string $message): void
     {
-        $this->_log('DEBUG', $message);
+        
     }
 
killedBy: InjectorTest::testAddGetService
statusReason: 1) InjectorTest::testAddGetService
Failed asserting that '[2024-03-11 16:59:07] (   INFO)          Logger : Starting Logger\n
' matches PCRE pattern "/\: Add service\: ..*$/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/InjectorTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Logger.php:200:5
      *
      * @return void
      */
-    public function info(string $message): void
+    protected function info(string $message) : void
     {
         $this->_log('INFO', $message);
statusReason: [2024-03-11 16:59:07] (   INFO)          Logger : Starting Logger
PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Logger::info() from scope Adebipe\Cli\MakeClasses
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(22): Adebipe\Cli\MakeClasses::makeClasses()
#1 /tmp/infection/interceptor.autoload.496dea3f051a

[Killed] MethodCallRemoval
Adebipe/Core/Utils/Logger.php:202:9
      */
     public function info(string $message): void
     {
-        $this->_log('INFO', $message);
+        
     }
 
killedBy: ConfigRunnerTest::testLoggerInfo
statusReason: 1) ConfigRunnerTest::testLoggerInfo
Failed asserting that '[2024-03-11 16:59:07] (  ERROR)            MsQl : PDO can't be opened\n
' matches PCRE pattern "/Initialize the environment variables/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/ConfigRunnerTest.php:35

FAILURES!
Tests: 3, Assertions: 8, Failures: 1.

[Killed] LogicalNot
Adebipe/Core/Utils/Logger.php:271:9
      */
     private function _sendError($backtrace): void
     {
-        if (!isset($this->_sender)) {
+        if (isset($this->_sender)) {
             return;
         }
statusReason: [2024-03-11 16:59:07] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:07] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:07] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:07] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:07] (   INFO)     MakeClasses : Skip service: Adebipe\Servic
