[Killed] MethodCallRemoval
Adebipe/Core/Utils/Logger.php:274:9
         if (!isset($this->_sender)) {
             return;
         }
-        $this->_sender->sendError($this, $backtrace);
+        
     }
 }
killedBy: LoggerTest::testSentryWarning
statusReason: 1) LoggerTest::testSentryWarning
Failed asserting that false is true.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:196

FAILURES!
Tests: 19, Assertions: 26, Failures: 1.
