[Killed] PublicVisibility
Adebipe/Core/Utils/Settings.php:23:5
      *
      * @return void
      */
-    public static function addEnvVariable(string $key, string $value): void
+    protected static function addEnvVariable(string $key, string $value) : void
     {
         self::$_env_variable[$key] = $value;
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Settings::addEnvVariable() from scope Adebipe\Services\ConfigRunner
#0 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(19): Adebipe\Services\ConfigRunner->__construct()
#1 /tmp/infection/interceptor.autoload.a1d20ee0e69769f34ebd93ab5c3acf8a.infection.php(13): re

[Killed] Concat
Adebipe/Core/Utils/Settings.php:26:9
     public static function addEnvVariable(string $key, string $value): void
     {
         self::$_env_variable[$key] = $value;
-        putenv($key . '=' . $value);
+        putenv($key . $value . '=');
     }
 
killedBy: SettingTest::testAddEnv
statusReason: 1) SettingTest::testAddEnv
Failed asserting that false matches expected 'test'.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/SettingTest.php:12

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
Adebipe/Core/Utils/Settings.php:26:9
     public static function addEnvVariable(string $key, string $value): void
     {
         self::$_env_variable[$key] = $value;
-        putenv($key . '=' . $value);
+        putenv($key . '=');
     }
 
killedBy: SettingTest::testAddEnv
statusReason: 1) SettingTest::testAddEnv
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'test'
+''

[Killed] PublicVisibility
Adebipe/Core/Utils/Settings.php:36:5
      *
      * @return string|null
      */
-    public static function getEnvVariable(string $key): ?string
+    protected static function getEnvVariable(string $key) : ?string
     {
         if (!isset(self::$_env_variable[$key])) {
statusReason: [2024-03-11 16:59:08] (   INFO)          Logger : Starting Logger
[2024-03-11 16:59:08] (   INFO)     MakeClasses : Initialize the services
[2024-03-11 16:59:08] (   INFO)     MakeClasses : Skip service: Adebipe\Services\ConfigRunner
[2024-03-11 16:59:08] (   INFO)     MakeClasses : Skip service: Adebipe\Services\Logger
[2024-03-11 16:59:08] (   INFO)     MakeClasses : Skip service: Adebipe\Servic

[Killed] LogicalNot
Adebipe/Core/Utils/Settings.php:38:9
      */
     public static function getEnvVariable(string $key): ?string
     {
-        if (!isset(self::$_env_variable[$key])) {
+        if (isset(self::$_env_variable[$key])) {
             $env = getenv($key);
             if (empty($env)) {
killedBy: IsEnvTest::testIsEnv
statusReason: 1) IsEnvTest::testIsEnv
Failed asserting that null matches expected 'test'.

/home/runner/work/Adebipe/Adebipe/tests/adebipe/IsEnvTest.php:10

FAILURES!
Tests: 11, Assertions: 24, Failures: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Settings.php:56:5
      *
      * @return void
      */
-    public static function addConfigArray(array $config, $merge = true): void
+    protected static function addConfigArray(array $config, $merge = true) : void
     {
         if ($merge) {
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Settings::addConfigArray() from scope Adebipe\Services\ConfigRunner
#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/ConfigRunner.php(44): Adebipe\Services\ConfigRunner->_readConfigFile()
#1 /home/runner/work/Adebipe/Adebipe/tests/bootstrap.php(19): Ad

[Killed] TrueValue
Adebipe/Core/Utils/Settings.php:56:5
      *
      * @return void
      */
-    public static function addConfigArray(array $config, $merge = true): void
+    public static function addConfigArray(array $config, $merge = false) : void
     {
         if ($merge) {
killedBy: SettingTest::testAddConfig
statusReason: 1) SettingTest::testAddConfig
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    'test' => 'test'
     'test2' => 'test2'

[Killed] IfNegation
Adebipe/Core/Utils/Settings.php:58:9
      */
     public static function addConfigArray(array $config, $merge = true): void
     {
-        if ($merge) {
-            self::$_config = array_merge(self::$_config, $config);
-        } else {
-            self::$_config = $config;
-        }
+        if (!$merge) {
     }
 
killedBy: SettingTest::testAddConfig
statusReason: 1) SettingTest::testAddConfig
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    'test' => 'test'
     'test2' => 'test2'

[Killed] UnwrapArrayMerge
Adebipe/Core/Utils/Settings.php:59:13
     public static function addConfigArray(array $config, $merge = true): void
     {
         if ($merge) {
-            self::$_config = array_merge(self::$_config, $config);
+            self::$_config = self::$_config;
         } else {
             self::$_config = $config;
killedBy: SettingTest::testAddConfig
statusReason: 1) SettingTest::testAddConfig
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    'test' => 'test'
 )

[Killed] PublicVisibility
Adebipe/Core/Utils/Settings.php:73:5
      *
      * @return void
      */
-    public static function addConfig(string $key, mixed $value): void
+    protected static function addConfig(string $key, mixed $value) : void
     {
         if (empty($key)) {
killedBy: SettingTest::testAddConfigNoKey
statusReason: 1) SettingTest::testAddConfigNoKey
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to protected method Adebipe\Services\Settings::addConfig() from scope SettingTest" at
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/SettingTest.php:40
.

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Killed] Throw_
Adebipe/Core/Utils/Settings.php:76:13
     public static function addConfig(string $key, mixed $value): void
     {
         if (empty($key)) {
-            throw new \Exception("The key must not be empty");
+            new \Exception("The key must not be empty");
         }
         $keys = explode('.', $key);
killedBy: SettingTest::testAddConfigNoKey
statusReason: 1) SettingTest::testAddConfigNoKey
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Killed] Foreach_
Adebipe/Core/Utils/Settings.php:80:9
         }
         $keys = explode('.', $key);
         $config = &self::$_config;
-        foreach ($keys as $key) {
-            if (!isset($config[$key])) {
-                $config[$key] = array();
-            }
-            $config = &$config[$key];
-        }
+        foreach (array() as $key) {
         $config = $value;
         return;
killedBy: LoggerTest::testIsLogLevel
statusReason: 1) LoggerTest::testIsLogLevel
TypeError: Cannot assign int to reference held by property Adebipe\Services\Settings::$_config of type array

/home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Settings.php:82
/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:21

2) LoggerTest::testIfLogFolderExists
TypeError: Cannot assign string to reference held by prope

[Killed] LogicalNot
Adebipe/Core/Utils/Settings.php:81:13
         $keys = explode('.', $key);
         $config = &self::$_config;
         foreach ($keys as $key) {
-            if (!isset($config[$key])) {
+            if (isset($config[$key])) {
                 $config[$key] = array();
             }
killedBy: LoggerTest::testNotExistSentryClass
statusReason: 1) LoggerTest::testNotExistSentryClass
Failed asserting that '[2024-03-11 16:59:08] (   INFO)          Logger : Starting Logger\n
' matches PCRE pattern "/No sentry/".

/home/runner/work/Adebipe/Adebipe/tests/adebipe/services/core/utils/LoggerTest.php:134

FAILURES!
Tests: 14, Assertions: 20, Failures: 1.

[Killed] PublicVisibility
Adebipe/Core/Utils/Settings.php:97:5
      *
      * @return mixed
      */
-    public static function getConfig(?string $key): mixed
+    protected static function getConfig(?string $key) : mixed
     {
         if ($key === null) {
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: Error:
Call to protected method Adebipe\Services\Settings::getConfig() from scope PHPUnit\TextUI\Application
#0 /tmp/infection/interceptor.autoload.241e19241d1f8956982f9646d609b83b.infection.php(13): require_once()
#1 /home/runner/work/Adebipe/Adebipe/vendor/phpunit/phpunit/src/TextUI/Application.php(299): include_o

[Killed] Identical
Adebipe/Core/Utils/Settings.php:99:9
      */
     public static function getConfig(?string $key): mixed
     {
-        if ($key === null) {
+        if ($key !== null) {
             return self::$_config;
         }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: TypeError:
is_dir(): Argument #1 ($filename) must be of type string, array given
#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php(40): is_dir()
#1 /home/runner/work/Adebipe/Adebipe/services/Cli/MakeClasses.php(37): Adebipe\Services\Logger->__construct()
#2 /home/runner/work/Adebipe/Adebipe

[Killed] Foreach_
Adebipe/Core/Utils/Settings.php:104:9
         }
         $keys = explode('.', $key);
         $config = self::$_config;
-        foreach ($keys as $key) {
-            if (!isset($config[$key])) {
-                return null;
-            }
-            $config = $config[$key];
-        }
+        foreach (array() as $key) {
         return $config;
     }
statusReason: PHPUnit 10.3.5 by Sebastian Bergmann and contributors.

Error in bootstrap script: TypeError:
is_dir(): Argument #1 ($filename) must be of type string, array given
#0 /home/runner/work/Adebipe/Adebipe/services/Adebipe/Core/Utils/Logger.php(40): is_dir()
#1 /home/runner/work/Adebipe/Adebipe/services/Cli/MakeClasses.php(37): Adebipe\Services\Logger->__construct()
#2 /home/runner/work/Adebipe/Adebipe
