[NoCoverage] LogicalNot
Adebipe/Msql/MsQl.php:34:9
         private Logger $_logger
     ) {
         $connection_string = Settings::getEnvVariable('DB_CONNECTION');
-        if (!$connection_string) {
+        if ($connection_string) {
             $this->_logger->warning('DB_CONNECTION environment variable not set');
             return;

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:35:13
     ) {
         $connection_string = Settings::getEnvVariable('DB_CONNECTION');
         if (!$connection_string) {
-            $this->_logger->warning('DB_CONNECTION environment variable not set');
+            
             return;
         }

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:40:9
         }
         // Extracting connection parameters
         // Format: driver://user:password@host/database
-        $ptn_start = 0;
+        $ptn_start = -1;
         $ptn_end = strpos($connection_string, '://');
         if ($ptn_end === false) {

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:42:9
         // Format: driver://user:password@host/database
         $ptn_start = 0;
         $ptn_end = strpos($connection_string, '://');
-        if ($ptn_end === false) {
+        if ($ptn_end === true) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:42:9
         // Format: driver://user:password@host/database
         $ptn_start = 0;
         $ptn_end = strpos($connection_string, '://');
-        if ($ptn_end === false) {
+        if ($ptn_end !== false) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:43:13
         $ptn_start = 0;
         $ptn_end = strpos($connection_string, '://');
         if ($ptn_end === false) {
-            $this->_logger->error("Invalid connection string: " . $connection_string);
+            $this->_logger->error($connection_string);
             return;
         }

[NoCoverage] Concat
Adebipe/Msql/MsQl.php:43:13
         $ptn_start = 0;
         $ptn_end = strpos($connection_string, '://');
         if ($ptn_end === false) {
-            $this->_logger->error("Invalid connection string: " . $connection_string);
+            $this->_logger->error($connection_string . "Invalid connection string: ");
             return;
         }

[NoCoverage] UnwrapSubstr
Adebipe/Msql/MsQl.php:46:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_driver = substr($connection_string, 0, $ptn_end);
+        $this->_driver = $connection_string;
         $ptn_start = $ptn_end + 3;
         $ptn_end = strpos($connection_string, ':', $ptn_start);

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:46:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_driver = substr($connection_string, 0, $ptn_end);
+        $this->_driver = substr($connection_string, -1, $ptn_end);
         $ptn_start = $ptn_end + 3;
         $ptn_end = strpos($connection_string, ':', $ptn_start);

[NoCoverage] IncrementInteger
Adebipe/Msql/MsQl.php:47:9
             return;
         }
         $this->_driver = substr($connection_string, 0, $ptn_end);
-        $ptn_start = $ptn_end + 3;
+        $ptn_start = $ptn_end + 4;
         $ptn_end = strpos($connection_string, ':', $ptn_start);
         if ($ptn_end === false) {

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:47:9
             return;
         }
         $this->_driver = substr($connection_string, 0, $ptn_end);
-        $ptn_start = $ptn_end + 3;
+        $ptn_start = $ptn_end + 2;
         $ptn_end = strpos($connection_string, ':', $ptn_start);
         if ($ptn_end === false) {

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:49:9
         $this->_driver = substr($connection_string, 0, $ptn_end);
         $ptn_start = $ptn_end + 3;
         $ptn_end = strpos($connection_string, ':', $ptn_start);
-        if ($ptn_end === false) {
+        if ($ptn_end !== false) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:49:9
         $this->_driver = substr($connection_string, 0, $ptn_end);
         $ptn_start = $ptn_end + 3;
         $ptn_end = strpos($connection_string, ':', $ptn_start);
-        if ($ptn_end === false) {
+        if ($ptn_end === true) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:50:13
         $ptn_start = $ptn_end + 3;
         $ptn_end = strpos($connection_string, ':', $ptn_start);
         if ($ptn_end === false) {
-            $this->_logger->error("Invalid connection string: " . $connection_string);
+            
             return;
         }

[NoCoverage] UnwrapSubstr
Adebipe/Msql/MsQl.php:53:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_user = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
+        $this->_user = $connection_string;
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '@', $ptn_start);

[NoCoverage] Minus
Adebipe/Msql/MsQl.php:53:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_user = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
+        $this->_user = substr($connection_string, $ptn_start, $ptn_end + $ptn_start);
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '@', $ptn_start);

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:54:9
             return;
         }
         $this->_user = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
-        $ptn_start = $ptn_end + 1;
+        $ptn_start = $ptn_end + 0;
         $ptn_end = strpos($connection_string, '@', $ptn_start);
         if ($ptn_end === false) {

[NoCoverage] IncrementInteger
Adebipe/Msql/MsQl.php:54:9
             return;
         }
         $this->_user = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
-        $ptn_start = $ptn_end + 1;
+        $ptn_start = $ptn_end + 2;
         $ptn_end = strpos($connection_string, '@', $ptn_start);
         if ($ptn_end === false) {

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:56:9
         $this->_user = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '@', $ptn_start);
-        if ($ptn_end === false) {
+        if ($ptn_end === true) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:56:9
         $this->_user = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '@', $ptn_start);
-        if ($ptn_end === false) {
+        if ($ptn_end !== false) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] Minus
Adebipe/Msql/MsQl.php:60:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_password = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
+        $this->_password = substr($connection_string, $ptn_start, $ptn_end + $ptn_start);
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '/', $ptn_start);

[NoCoverage] UnwrapSubstr
Adebipe/Msql/MsQl.php:60:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_password = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
+        $this->_password = $connection_string;
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '/', $ptn_start);

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:61:9
             return;
         }
         $this->_password = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
-        $ptn_start = $ptn_end + 1;
+        $ptn_start = $ptn_end + 0;
         $ptn_end = strpos($connection_string, '/', $ptn_start);
         if ($ptn_end === false) {

[NoCoverage] Plus
Adebipe/Msql/MsQl.php:61:9
             return;
         }
         $this->_password = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
-        $ptn_start = $ptn_end + 1;
+        $ptn_start = $ptn_end - 1;
         $ptn_end = strpos($connection_string, '/', $ptn_start);
         if ($ptn_end === false) {

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:63:9
         $this->_password = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '/', $ptn_start);
-        if ($ptn_end === false) {
+        if ($ptn_end !== false) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:63:9
         $this->_password = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '/', $ptn_start);
-        if ($ptn_end === false) {
+        if ($ptn_end === true) {
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:64:13
         $ptn_start = $ptn_end + 1;
         $ptn_end = strpos($connection_string, '/', $ptn_start);
         if ($ptn_end === false) {
-            $this->_logger->error("Invalid connection string: " . $connection_string);
+            $this->_logger->error("Invalid connection string: ");
             return;
         }

[NoCoverage] Minus
Adebipe/Msql/MsQl.php:67:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_host = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
+        $this->_host = substr($connection_string, $ptn_start, $ptn_end + $ptn_start);
         $ptn_start = $ptn_end + 1;
         $this->_database = substr($connection_string, $ptn_start);

[NoCoverage] UnwrapSubstr
Adebipe/Msql/MsQl.php:67:9
             $this->_logger->error("Invalid connection string: " . $connection_string);
             return;
         }
-        $this->_host = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
+        $this->_host = $connection_string;
         $ptn_start = $ptn_end + 1;
         $this->_database = substr($connection_string, $ptn_start);

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:68:9
             return;
         }
         $this->_host = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
-        $ptn_start = $ptn_end + 1;
+        $ptn_start = $ptn_end + 0;
         $this->_database = substr($connection_string, $ptn_start);
         $connection_string = "$this->_driver:host=$this->_host;dbname=$this->_database";

[NoCoverage] IncrementInteger
Adebipe/Msql/MsQl.php:68:9
             return;
         }
         $this->_host = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
-        $ptn_start = $ptn_end + 1;
+        $ptn_start = $ptn_end + 2;
         $this->_database = substr($connection_string, $ptn_start);
         $connection_string = "$this->_driver:host=$this->_host;dbname=$this->_database";

[NoCoverage] UnwrapSubstr
Adebipe/Msql/MsQl.php:69:9
         }
         $this->_host = substr($connection_string, $ptn_start, $ptn_end - $ptn_start);
         $ptn_start = $ptn_end + 1;
-        $this->_database = substr($connection_string, $ptn_start);
+        $this->_database = $connection_string;
         $connection_string = "$this->_driver:host=$this->_host;dbname=$this->_database";
         $this->_logger->info("Connecting to database: $connection_string");

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:71:9
         $ptn_start = $ptn_end + 1;
         $this->_database = substr($connection_string, $ptn_start);
         $connection_string = "$this->_driver:host=$this->_host;dbname=$this->_database";
-        $this->_logger->info("Connecting to database: $connection_string");
+        
         $this->_logger->info("User: $this->_user");
         $this->_logger->info("Password: $this->_password");

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:72:9
         $this->_database = substr($connection_string, $ptn_start);
         $connection_string = "$this->_driver:host=$this->_host;dbname=$this->_database";
         $this->_logger->info("Connecting to database: $connection_string");
-        $this->_logger->info("User: $this->_user");
+        
         $this->_logger->info("Password: $this->_password");
         try {

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:73:9
         $connection_string = "$this->_driver:host=$this->_host;dbname=$this->_database";
         $this->_logger->info("Connecting to database: $connection_string");
         $this->_logger->info("User: $this->_user");
-        $this->_logger->info("Password: $this->_password");
+        
         try {
             $this->_connection = new PDO($connection_string, $this->_user, $this->_password);

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:77:13
         try {
             $this->_connection = new PDO($connection_string, $this->_user, $this->_password);
         } catch (PDOException $e) {
-            $this->_logger->error("PDO can't be opened");
+            
             $this->_connection = null;
         }

[NoCoverage] PublicVisibility
Adebipe/Msql/MsQl.php:89:5
      *
      * @return PDOStatement
      */
-    public function prepare(string $query): PDOStatement
+    protected function prepare(string $query) : PDOStatement
     {
         if ($this->_connection === null) {

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:91:9
      */
     public function prepare(string $query): PDOStatement
     {
-        if ($this->_connection === null) {
+        if ($this->_connection !== null) {
             throw new \Exception("Connection to database not opened");
         }

[NoCoverage] Throw_
Adebipe/Msql/MsQl.php:92:13
     public function prepare(string $query): PDOStatement
     {
         if ($this->_connection === null) {
-            throw new \Exception("Connection to database not opened");
+            new \Exception("Connection to database not opened");
         }
         $result = $this->_connection->prepare($query);

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:95:9
             throw new \Exception("Connection to database not opened");
         }
         $result = $this->_connection->prepare($query);
-        if ($result === false) {
+        if ($result !== false) {
             throw new \Exception("Error preparing query: " . $this->_connection->errorInfo()[2]);
         }

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:95:9
             throw new \Exception("Connection to database not opened");
         }
         $result = $this->_connection->prepare($query);
-        if ($result === false) {
+        if ($result === true) {
             throw new \Exception("Error preparing query: " . $this->_connection->errorInfo()[2]);
         }

[NoCoverage] Concat
Adebipe/Msql/MsQl.php:96:13
         }
         $result = $this->_connection->prepare($query);
         if ($result === false) {
-            throw new \Exception("Error preparing query: " . $this->_connection->errorInfo()[2]);
+            throw new \Exception($this->_connection->errorInfo()[2] . "Error preparing query: ");
         }
         return $result;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:96:13
         }
         $result = $this->_connection->prepare($query);
         if ($result === false) {
-            throw new \Exception("Error preparing query: " . $this->_connection->errorInfo()[2]);
+            throw new \Exception($this->_connection->errorInfo()[2]);
         }
         return $result;

[NoCoverage] PublicVisibility
Adebipe/Msql/MsQl.php:110:5
      *
      * @return array
      */
-    public function execute(PDOStatement $statement, array|null $params = null, array|null $types = null): array
+    protected function execute(PDOStatement $statement, array|null $params = null, array|null $types = null) : array
     {
         $data = null;

[NoCoverage] LogicalAndAllSubExprNegation
Adebipe/Msql/MsQl.php:113:9
     public function execute(PDOStatement $statement, array|null $params = null, array|null $types = null): array
     {
         $data = null;
-        if ($params !== null && $types !== null) {
+        if (!($params !== null) && !($types !== null)) {
             $this->_logger->info("Binding params");
             $this->_logger->info("Params: " . json_encode($params));

[NoCoverage] NotIdentical
Adebipe/Msql/MsQl.php:113:9
     public function execute(PDOStatement $statement, array|null $params = null, array|null $types = null): array
     {
         $data = null;
-        if ($params !== null && $types !== null) {
+        if ($params === null && $types !== null) {
             $this->_logger->info("Binding params");
             $this->_logger->info("Params: " . json_encode($params));

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:114:13
     {
         $data = null;
         if ($params !== null && $types !== null) {
-            $this->_logger->info("Binding params");
+            
             $this->_logger->info("Params: " . json_encode($params));
             $this->_logger->info("Types: " . json_encode($types));

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:115:13
         $data = null;
         if ($params !== null && $types !== null) {
             $this->_logger->info("Binding params");
-            $this->_logger->info("Params: " . json_encode($params));
+            
             $this->_logger->info("Types: " . json_encode($types));
             $i = 0;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:115:13
         $data = null;
         if ($params !== null && $types !== null) {
             $this->_logger->info("Binding params");
-            $this->_logger->info("Params: " . json_encode($params));
+            $this->_logger->info("Params: ");
             $this->_logger->info("Types: " . json_encode($types));
             $i = 0;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:116:13
         if ($params !== null && $types !== null) {
             $this->_logger->info("Binding params");
             $this->_logger->info("Params: " . json_encode($params));
-            $this->_logger->info("Types: " . json_encode($types));
+            $this->_logger->info("Types: ");
             $i = 0;
             foreach ($params as $param) {

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:116:13
         if ($params !== null && $types !== null) {
             $this->_logger->info("Binding params");
             $this->_logger->info("Params: " . json_encode($params));
-            $this->_logger->info("Types: " . json_encode($types));
+            
             $i = 0;
             foreach ($params as $param) {

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:117:13
             $this->_logger->info("Binding params");
             $this->_logger->info("Params: " . json_encode($params));
             $this->_logger->info("Types: " . json_encode($types));
-            $i = 0;
+            $i = -1;
             foreach ($params as $param) {
                 $statement->bindValue($i + 1, $param, $types[$i]);

[NoCoverage] Foreach_
Adebipe/Msql/MsQl.php:118:13
             $this->_logger->info("Params: " . json_encode($params));
             $this->_logger->info("Types: " . json_encode($types));
             $i = 0;
-            foreach ($params as $param) {
-                $statement->bindValue($i + 1, $param, $types[$i]);
-                $i++;
-            }
+            foreach (array() as $param) {
         } else {
             if ($params !== null) {

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:119:17
             $this->_logger->info("Types: " . json_encode($types));
             $i = 0;
             foreach ($params as $param) {
-                $statement->bindValue($i + 1, $param, $types[$i]);
+                
                 $i++;
             }

[NoCoverage] IncrementInteger
Adebipe/Msql/MsQl.php:119:17
             $this->_logger->info("Types: " . json_encode($types));
             $i = 0;
             foreach ($params as $param) {
-                $statement->bindValue($i + 1, $param, $types[$i]);
+                $statement->bindValue($i + 2, $param, $types[$i]);
                 $i++;
             }

[NoCoverage] Increment
Adebipe/Msql/MsQl.php:120:17
             $i = 0;
             foreach ($params as $param) {
                 $statement->bindValue($i + 1, $param, $types[$i]);
-                $i++;
+                $i--;
             }
         } else {

[NoCoverage] NotIdentical
Adebipe/Msql/MsQl.php:123:13
                 $i++;
             }
         } else {
-            if ($params !== null) {
+            if ($params === null) {
                 $i = 0;
                 foreach ($params as $param) {

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:124:17
             }
         } else {
             if ($params !== null) {
-                $i = 0;
+                $i = -1;
                 foreach ($params as $param) {
                     $statement->bindValue($i + 1, $param);

[NoCoverage] Foreach_
Adebipe/Msql/MsQl.php:125:17
         } else {
             if ($params !== null) {
                 $i = 0;
-                foreach ($params as $param) {
-                    $statement->bindValue($i + 1, $param);
-                    $i++;
-                }
+                foreach (array() as $param) {
             }
         }

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:126:21
             if ($params !== null) {
                 $i = 0;
                 foreach ($params as $param) {
-                    $statement->bindValue($i + 1, $param);
+                    $statement->bindValue($i + 0, $param);
                     $i++;
                 }

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:126:21
             if ($params !== null) {
                 $i = 0;
                 foreach ($params as $param) {
-                    $statement->bindValue($i + 1, $param);
+                    
                     $i++;
                 }

[NoCoverage] Increment
Adebipe/Msql/MsQl.php:127:21
                 $i = 0;
                 foreach ($params as $param) {
                     $statement->bindValue($i + 1, $param);
-                    $i++;
+                    $i--;
                 }
             }

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:134:13
         try {
             $data = $statement->execute();
         } catch (PDOException $e) {
-            if (Settings::getEnvVariable('ENV') === 'dev') {
+            if (Settings::getEnvVariable('ENV') !== 'dev') {
                 $statement->debugDumpParams();
             }

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:135:17
             $data = $statement->execute();
         } catch (PDOException $e) {
             if (Settings::getEnvVariable('ENV') === 'dev') {
-                $statement->debugDumpParams();
+                
             }
             $this->_logger->critical("Error executing query: " . $e->getMessage());

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:137:13
             if (Settings::getEnvVariable('ENV') === 'dev') {
                 $statement->debugDumpParams();
             }
-            $this->_logger->critical("Error executing query: " . $e->getMessage());
+            $this->_logger->critical("Error executing query: ");
             exit(1);
         }

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:137:13
             if (Settings::getEnvVariable('ENV') === 'dev') {
                 $statement->debugDumpParams();
             }
-            $this->_logger->critical("Error executing query: " . $e->getMessage());
+            
             exit(1);
         }

[NoCoverage] IncrementInteger
Adebipe/Msql/MsQl.php:138:13
                 $statement->debugDumpParams();
             }
             $this->_logger->critical("Error executing query: " . $e->getMessage());
-            exit(1);
+            exit(2);
         }
         if ($data === false) {

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:138:13
                 $statement->debugDumpParams();
             }
             $this->_logger->critical("Error executing query: " . $e->getMessage());
-            exit(1);
+            exit(0);
         }
         if ($data === false) {

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:140:9
             $this->_logger->critical("Error executing query: " . $e->getMessage());
             exit(1);
         }
-        if ($data === false) {
+        if ($data === true) {
             $this->_logger->error("Error executing query: " . $statement->errorInfo()[2]);
             $this->_last_query_success = false;

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:140:9
             $this->_logger->critical("Error executing query: " . $e->getMessage());
             exit(1);
         }
-        if ($data === false) {
+        if ($data !== false) {
             $this->_logger->error("Error executing query: " . $statement->errorInfo()[2]);
             $this->_last_query_success = false;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:141:13
             exit(1);
         }
         if ($data === false) {
-            $this->_logger->error("Error executing query: " . $statement->errorInfo()[2]);
+            $this->_logger->error($statement->errorInfo()[2]);
             $this->_last_query_success = false;
             return [];

[NoCoverage] Concat
Adebipe/Msql/MsQl.php:141:13
             exit(1);
         }
         if ($data === false) {
-            $this->_logger->error("Error executing query: " . $statement->errorInfo()[2]);
+            $this->_logger->error($statement->errorInfo()[2] . "Error executing query: ");
             $this->_last_query_success = false;
             return [];

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:142:13
         }
         if ($data === false) {
             $this->_logger->error("Error executing query: " . $statement->errorInfo()[2]);
-            $this->_last_query_success = false;
+            $this->_last_query_success = true;
             return [];
         }

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:145:9
             $this->_last_query_success = false;
             return [];
         }
-        $this->_logger->info("Query executed successfully");
+        
         $this->_logger->info("Query: " . $statement->queryString);
         $this->_last_query_success = true;

[NoCoverage] ConcatOperandRemoval
Adebipe/Msql/MsQl.php:146:9
             return [];
         }
         $this->_logger->info("Query executed successfully");
-        $this->_logger->info("Query: " . $statement->queryString);
+        $this->_logger->info("Query: ");
         $this->_last_query_success = true;
         return $statement->fetchAll(PDO::FETCH_ASSOC);

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:146:9
             return [];
         }
         $this->_logger->info("Query executed successfully");
-        $this->_logger->info("Query: " . $statement->queryString);
+        
         $this->_last_query_success = true;
         return $statement->fetchAll(PDO::FETCH_ASSOC);

[NoCoverage] TrueValue
Adebipe/Msql/MsQl.php:147:9
         }
         $this->_logger->info("Query executed successfully");
         $this->_logger->info("Query: " . $statement->queryString);
-        $this->_last_query_success = true;
+        $this->_last_query_success = false;
         return $statement->fetchAll(PDO::FETCH_ASSOC);
     }

[NoCoverage] PublicVisibility
Adebipe/Msql/MsQl.php:156:5
      *
      * @return bool
      */
-    public function getLastQuerySuccess(): bool
+    protected function getLastQuerySuccess() : bool
     {
         return $this->_last_query_success;

[NoCoverage] PublicVisibility
Adebipe/Msql/MsQl.php:166:5
      *
      * @return int
      */
-    public function getLastInsertId(): int
+    protected function getLastInsertId() : int
     {
         if ($this->_connection === null) {

[NoCoverage] Identical
Adebipe/Msql/MsQl.php:172:9
             throw new \Exception("Connection to database not opened");
         }
         $result = $this->_connection->lastInsertId();
-        if ($result === false) {
+        if ($result !== false) {
             $this->_logger->error("Error getting last insert id");
             return 0;

[NoCoverage] FalseValue
Adebipe/Msql/MsQl.php:172:9
             throw new \Exception("Connection to database not opened");
         }
         $result = $this->_connection->lastInsertId();
-        if ($result === false) {
+        if ($result === true) {
             $this->_logger->error("Error getting last insert id");
             return 0;

[NoCoverage] MethodCallRemoval
Adebipe/Msql/MsQl.php:173:13
         }
         $result = $this->_connection->lastInsertId();
         if ($result === false) {
-            $this->_logger->error("Error getting last insert id");
+            
             return 0;
         }
