[NoCoverage] IncrementInteger
Adebipe/Msql/MsQl.php:174:13
         $result = $this->_connection->lastInsertId();
         if ($result === false) {
             $this->_logger->error("Error getting last insert id");
-            return 0;
+            return 1;
         }
         return (int)$result;

[NoCoverage] DecrementInteger
Adebipe/Msql/MsQl.php:174:13
         $result = $this->_connection->lastInsertId();
         if ($result === false) {
             $this->_logger->error("Error getting last insert id");
-            return 0;
+            return -1;
         }
         return (int)$result;

[NoCoverage] CastInt
Adebipe/Msql/MsQl.php:176:9
             $this->_logger->error("Error getting last insert id");
             return 0;
         }
-        return (int)$result;
+        return $result;
     }
 

[NoCoverage] PublicVisibility
Adebipe/Msql/MsQl.php:184:5
      *
      * @return array
      */
-    public function getTable(): array
+    protected function getTable() : array
     {
         $query = "SELECT * FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE='BASE TABLE' AND TABLE_CATALOG=?";

[NoCoverage] ArrayOneItem
Adebipe/Msql/MsQl.php:189:9
         $query = "SELECT * FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE='BASE TABLE' AND TABLE_CATALOG=?";
         $statement = $this->prepare($query);
         $data = $this->execute($statement, [$this->_database]);
-        return $data;
+        return count($data) > 1 ? array_slice($data, 0, 1, true) : $data;
     }
 }
