[NoCoverage] Foreach_
Adebipe/ORM/Model/Collection.php:59:9
      */
     public function find(string $key, string $value): ?object
     {
-        foreach ($this->_sql_data as $data) {
-            if ($data[$key] == $value) {
-                return new $this->_object_name($data);
-            }
-        }
+        foreach (array() as $data) {
         return null;
     }

[NoCoverage] Equal
Adebipe/ORM/Model/Collection.php:60:13
     public function find(string $key, string $value): ?object
     {
         foreach ($this->_sql_data as $data) {
-            if ($data[$key] == $value) {
+            if ($data[$key] != $value) {
                 return new $this->_object_name($data);
             }

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Collection.php:88:9
      */
     public function offsetGet($offset): mixed
     {
-        if (!isset($this->_data[$offset])) {
+        if (isset($this->_data[$offset])) {
             $this->_data[$offset] = new $this->_object_name($this->_sql_data[$offset]);
         }

[NoCoverage] Throw_
Adebipe/ORM/Model/Collection.php:106:9
      */
     public function offsetSet($offset, $value): void
     {
-        throw new \Exception("You can't add new elements to collection");
+        new \Exception("You can't add new elements to collection");
     }
 

[NoCoverage] Throw_
Adebipe/ORM/Model/Collection.php:120:9
      */
     public function offsetUnset($offset): void
     {
-        throw new \Exception("You can't delete elements from collection");
+        new \Exception("You can't delete elements from collection");
     }
 

[NoCoverage] Increment
Adebipe/ORM/Model/Collection.php:140:9
      */
     public function next(): void
     {
-        $this->_position++;
+        $this->_position--;
     }
 

[NoCoverage] DecrementInteger
Adebipe/ORM/Model/Collection.php:170:9
      */
     public function rewind(): void
     {
-        $this->_position = 0;
+        $this->_position = -1;
     }
 
