[NoCoverage] Foreach_
Adebipe/ORM/Model/Model.php:38:9
     {
         $this->_schema = static::createSchema();
         $all_key = array_keys($this->_schema);
-        foreach ($data as $key => $value) {
-            if (!in_array($key, $all_key)) {
-                throw new \Exception("Unknown key $key");
-            }
-            if (is_subclass_of($this->_schema[$key], SqlBasedTypeInterface::class)) {
-                continue;
-            }
-            $this->_properties[$key] = $value;
-        }
+        foreach (array() as $key => $value) {
     }
 

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Model.php:39:13
         $this->_schema = static::createSchema();
         $all_key = array_keys($this->_schema);
         foreach ($data as $key => $value) {
-            if (!in_array($key, $all_key)) {
+            if (in_array($key, $all_key)) {
                 throw new \Exception("Unknown key $key");
             }

[NoCoverage] Throw_
Adebipe/ORM/Model/Model.php:40:17
         $all_key = array_keys($this->_schema);
         foreach ($data as $key => $value) {
             if (!in_array($key, $all_key)) {
-                throw new \Exception("Unknown key $key");
+                new \Exception("Unknown key {$key}");
             }
             if (is_subclass_of($this->_schema[$key], SqlBasedTypeInterface::class)) {

[NoCoverage] IfNegation
Adebipe/ORM/Model/Model.php:42:13
             if (!in_array($key, $all_key)) {
                 throw new \Exception("Unknown key $key");
             }
-            if (is_subclass_of($this->_schema[$key], SqlBasedTypeInterface::class)) {
-                continue;
-            }
+            if (!is_subclass_of($this->_schema[$key], SqlBasedTypeInterface::class)) {
             $this->_properties[$key] = $value;
         }

[NoCoverage] Continue_
Adebipe/ORM/Model/Model.php:43:17
                 throw new \Exception("Unknown key $key");
             }
             if (is_subclass_of($this->_schema[$key], SqlBasedTypeInterface::class)) {
-                continue;
+                break;
             }
             $this->_properties[$key] = $value;

[NoCoverage] Foreach_
Adebipe/ORM/Model/Model.php:78:9
     {
         $schema = $this->getSchema();
         $values = [];
-        foreach ($schema as $key => $value) {
-            if (is_subclass_of($value, SqlBasedTypeInterface::class)) {
-                continue;
-            }
-            $values[$key] = $this->_properties[$key];
-        }
+        foreach (array() as $key => $value) {
         return $values;
     }

[NoCoverage] IfNegation
Adebipe/ORM/Model/Model.php:79:13
         $schema = $this->getSchema();
         $values = [];
         foreach ($schema as $key => $value) {
-            if (is_subclass_of($value, SqlBasedTypeInterface::class)) {
-                continue;
-            }
+            if (!is_subclass_of($value, SqlBasedTypeInterface::class)) {
             $values[$key] = $this->_properties[$key];
         }

[NoCoverage] Continue_
Adebipe/ORM/Model/Model.php:80:17
         $values = [];
         foreach ($schema as $key => $value) {
             if (is_subclass_of($value, SqlBasedTypeInterface::class)) {
-                continue;
+                break;
             }
             $values[$key] = $this->_properties[$key];

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Model.php:98:9
     public function addTo(string $name, object $value): bool
     {
         $schema = $this->getSchema();
-        if (!isset($schema[$name])) {
+        if (isset($schema[$name])) {
             throw new \Exception("Unknown key $name");
         }

[NoCoverage] Throw_
Adebipe/ORM/Model/Model.php:99:13
     {
         $schema = $this->getSchema();
         if (!isset($schema[$name])) {
-            throw new \Exception("Unknown key $name");
+            new \Exception("Unknown key {$name}");
         }
         $schema = $schema[$name];

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Model.php:102:9
             throw new \Exception("Unknown key $name");
         }
         $schema = $schema[$name];
-        if (!$schema instanceof SqlBasedTypeInterface) {
+        if (!true) {
             throw new \Exception("You can't add value to " . $name);
         }

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Model.php:102:9
             throw new \Exception("Unknown key $name");
         }
         $schema = $schema[$name];
-        if (!$schema instanceof SqlBasedTypeInterface) {
+        if ($schema instanceof SqlBasedTypeInterface) {
             throw new \Exception("You can't add value to " . $name);
         }

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Model.php:103:13
         }
         $schema = $schema[$name];
         if (!$schema instanceof SqlBasedTypeInterface) {
-            throw new \Exception("You can't add value to " . $name);
+            throw new \Exception("You can't add value to ");
         }
         return $schema->addToDb(Model::$msql, $this->id, $value);

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Model.php:103:13
         }
         $schema = $schema[$name];
         if (!$schema instanceof SqlBasedTypeInterface) {
-            throw new \Exception("You can't add value to " . $name);
+            throw new \Exception($name);
         }
         return $schema->addToDb(Model::$msql, $this->id, $value);

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Model.php:123:9
             throw new \Exception("Unknown key $name");
         }
         $schema = $schema[$name];
-        if (!$schema instanceof SqlBasedTypeInterface) {
+        if (!false) {
             throw new \Exception("You can't delete value to $name");
         }

[NoCoverage] Throw_
Adebipe/ORM/Model/Model.php:124:13
         }
         $schema = $schema[$name];
         if (!$schema instanceof SqlBasedTypeInterface) {
-            throw new \Exception("You can't delete value to $name");
+            new \Exception("You can't delete value to {$name}");
         }
         return $schema->deleteToDb(Model::$msql, $this->id, $value);

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Model.php:144:9
             throw new \Exception("Unknown key $name");
         }
         $schema = $schema[$name];
-        if (!isset($this->_properties[$name])) {
+        if (isset($this->_properties[$name])) {
             if (!$schema instanceof SqlBasedTypeInterface) {
                 return null;

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Model.php:145:13
         }
         $schema = $schema[$name];
         if (!isset($this->_properties[$name])) {
-            if (!$schema instanceof SqlBasedTypeInterface) {
+            if (!false) {
                 return null;
             }

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Model.php:145:13
         }
         $schema = $schema[$name];
         if (!isset($this->_properties[$name])) {
-            if (!$schema instanceof SqlBasedTypeInterface) {
+            if (!true) {
                 return null;
             }

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Model.php:166:9
      */
     public function __set(string $name, $value): void
     {
-        if (!isset($this->_properties[$name])) {
+        if (isset($this->_properties[$name])) {
             throw new \Exception("Unknown key $name");
         }

[NoCoverage] Throw_
Adebipe/ORM/Model/Model.php:167:13
     public function __set(string $name, $value): void
     {
         if (!isset($this->_properties[$name])) {
-            throw new \Exception("Unknown key $name");
+            new \Exception("Unknown key {$name}");
         }
         $schema = $this->getSchema()[$name];

[NoCoverage] IfNegation
Adebipe/ORM/Model/Model.php:170:9
             throw new \Exception("Unknown key $name");
         }
         $schema = $this->getSchema()[$name];
-        if (is_subclass_of($schema, SqlBasedTypeInterface::class)) {
-            throw new \Exception("You can't set value to $name");
-        }
+        if (!is_subclass_of($schema, SqlBasedTypeInterface::class)) {
         $this->_properties[$name] = $value;
     }

[NoCoverage] Throw_
Adebipe/ORM/Model/Model.php:171:13
         }
         $schema = $this->getSchema()[$name];
         if (is_subclass_of($schema, SqlBasedTypeInterface::class)) {
-            throw new \Exception("You can't set value to $name");
+            new \Exception("You can't set value to {$name}");
         }
         $this->_properties[$name] = $value;
