[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:72:13
         $this->_named_object = ORM::classToTableName($object_type);
         $this->_is_first = $is_first;
         if ($this->_is_first) {
-            $this->_middle_table_name = $this->_named_me . '_' . $this->_named_object;
+            $this->_middle_table_name = $this->_named_me . $this->_named_object;
         } else {
             $this->_middle_table_name = $this->_named_object . '_' . $this->_named_me;

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:72:13
         $this->_named_object = ORM::classToTableName($object_type);
         $this->_is_first = $is_first;
         if ($this->_is_first) {
-            $this->_middle_table_name = $this->_named_me . '_' . $this->_named_object;
+            $this->_middle_table_name = '_' . $this->_named_me . $this->_named_object;
         } else {
             $this->_middle_table_name = $this->_named_object . '_' . $this->_named_me;

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:74:13
         if ($this->_is_first) {
             $this->_middle_table_name = $this->_named_me . '_' . $this->_named_object;
         } else {
-            $this->_middle_table_name = $this->_named_object . '_' . $this->_named_me;
+            $this->_middle_table_name = $this->_named_object . $this->_named_me;
         }
         parent::__construct('INT', false, false);

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:74:13
         if ($this->_is_first) {
             $this->_middle_table_name = $this->_named_me . '_' . $this->_named_object;
         } else {
-            $this->_middle_table_name = $this->_named_object . '_' . $this->_named_me;
+            $this->_middle_table_name = '_' . $this->_named_object . $this->_named_me;
         }
         parent::__construct('INT', false, false);

[NoCoverage] FalseValue
Model/ModelType/Complex/ManyToMany.php:76:9
         } else {
             $this->_middle_table_name = $this->_named_object . '_' . $this->_named_me;
         }
-        parent::__construct('INT', false, false);
+        parent::__construct('INT', true, false);
     }
 

[NoCoverage] FalseValue
Model/ModelType/Complex/ManyToMany.php:76:9
         } else {
             $this->_middle_table_name = $this->_named_object . '_' . $this->_named_me;
         }
-        parent::__construct('INT', false, false);
+        parent::__construct('INT', false, true);
     }
 

[NoCoverage] LogicalNot
Model/ModelType/Complex/ManyToMany.php:119:9
      */
     public function getMoreSql(): array
     {
-        if (!$this->_is_first) {
+        if ($this->_is_first) {
             return [];
         }

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:125:9
         $table_name = $this->_middle_table_name;
         $named_me = $this->_named_me;
         $named_obj = $this->_named_object;
-        $first_id = $named_me . '_id';
+        $first_id = '_id' . $named_me;
         $sec_id = $named_obj . '_id';
         return [

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:125:9
         $table_name = $this->_middle_table_name;
         $named_me = $this->_named_me;
         $named_obj = $this->_named_object;
-        $first_id = $named_me . '_id';
+        $first_id = $named_me;
         $sec_id = $named_obj . '_id';
         return [

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:126:9
         $named_me = $this->_named_me;
         $named_obj = $this->_named_object;
         $first_id = $named_me . '_id';
-        $sec_id = $named_obj . '_id';
+        $sec_id = $named_obj;
         return [
             "now" => [

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:126:9
         $named_me = $this->_named_me;
         $named_obj = $this->_named_object;
         $first_id = $named_me . '_id';
-        $sec_id = $named_obj . '_id';
+        $sec_id = '_id';
         return [
             "now" => [

[NoCoverage] LogicalNot
Model/ModelType/Complex/ManyToMany.php:173:9
      */
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
-        if (!$value instanceof $this->_object_type) {
+        if ($value instanceof $this->_object_type) {
             throw new \Exception("The value must be an instance of " . $this->_object_type);
         }

[NoCoverage] InstanceOf_
Model/ModelType/Complex/ManyToMany.php:173:9
      */
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
-        if (!$value instanceof $this->_object_type) {
+        if (!false) {
             throw new \Exception("The value must be an instance of " . $this->_object_type);
         }

[NoCoverage] Throw_
Model/ModelType/Complex/ManyToMany.php:174:13
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object_type) {
-            throw new \Exception("The value must be an instance of " . $this->_object_type);
+            new \Exception("The value must be an instance of " . $this->_object_type);
         }
         if (!$value instanceof Model) {

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:174:13
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object_type) {
-            throw new \Exception("The value must be an instance of " . $this->_object_type);
+            throw new \Exception($this->_object_type . "The value must be an instance of ");
         }
         if (!$value instanceof Model) {

[NoCoverage] LogicalNot
Model/ModelType/Complex/ManyToMany.php:176:9
         if (!$value instanceof $this->_object_type) {
             throw new \Exception("The value must be an instance of " . $this->_object_type);
         }
-        if (!$value instanceof Model) {
+        if ($value instanceof Model) {
             throw new \Exception("The value must be an instance of Model");
         }

[NoCoverage] InstanceOf_
Model/ModelType/Complex/ManyToMany.php:176:9
         if (!$value instanceof $this->_object_type) {
             throw new \Exception("The value must be an instance of " . $this->_object_type);
         }
-        if (!$value instanceof Model) {
+        if (!true) {
             throw new \Exception("The value must be an instance of Model");
         }

[NoCoverage] Throw_
Model/ModelType/Complex/ManyToMany.php:177:13
             throw new \Exception("The value must be an instance of " . $this->_object_type);
         }
         if (!$value instanceof Model) {
-            throw new \Exception("The value must be an instance of Model");
+            new \Exception("The value must be an instance of Model");
         }
         $query = ("INSERT INTO " . $this->_middle_table_name .

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:179:9
         if (!$value instanceof Model) {
             throw new \Exception("The value must be an instance of Model");
         }
-        $query = ("INSERT INTO " . $this->_middle_table_name .
+        $query = $this->_middle_table_name . "INSERT INTO " . " (" . $this->_named_me . "_id, " . $this->_named_object . "_id) VALUES" . " (" . $id . ", " . $value->id . ")";
             " (" . $this->_named_me . "_id, " . $this->_named_object . "_id) VALUES" .
             " (" . $id . ", " . $value->id . ")"

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:179:9
         if (!$value instanceof Model) {
             throw new \Exception("The value must be an instance of Model");
         }
-        $query = ("INSERT INTO " . $this->_middle_table_name .
-            " (" . $this->_named_me . "_id, " . $this->_named_object . "_id) VALUES" .
+        $query = "INSERT INTO " . $this->_middle_table_name . $this->_named_me . " (" . "_id, " . $this->_named_object . "_id) VALUES" . " (" . $id . ", " . $value->id . ")";object . "_id) VALUES" .
             " (" . $id . ", " . $value->id . ")"
         );

[NoCoverage] MethodCallRemoval
Model/ModelType/Complex/ManyToMany.php:184:9
             " (" . $id . ", " . $value->id . ")"
         );
         $result = $msql->prepare($query);
-        $msql->execute($result);
+        
         return $msql->getLastQuerySuccess();
     }

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:200:13
     public function deleteToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object_type) {
-            throw new \Exception("The value must be an instance of " . $this->_object_type);
+            throw new \Exception($this->_object_type);
         }
         if (!$value instanceof Model) {

[NoCoverage] InstanceOf_
Model/ModelType/Complex/ManyToMany.php:202:9
         if (!$value instanceof $this->_object_type) {
             throw new \Exception("The value must be an instance of " . $this->_object_type);
         }
-        if (!$value instanceof Model) {
+        if (!false) {
             throw new \Exception("The value must be an instance of Model");
         }

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:205:9
         if (!$value instanceof Model) {
             throw new \Exception("The value must be an instance of Model");
         }
-        $query = "DELETE FROM " . $this->_middle_table_name . " WHERE " . $this->_named_me . "_id = " . $id .
+        $query = "DELETE FROM " . $this->_middle_table_name . " WHERE " . $this->_named_me . $id . " AND " . $this->_named_object . "_id = " . $value->id;
             " AND " . $this->_named_object . "_id = " . $value->id;
         $result = $msql->prepare($query);

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:205:9
         if (!$value instanceof Model) {
             throw new \Exception("The value must be an instance of Model");
         }
-        $query = "DELETE FROM " . $this->_middle_table_name . " WHERE " . $this->_named_me . "_id = " . $id .
+        $query = $this->_middle_table_name . " WHERE " . $this->_named_me . "_id = " . $id . " AND " . $this->_named_object . "_id = " . $value->id;
             " AND " . $this->_named_object . "_id = " . $value->id;
         $result = $msql->prepare($query);

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToMany.php:222:9
      */
     public function updateDbOnDelete(MsQl $msql, string $id): void
     {
-        $query = "DELETE FROM " . $this->_middle_table_name . " WHERE " . $this->_named_me . "_id = " . $id;
+        $query = "DELETE FROM " . $this->_middle_table_name . " WHERE " . $this->_named_me . "_id = ";
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/ManyToMany.php:222:9
      */
     public function updateDbOnDelete(MsQl $msql, string $id): void
     {
-        $query = "DELETE FROM " . $this->_middle_table_name . " WHERE " . $this->_named_me . "_id = " . $id;
+        $query = "DELETE FROM " . $this->_middle_table_name . $this->_named_me . " WHERE " . "_id = " . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);
