[NoCoverage] FalseValue
Model/ModelType/Complex/ManyToOne.php:49:9
         $this->_me_object = $me_object;
         $this->_relationedBy = $relationedBy;
         $this->_object = $object;
-        parent::__construct('INT', false, false);
+        parent::__construct('INT', true, false);
     }
 

[NoCoverage] MethodCallRemoval
Model/ModelType/Complex/ManyToOne.php:49:9
         $this->_me_object = $me_object;
         $this->_relationedBy = $relationedBy;
         $this->_object = $object;
-        parent::__construct('INT', false, false);
+        
     }
 

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:61:17
     {
         return [
             "after" => [
-                "ALTER TABLE " . ORM::classToTableName($this->_me_object) .
-                    " ADD FOREIGN KEY (" . $this->_relationedBy . ") REFERENCES " .
+                return ["after" => ["ALTER TABLE " . ORM::classToTableName($this->_me_object) . " ADD FOREIGN KEY (" . ") REFERENCES " . ORM::classToTableName($this->_object) . "(id)"]];NCES " .
                     ORM::classToTableName($this->_object) . "(id)"
             ]

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:61:17
     {
         return [
             "after" => [
-                "ALTER TABLE " . ORM::classToTableName($this->_me_object) .
-                    " ADD FOREIGN KEY (" . $this->_relationedBy . ") REFERENCES " .
-                    ORM::classToTableName($this->_object) . "(id)"
+                return ["after" => ["ALTER TABLE " . ORM::classToTableName($this->_me_object) . " ADD FOREIGN KEY (" . $this->_relationedBy . ") REFERENCES " . "(id)"]];
             ]
         ];

[NoCoverage] IncrementInteger
Model/ModelType/Complex/ManyToOne.php:108:9
             " WHERE " . $me_object_table . ".id = " . $id;
         $result = $msql->prepare($query);
         $data = $msql->execute($result);
-        return new $this->_object($data[0]);
+        return new $this->_object($data[1]);
     }
 

[NoCoverage] InstanceOf_
Model/ModelType/Complex/ManyToOne.php:122:9
      */
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
-        if (!$value instanceof $this->_object) {
+        if (!false) {
             throw new \Exception("The value must be an instance of " . $this->_object);
         }

[NoCoverage] InstanceOf_
Model/ModelType/Complex/ManyToOne.php:122:9
      */
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
-        if (!$value instanceof $this->_object) {
+        if (!true) {
             throw new \Exception("The value must be an instance of " . $this->_object);
         }

[NoCoverage] Throw_
Model/ModelType/Complex/ManyToOne.php:123:13
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object) {
-            throw new \Exception("The value must be an instance of " . $this->_object);
+            new \Exception("The value must be an instance of " . $this->_object);
         }
         if (!$value instanceof Model) {

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:123:13
     public function addToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object) {
-            throw new \Exception("The value must be an instance of " . $this->_object);
+            throw new \Exception("The value must be an instance of ");
         }
         if (!$value instanceof Model) {

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:129:9
             throw new \Exception("The value must be an instance of Model");
         }
         $me_object_table = ORM::classToTableName($this->_me_object);
-        $query = "UPDATE " . $me_object_table . " SET " . $this->_relationedBy . " = " . $value->id .
+        $query = "UPDATE " . $me_object_table . $this->_relationedBy . " = " . $value->id . " WHERE id = " . $id;
             " WHERE id = " . $id;
         $result = $msql->prepare($query);

[NoCoverage] Concat
Model/ModelType/Complex/ManyToOne.php:129:9
             throw new \Exception("The value must be an instance of Model");
         }
         $me_object_table = ORM::classToTableName($this->_me_object);
-        $query = "UPDATE " . $me_object_table . " SET " . $this->_relationedBy . " = " . $value->id .
+        $query = "UPDATE " . " SET " . $me_object_table . $this->_relationedBy . " = " . $value->id . " WHERE id = " . $id;
             " WHERE id = " . $id;
         $result = $msql->prepare($query);

[NoCoverage] LogicalNot
Model/ModelType/Complex/ManyToOne.php:147:9
      */
     public function deleteToDb(MsQl $msql, string $id, object $value): bool
     {
-        if (!$value instanceof $this->_object) {
+        if ($value instanceof $this->_object) {
             throw new \Exception("The value must be an instance of " . $this->_object);
         }

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:148:13
     public function deleteToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object) {
-            throw new \Exception("The value must be an instance of " . $this->_object);
+            throw new \Exception($this->_object);
         }
         if (!$value instanceof Model) {

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:154:9
             throw new \Exception("The value must be an instance of Model");
         }
         $me_object_table = ORM::classToTableName($this->_me_object);
-        $query = "UPDATE " . $me_object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $id;
+        $query = "UPDATE " . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/ManyToOne.php:154:9
             throw new \Exception("The value must be an instance of Model");
         }
         $me_object_table = ORM::classToTableName($this->_me_object);
-        $query = "UPDATE " . $me_object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $id;
+        $query = "UPDATE " . $me_object_table . $this->_relationedBy . " SET " . " = NULL WHERE id = " . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/ManyToOne.php:171:9
     public function updateDbOnDelete(MsQl $msql, string $id): void
     {
         $me_object_table = ORM::classToTableName($this->_me_object);
-        $query = "UPDATE " . $me_object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $id;
+        $query = $me_object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/ManyToOne.php:171:9
     public function updateDbOnDelete(MsQl $msql, string $id): void
     {
         $me_object_table = ORM::classToTableName($this->_me_object);
-        $query = "UPDATE " . $me_object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $id;
+        $query = "UPDATE " . $me_object_table . " SET " . " = NULL WHERE id = " . $this->_relationedBy . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);
