[NoCoverage] LogicalNot
Model/ModelType/Complex/OneToMany.php:49:9
      */
     public function __construct(string $me_object, string $object, string $relationedBy)
     {
-        if (!class_exists($me_object)) {
+        if (class_exists($me_object)) {
             throw new \Exception("The class $me_object doesn't exist");
         }

[NoCoverage] Throw_
Model/ModelType/Complex/OneToMany.php:50:13
     public function __construct(string $me_object, string $object, string $relationedBy)
     {
         if (!class_exists($me_object)) {
-            throw new \Exception("The class $me_object doesn't exist");
+            new \Exception("The class {$me_object} doesn't exist");
         }
         if (!class_exists($object)) {

[NoCoverage] LogicalNot
Model/ModelType/Complex/OneToMany.php:52:9
         if (!class_exists($me_object)) {
             throw new \Exception("The class $me_object doesn't exist");
         }
-        if (!class_exists($object)) {
+        if (class_exists($object)) {
             throw new \Exception("The class $object doesn't exist");
         }

[NoCoverage] Throw_
Model/ModelType/Complex/OneToMany.php:53:13
             throw new \Exception("The class $me_object doesn't exist");
         }
         if (!class_exists($object)) {
-            throw new \Exception("The class $object doesn't exist");
+            new \Exception("The class {$object} doesn't exist");
         }
         if (!is_subclass_of($me_object, Model::class)) {

[NoCoverage] LogicalNot
Model/ModelType/Complex/OneToMany.php:55:9
         if (!class_exists($object)) {
             throw new \Exception("The class $object doesn't exist");
         }
-        if (!is_subclass_of($me_object, Model::class)) {
+        if (is_subclass_of($me_object, Model::class)) {
             throw new \Exception("The class $me_object must extends Model");
         }

[NoCoverage] Throw_
Model/ModelType/Complex/OneToMany.php:56:13
             throw new \Exception("The class $object doesn't exist");
         }
         if (!is_subclass_of($me_object, Model::class)) {
-            throw new \Exception("The class $me_object must extends Model");
+            new \Exception("The class {$me_object} must extends Model");
         }
         if (!is_subclass_of($object, Model::class)) {

[NoCoverage] LogicalNot
Model/ModelType/Complex/OneToMany.php:58:9
         if (!is_subclass_of($me_object, Model::class)) {
             throw new \Exception("The class $me_object must extends Model");
         }
-        if (!is_subclass_of($object, Model::class)) {
+        if (is_subclass_of($object, Model::class)) {
             throw new \Exception("The class $object must extends Model");
         }

[NoCoverage] Throw_
Model/ModelType/Complex/OneToMany.php:59:13
             throw new \Exception("The class $me_object must extends Model");
         }
         if (!is_subclass_of($object, Model::class)) {
-            throw new \Exception("The class $object must extends Model");
+            new \Exception("The class {$object} must extends Model");
         }
         $this->_me_object = $me_object;

[NoCoverage] MethodCallRemoval
Model/ModelType/Complex/OneToMany.php:64:9
         $this->_me_object = $me_object;
         $this->_object = $object;
         $this->_relationedBy = $relationedBy;
-        parent::__construct('INT', false, false);
+        
     }
 

[NoCoverage] FalseValue
Model/ModelType/Complex/OneToMany.php:64:9
         $this->_me_object = $me_object;
         $this->_object = $object;
         $this->_relationedBy = $relationedBy;
-        parent::__construct('INT', false, false);
+        parent::__construct('INT', false, true);
     }
 

[NoCoverage] Concat
Model/ModelType/Complex/OneToMany.php:138:9
             throw new \Exception("The value must be an instance of Model");
         }
         $object_table = ORM::classToTableName($this->_object);
-        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = " . $id . " WHERE id = " . $value->id;
+        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = " . $id . $value->id . " WHERE id = ";
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/OneToMany.php:138:9
             throw new \Exception("The value must be an instance of Model");
         }
         $object_table = ORM::classToTableName($this->_object);
-        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = " . $id . " WHERE id = " . $value->id;
+        $query = "UPDATE " . $object_table . $this->_relationedBy . " SET " . " = " . $id . " WHERE id = " . $value->id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/OneToMany.php:156:13
     public function deleteToDb(MsQl $msql, string $id, object $value): bool
     {
         if (!$value instanceof $this->_object) {
-            throw new \Exception("The value must be an instance of " . $this->_object);
+            throw new \Exception($this->_object . "The value must be an instance of ");
         }
         if (!$value instanceof Model) {

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/OneToMany.php:162:9
             throw new \Exception("The value must be an instance of Model");
         }
         $object_table = ORM::classToTableName($this->_object);
-        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $value->id;
+        $query = "UPDATE " . $object_table . " SET " . " = NULL WHERE id = " . $value->id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/OneToMany.php:162:9
             throw new \Exception("The value must be an instance of Model");
         }
         $object_table = ORM::classToTableName($this->_object);
-        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = NULL WHERE id = " . $value->id;
+        $query = "UPDATE " . $object_table . " SET " . " = NULL WHERE id = " . $this->_relationedBy . $value->id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] Concat
Model/ModelType/Complex/OneToMany.php:179:9
     public function updateDbOnDelete(MsQl $msql, string $id): void
     {
         $object_table = ORM::classToTableName($this->_object);
-        $query = "UPDATE " . $object_table . " SET " .
-            $this->_relationedBy . " = NULL WHERE " . $this->_relationedBy . " = " . $id;
+        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = NULL WHERE " . $this->_relationedBy . $id . " = ";$this->_relationedBy . " = " . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);

[NoCoverage] ConcatOperandRemoval
Model/ModelType/Complex/OneToMany.php:179:9
     public function updateDbOnDelete(MsQl $msql, string $id): void
     {
         $object_table = ORM::classToTableName($this->_object);
-        $query = "UPDATE " . $object_table . " SET " .
-            $this->_relationedBy . " = NULL WHERE " . $this->_relationedBy . " = " . $id;
+        $query = "UPDATE " . $object_table . " SET " . $this->_relationedBy . " = NULL WHERE " . " = " . $id;$this->_relationedBy . " = " . $id;
         $result = $msql->prepare($query);
         $msql->execute($result);
