[NoCoverage] FalseValue
ORM/Model/ModelType/DateTimeType.php:19:5
      *
      * @param bool $not_null If the column can be null
      */
-    public function __construct(bool $not_null = false)
+    public function __construct(bool $not_null = true)
     {
         parent::__construct('DATETIME', $not_null, false);

[NoCoverage] FalseValue
ORM/Model/ModelType/DateTimeType.php:21:9
      */
     public function __construct(bool $not_null = false)
     {
-        parent::__construct('DATETIME', $not_null, false);
+        parent::__construct('DATETIME', $not_null, true);
     }
 

[NoCoverage] MethodCallRemoval
ORM/Model/ModelType/DateTimeType.php:21:9
      */
     public function __construct(bool $not_null = false)
     {
-        parent::__construct('DATETIME', $not_null, false);
+        
     }
 

[NoCoverage] IfNegation
ORM/Model/ModelType/DateTimeType.php:33:9
      */
     public function checkType(mixed $value): ?bool
     {
-        if (is_string($value)) {
-            $test = DateTime::createFromFormat('Y-m-d H:i:s', $value);
-            return $test !== false;
-        }
+        if (!is_string($value)) {
         return false;
     }

[NoCoverage] FalseValue
ORM/Model/ModelType/DateTimeType.php:35:13
     {
         if (is_string($value)) {
             $test = DateTime::createFromFormat('Y-m-d H:i:s', $value);
-            return $test !== false;
+            return $test !== true;
         }
         return false;

[NoCoverage] NotIdentical
ORM/Model/ModelType/DateTimeType.php:35:13
     {
         if (is_string($value)) {
             $test = DateTime::createFromFormat('Y-m-d H:i:s', $value);
-            return $test !== false;
+            return $test === false;
         }
         return false;
