[NoCoverage] FalseValue
ORM/Model/ModelType/IntType.php:18:5
      * @param bool $not_null       If the column can be null
      * @param bool $auto_increment If the column is auto increment
      */
-    public function __construct(bool $not_null = false, bool $auto_increment = false)
+    public function __construct(bool $not_null = false, bool $auto_increment = true)
     {
         parent::__construct('INT', $not_null, $auto_increment);

[NoCoverage] FalseValue
ORM/Model/ModelType/IntType.php:18:5
      * @param bool $not_null       If the column can be null
      * @param bool $auto_increment If the column is auto increment
      */
-    public function __construct(bool $not_null = false, bool $auto_increment = false)
+    public function __construct(bool $not_null = true, bool $auto_increment = false)
     {
         parent::__construct('INT', $not_null, $auto_increment);

[NoCoverage] MethodCallRemoval
ORM/Model/ModelType/IntType.php:20:9
      */
     public function __construct(bool $not_null = false, bool $auto_increment = false)
     {
-        parent::__construct('INT', $not_null, $auto_increment);
+        
     }
 

[NoCoverage] FunctionCall
ORM/Model/ModelType/IntType.php:32:9
      */
     public function checkType(mixed $value): ?bool
     {
-        return is_int($value);
+        is_int($value);
+        return null;
     }
 
