[NoCoverage] FalseValue
Model/ModelType/Interfaces/AbstractType.php:40:5
      * @param bool   $not_null       If the column can be null
      * @param bool   $auto_increment If the column is auto increment
      */
-    public function __construct(string $type, bool $not_null = false, bool $auto_increment = false)
+    public function __construct(string $type, bool $not_null = true, bool $auto_increment = false)
     {
         $this->type = $type;

[NoCoverage] FalseValue
Model/ModelType/Interfaces/AbstractType.php:40:5
      * @param bool   $not_null       If the column can be null
      * @param bool   $auto_increment If the column is auto increment
      */
-    public function __construct(string $type, bool $not_null = false, bool $auto_increment = false)
+    public function __construct(string $type, bool $not_null = false, bool $auto_increment = true)
     {
         $this->type = $type;

[NoCoverage] LogicalNot
Model/ModelType/Interfaces/AbstractType.php:54:9
      */
     public function canBeNull(): bool
     {
-        return !$this->not_null;
+        return $this->not_null;
     }
 

[NoCoverage] Assignment
Model/ModelType/Interfaces/AbstractType.php:78:13
         $sql = $this->type;
 
         if ($this->not_null) {
-            $sql .= ' NOT NULL';
+            $sql = ' NOT NULL';
         }
 

[NoCoverage] Assignment
Model/ModelType/Interfaces/AbstractType.php:82:13
         }
 
         if ($this->auto_increment) {
-            $sql .= ' AUTO_INCREMENT';
+            $sql = ' AUTO_INCREMENT';
         }
 
