[NoCoverage] FalseValue
ORM/Model/ModelType/StringType.php:20:5
      * @param int  $size     The size of the string
      * @param bool $not_null If the column can be null
      */
-    public function __construct(int $size, bool $not_null = false)
+    public function __construct(int $size, bool $not_null = true)
     {
         parent::__construct('VARCHAR(' . $size . ')', $not_null, false);

[NoCoverage] ConcatOperandRemoval
ORM/Model/ModelType/StringType.php:22:9
      */
     public function __construct(int $size, bool $not_null = false)
     {
-        parent::__construct('VARCHAR(' . $size . ')', $not_null, false);
+        parent::__construct($size . ')', $not_null, false);
         $this->size = $size;
     }

[NoCoverage] Concat
ORM/Model/ModelType/StringType.php:22:9
      */
     public function __construct(int $size, bool $not_null = false)
     {
-        parent::__construct('VARCHAR(' . $size . ')', $not_null, false);
+        parent::__construct($size . 'VARCHAR(' . ')', $not_null, false);
         $this->size = $size;
     }

[NoCoverage] LogicalAndSingleSubExprNegation
ORM/Model/ModelType/StringType.php:35:9
      */
     public function checkType(mixed $value): ?bool
     {
-        return is_string($value) && strlen($value) <= $this->size;
+        return !is_string($value) && strlen($value) <= $this->size;
     }
 

[NoCoverage] LessThanOrEqualToNegotiation
ORM/Model/ModelType/StringType.php:35:9
      */
     public function checkType(mixed $value): ?bool
     {
-        return is_string($value) && strlen($value) <= $this->size;
+        return is_string($value) && strlen($value) > $this->size;
     }
 
