[NoCoverage] PublicVisibility
Adebipe/ORM/Model/ORMTableCreator.php:34:5
      *
      * @return void
      */
-    public function createModel(string $object_class): void
+    protected function createModel(string $object_class) : void
     {
         $this->database_schema[$object_class] = $object_class;

[NoCoverage] PublicVisibility
Adebipe/ORM/Model/ORMTableCreator.php:44:5
      *
      * @return array
      */
-    public function getSchema(): array
+    protected function getSchema() : array
     {
         return $this->database_schema;
