[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:90:9
      */
     public function findOneBy(array $conditions, ?array $type = null): ?object
     {
-        $query = "SELECT * FROM " . $this->_table_name . " WHERE ";
+        $query = "SELECT * FROM " . $this->_table_name;
         $query .= implode(
             " AND ",

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:90:9
      */
     public function findOneBy(array $conditions, ?array $type = null): ?object
     {
-        $query = "SELECT * FROM " . $this->_table_name . " WHERE ";
+        $query = $this->_table_name . " WHERE ";
         $query .= implode(
             " AND ",

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:91:9
     public function findOneBy(array $conditions, ?array $type = null): ?object
     {
         $query = "SELECT * FROM " . $this->_table_name . " WHERE ";
-        $query .= implode(
-            " AND ",
-            array_map(
-                function ($key) {
-                    return "$key = ?";
-                },
-                array_keys($conditions)
-            )
-        );
+        $query = implode(" AND ", array_map(function ($key) {
         $statement = $this->_msql->prepare($query);
         if ($type === null) {

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:101:9
             )
         );
         $statement = $this->_msql->prepare($query);
-        if ($type === null) {
+        if ($type !== null) {
             $type = array_fill(0, count($conditions), \PDO::PARAM_STR);
         }

[NoCoverage] IncrementInteger
Adebipe/ORM/Model/Repository.php:102:13
         );
         $statement = $this->_msql->prepare($query);
         if ($type === null) {
-            $type = array_fill(0, count($conditions), \PDO::PARAM_STR);
+            $type = array_fill(1, count($conditions), \PDO::PARAM_STR);
         }
         $result = $this->_msql->execute($statement, array_values($conditions), $type);

[NoCoverage] DecrementInteger
Adebipe/ORM/Model/Repository.php:102:13
         );
         $statement = $this->_msql->prepare($query);
         if ($type === null) {
-            $type = array_fill(0, count($conditions), \PDO::PARAM_STR);
+            $type = array_fill(-1, count($conditions), \PDO::PARAM_STR);
         }
         $result = $this->_msql->execute($statement, array_values($conditions), $type);

[NoCoverage] UnwrapArrayValues
Adebipe/ORM/Model/Repository.php:104:9
         if ($type === null) {
             $type = array_fill(0, count($conditions), \PDO::PARAM_STR);
         }
-        $result = $this->_msql->execute($statement, array_values($conditions), $type);
+        $result = $this->_msql->execute($statement, $conditions, $type);
         if (count($result) === 0) {
             return null;

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:105:9
             $type = array_fill(0, count($conditions), \PDO::PARAM_STR);
         }
         $result = $this->_msql->execute($statement, array_values($conditions), $type);
-        if (count($result) === 0) {
+        if (count($result) !== 0) {
             return null;
         }

[NoCoverage] IncrementInteger
Adebipe/ORM/Model/Repository.php:108:9
         if (count($result) === 0) {
             return null;
         }
-        return new $this->_class_name($result[0]);
+        return new $this->_class_name($result[1]);
     }
 

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:122:9
     public function findAllBy(array $conditions, ?array $type = null): CollectionInterface
     {
         $query = "SELECT * FROM ? WHERE ";
-        $query .= implode(
-            " AND ",
-            array_map(
-                function ($key) {
-                    return "$key = ?";
-                },
-                array_keys($conditions)
-            )
-        );
+        $query = implode(" AND ", array_map(function ($key) {
         $statement = $this->_msql->prepare($query);
         if ($type === null) {

[NoCoverage] UnwrapArrayMap
Adebipe/ORM/Model/Repository.php:124:13
         $query = "SELECT * FROM ? WHERE ";
         $query .= implode(
             " AND ",
-            array_map(
-                function ($key) {
-                    return "$key = ?";
-                },
-                array_keys($conditions)
-            )
+            $query .= implode(" AND ", array_keys($conditions));
         );
         $statement = $this->_msql->prepare($query);

[NoCoverage] UnwrapArrayMerge
Adebipe/ORM/Model/Repository.php:135:9
         if ($type === null) {
             $type = array_fill(0, count($conditions), \PDO::PARAM_STR);
         }
-        $result = $this->_msql->execute($statement, array_values($conditions), array_merge([\PDO::PARAM_STR], $type));
+        $result = $this->_msql->execute($statement, array_values($conditions), $type);
         return new Collection($result, $this->_class_name);
     }

[NoCoverage] Concat
Adebipe/ORM/Model/Repository.php:146:9
      */
     public function findAll(): CollectionInterface
     {
-        $query = "SELECT * FROM " . $this->_table_name;
+        $query = $this->_table_name . "SELECT * FROM ";
         $result = $this->_msql->prepare($query);
         $sql = $this->_msql->execute($result);

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:146:9
      */
     public function findAll(): CollectionInterface
     {
-        $query = "SELECT * FROM " . $this->_table_name;
+        $query = $this->_table_name;
         $result = $this->_msql->prepare($query);
         $sql = $this->_msql->execute($result);

[NoCoverage] LogicalNot
Adebipe/ORM/Model/Repository.php:161:9
      */
     public function save(&$object): bool
     {
-        if (!is_a($object, $this->_class_name)) {
+        if (is_a($object, $this->_class_name)) {
             throw new \Exception("You can't save object of class " . get_class($object) . " as " . $this->_class_name);
         }

[NoCoverage] Throw_
Adebipe/ORM/Model/Repository.php:162:13
     public function save(&$object): bool
     {
         if (!is_a($object, $this->_class_name)) {
-            throw new \Exception("You can't save object of class " . get_class($object) . " as " . $this->_class_name);
+            new \Exception("You can't save object of class " . get_class($object) . " as " . $this->_class_name);
         }
 

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:162:13
     public function save(&$object): bool
     {
         if (!is_a($object, $this->_class_name)) {
-            throw new \Exception("You can't save object of class " . get_class($object) . " as " . $this->_class_name);
+            throw new \Exception("You can't save object of class " . get_class($object) . $this->_class_name);
         }
 

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Repository.php:171:13
 
         foreach ($this->_schema as $key => $type) {
             $model_type = $type;
-            if (!$type instanceof SqlBasedTypeInterface) {
+            if (!true) {
                 continue;
             }

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Repository.php:171:13
 
         foreach ($this->_schema as $key => $type) {
             $model_type = $type;
-            if (!$type instanceof SqlBasedTypeInterface) {
+            if (!false) {
                 continue;
             }

[NoCoverage] Continue_
Adebipe/ORM/Model/Repository.php:172:17
         foreach ($this->_schema as $key => $type) {
             $model_type = $type;
             if (!$type instanceof SqlBasedTypeInterface) {
-                continue;
+                break;
             }
             if (!$model_type->canBeNull() && $object->$key === null) {

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:174:13
             if (!$type instanceof SqlBasedTypeInterface) {
                 continue;
             }
-            if (!$model_type->canBeNull() && $object->$key === null) {
+            if (!$model_type->canBeNull() && $object->{$key} !== null) {
                 if ($key === 'created_at' || $key === 'updated_at') {
                     $keys[] = $key;

[NoCoverage] LogicalAndAllSubExprNegation
Adebipe/ORM/Model/Repository.php:174:13
             if (!$type instanceof SqlBasedTypeInterface) {
                 continue;
             }
-            if (!$model_type->canBeNull() && $object->$key === null) {
+            if ($model_type->canBeNull() && !($object->{$key} === null)) {
                 if ($key === 'created_at' || $key === 'updated_at') {
                     $keys[] = $key;

[NoCoverage] LogicalOrAllSubExprNegation
Adebipe/ORM/Model/Repository.php:175:17
                 continue;
             }
             if (!$model_type->canBeNull() && $object->$key === null) {
-                if ($key === 'created_at' || $key === 'updated_at') {
+                if (!($key === 'created_at') || !($key === 'updated_at')) {
                     $keys[] = $key;
                     $values[] = date("Y-m-d H:i:s");

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:175:17
                 continue;
             }
             if (!$model_type->canBeNull() && $object->$key === null) {
-                if ($key === 'created_at' || $key === 'updated_at') {
+                if ($key === 'created_at' || $key !== 'updated_at') {
                     $keys[] = $key;
                     $values[] = date("Y-m-d H:i:s");

[NoCoverage] Continue_
Adebipe/ORM/Model/Repository.php:179:21
                     $keys[] = $key;
                     $values[] = date("Y-m-d H:i:s");
                     $param_type[] = \PDO::PARAM_STR;
-                    continue;
+                    break;
                 }
                 if ($model_type->isAutoIncrement()) {

[NoCoverage] IfNegation
Adebipe/ORM/Model/Repository.php:181:17
                     $param_type[] = \PDO::PARAM_STR;
                     continue;
                 }
-                if ($model_type->isAutoIncrement()) {
-                    continue;
-                }
+                if (!$model_type->isAutoIncrement()) {
                 throw new \Exception("You can't save object with null value of $key");
             }

[NoCoverage] Continue_
Adebipe/ORM/Model/Repository.php:182:21
                     continue;
                 }
                 if ($model_type->isAutoIncrement()) {
-                    continue;
+                    break;
                 }
                 throw new \Exception("You can't save object with null value of $key");

[NoCoverage] Throw_
Adebipe/ORM/Model/Repository.php:184:17
                 if ($model_type->isAutoIncrement()) {
                     continue;
                 }
-                throw new \Exception("You can't save object with null value of $key");
+                new \Exception("You can't save object with null value of {$key}");
             }
             if ($model_type->canBeNull() && $object->$key === null) {

[NoCoverage] LogicalAndAllSubExprNegation
Adebipe/ORM/Model/Repository.php:186:13
                 }
                 throw new \Exception("You can't save object with null value of $key");
             }
-            if ($model_type->canBeNull() && $object->$key === null) {
+            if (!$model_type->canBeNull() && !($object->{$key} === null)) {
                 continue;
             }

[NoCoverage] LogicalAndNegation
Adebipe/ORM/Model/Repository.php:186:13
                 }
                 throw new \Exception("You can't save object with null value of $key");
             }
-            if ($model_type->canBeNull() && $object->$key === null) {
+            if (!($model_type->canBeNull() && $object->{$key} === null)) {
                 continue;
             }

[NoCoverage] Continue_
Adebipe/ORM/Model/Repository.php:187:17
                 throw new \Exception("You can't save object with null value of $key");
             }
             if ($model_type->canBeNull() && $object->$key === null) {
-                continue;
+                break;
             }
             $check_type = $model_type->checkType($object->$key);

[NoCoverage] FalseValue
Adebipe/ORM/Model/Repository.php:190:13
                 continue;
             }
             $check_type = $model_type->checkType($object->$key);
-            if ($check_type === false) {
+            if ($check_type === true) {
                 throw new \Exception("You can't save object with wrong type of $key");
             }

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:190:13
                 continue;
             }
             $check_type = $model_type->checkType($object->$key);
-            if ($check_type === false) {
+            if ($check_type !== false) {
                 throw new \Exception("You can't save object with wrong type of $key");
             }

[NoCoverage] Throw_
Adebipe/ORM/Model/Repository.php:191:17
             }
             $check_type = $model_type->checkType($object->$key);
             if ($check_type === false) {
-                throw new \Exception("You can't save object with wrong type of $key");
+                new \Exception("You can't save object with wrong type of {$key}");
             }
             if ($check_type === null) {

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:193:13
             if ($check_type === false) {
                 throw new \Exception("You can't save object with wrong type of $key");
             }
-            if ($check_type === null) {
+            if ($check_type !== null) {
                 continue;
             }

[NoCoverage] Continue_
Adebipe/ORM/Model/Repository.php:194:17
                 throw new \Exception("You can't save object with wrong type of $key");
             }
             if ($check_type === null) {
-                continue;
+                break;
             }
             if ($key === 'updated_at') {

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:196:13
             if ($check_type === null) {
                 continue;
             }
-            if ($key === 'updated_at') {
+            if ($key !== 'updated_at') {
                 $keys[] = $key;
                 $values[] = date("Y-m-d H:i:s");

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:207:9
             $param_type[] = $model_type->getPDOParamType();
         }
 
-        $sql = "INSERT INTO " . $this->_table_name;
+        $sql = $this->_table_name;
         $sql .= " (";
         $sql .= implode(", ", $keys);

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:207:9
             $param_type[] = $model_type->getPDOParamType();
         }
 
-        $sql = "INSERT INTO " . $this->_table_name;
+        $sql = "INSERT INTO ";
         $sql .= " (";
         $sql .= implode(", ", $keys);

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:208:9
         }
 
         $sql = "INSERT INTO " . $this->_table_name;
-        $sql .= " (";
+        $sql = " (";
         $sql .= implode(", ", $keys);
         $sql .= ") VALUES (";

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:209:9
 
         $sql = "INSERT INTO " . $this->_table_name;
         $sql .= " (";
-        $sql .= implode(", ", $keys);
+        $sql = implode(", ", $keys);
         $sql .= ") VALUES (";
         $sql .= implode(", ", array_fill(0, count($keys), "?"));

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:210:9
         $sql = "INSERT INTO " . $this->_table_name;
         $sql .= " (";
         $sql .= implode(", ", $keys);
-        $sql .= ") VALUES (";
+        $sql = ") VALUES (";
         $sql .= implode(", ", array_fill(0, count($keys), "?"));
         $sql .= ") ON DUPLICATE KEY UPDATE ";

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:211:9
         $sql .= " (";
         $sql .= implode(", ", $keys);
         $sql .= ") VALUES (";
-        $sql .= implode(", ", array_fill(0, count($keys), "?"));
+        $sql = implode(", ", array_fill(0, count($keys), "?"));
         $sql .= ") ON DUPLICATE KEY UPDATE ";
         $sql .= implode(

[NoCoverage] DecrementInteger
Adebipe/ORM/Model/Repository.php:211:9
         $sql .= " (";
         $sql .= implode(", ", $keys);
         $sql .= ") VALUES (";
-        $sql .= implode(", ", array_fill(0, count($keys), "?"));
+        $sql .= implode(", ", array_fill(-1, count($keys), "?"));
         $sql .= ") ON DUPLICATE KEY UPDATE ";
         $sql .= implode(

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:212:9
         $sql .= implode(", ", $keys);
         $sql .= ") VALUES (";
         $sql .= implode(", ", array_fill(0, count($keys), "?"));
-        $sql .= ") ON DUPLICATE KEY UPDATE ";
+        $sql = ") ON DUPLICATE KEY UPDATE ";
         $sql .= implode(
             ", ",

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:213:9
         $sql .= ") VALUES (";
         $sql .= implode(", ", array_fill(0, count($keys), "?"));
         $sql .= ") ON DUPLICATE KEY UPDATE ";
-        $sql .= implode(
-            ", ",
-            array_map(
-                function ($key) {
-                    return "$key = VALUES($key)";
-                },
-                $keys
-            )
-        );
+        $sql = implode(", ", array_map(function ($key) {
         $result = $this->_msql->prepare($sql);
         $result = $this->_msql->execute($result, array_values($values));

[NoCoverage] UnwrapArrayValues
Adebipe/ORM/Model/Repository.php:223:9
             )
         );
         $result = $this->_msql->prepare($sql);
-        $result = $this->_msql->execute($result, array_values($values));
+        $result = $this->_msql->execute($result, $values);
         $succeed = $this->_msql->getLastQuerySuccess();
         if ($succeed === false) {

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:225:9
         $result = $this->_msql->prepare($sql);
         $result = $this->_msql->execute($result, array_values($values));
         $succeed = $this->_msql->getLastQuerySuccess();
-        if ($succeed === false) {
+        if ($succeed !== false) {
             return false;
         }

[NoCoverage] FalseValue
Adebipe/ORM/Model/Repository.php:225:9
         $result = $this->_msql->prepare($sql);
         $result = $this->_msql->execute($result, array_values($values));
         $succeed = $this->_msql->getLastQuerySuccess();
-        if ($succeed === false) {
+        if ($succeed === true) {
             return false;
         }

[NoCoverage] FalseValue
Adebipe/ORM/Model/Repository.php:226:13
         $result = $this->_msql->execute($result, array_values($values));
         $succeed = $this->_msql->getLastQuerySuccess();
         if ($succeed === false) {
-            return false;
+            return true;
         }
         $object = $this->findOneById($this->_msql->getLastInsertId());

[NoCoverage] PublicVisibility
Adebipe/ORM/Model/Repository.php:239:5
      *
      * @return bool
      */
-    public function delete(Model &$object): bool
+    protected function delete(Model &$object) : bool
     {
         if (!is_a($object, $this->_class_name)) {

[NoCoverage] Throw_
Adebipe/ORM/Model/Repository.php:242:13
     public function delete(Model &$object): bool
     {
         if (!is_a($object, $this->_class_name)) {
-            throw new \Exception(
-                "You can't delete object of class " .
-                    get_class($object) . " as " .
-                    $this->_class_name
-            );
+            new \Exception("You can't delete object of class " . get_class($object) . " as " . $this->_class_name);
         }
         foreach ($this->_schema as $key => $type) {

[NoCoverage] Concat
Adebipe/ORM/Model/Repository.php:243:17
     {
         if (!is_a($object, $this->_class_name)) {
             throw new \Exception(
-                "You can't delete object of class " .
-                    get_class($object) . " as " .
-                    $this->_class_name
+                throw new \Exception("You can't delete object of class " . get_class($object) . $this->_class_name . " as ");
             );
         }

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:243:17
     {
         if (!is_a($object, $this->_class_name)) {
             throw new \Exception(
-                "You can't delete object of class " .
-                    get_class($object) . " as " .
+                throw new \Exception("You can't delete object of class " . get_class($object) . $this->_class_name);
                     $this->_class_name
             );

[NoCoverage] Foreach_
Adebipe/ORM/Model/Repository.php:248:9
                     $this->_class_name
             );
         }
-        foreach ($this->_schema as $key => $type) {
-            if ($type instanceof SqlBasedTypeInterface) {
-                $type->updateDbOnDelete($this->_msql, $object->id);
-            }
-        }
+        foreach (array() as $key => $type) {
         $query = "DELETE FROM " . $this->_table_name . " WHERE id = ?";
         $result = $this->_msql->prepare($query);

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Repository.php:249:13
             );
         }
         foreach ($this->_schema as $key => $type) {
-            if ($type instanceof SqlBasedTypeInterface) {
+            if (true) {
                 $type->updateDbOnDelete($this->_msql, $object->id);
             }

[NoCoverage] InstanceOf_
Adebipe/ORM/Model/Repository.php:249:13
             );
         }
         foreach ($this->_schema as $key => $type) {
-            if ($type instanceof SqlBasedTypeInterface) {
+            if (false) {
                 $type->updateDbOnDelete($this->_msql, $object->id);
             }

[NoCoverage] MethodCallRemoval
Adebipe/ORM/Model/Repository.php:250:17
         }
         foreach ($this->_schema as $key => $type) {
             if ($type instanceof SqlBasedTypeInterface) {
-                $type->updateDbOnDelete($this->_msql, $object->id);
+                
             }
         }

[NoCoverage] Concat
Adebipe/ORM/Model/Repository.php:253:9
                 $type->updateDbOnDelete($this->_msql, $object->id);
             }
         }
-        $query = "DELETE FROM " . $this->_table_name . " WHERE id = ?";
+        $query = $this->_table_name . "DELETE FROM " . " WHERE id = ?";
         $result = $this->_msql->prepare($query);
         $result = $this->_msql->execute($result, [$object->id], [\PDO::PARAM_INT]);

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:253:9
                 $type->updateDbOnDelete($this->_msql, $object->id);
             }
         }
-        $query = "DELETE FROM " . $this->_table_name . " WHERE id = ?";
+        $query = "DELETE FROM " . " WHERE id = ?";
         $result = $this->_msql->prepare($query);
         $result = $this->_msql->execute($result, [$object->id], [\PDO::PARAM_INT]);

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:271:9
      */
     public function createTable(): array
     {
-        $query = "CREATE TABLE " . $this->_table_name . " (";
+        $query = $this->_table_name . " (";
         $for_now = [];
         $for_after = [];

[NoCoverage] Concat
Adebipe/ORM/Model/Repository.php:271:9
      */
     public function createTable(): array
     {
-        $query = "CREATE TABLE " . $this->_table_name . " (";
+        $query = $this->_table_name . "CREATE TABLE " . " (";
         $for_now = [];
         $for_after = [];

[NoCoverage] Foreach_
Adebipe/ORM/Model/Repository.php:274:9
         $query = "CREATE TABLE " . $this->_table_name . " (";
         $for_now = [];
         $for_after = [];
-        foreach ($this->_schema as $column_name => $column_type) {
-            $type = $column_type->getSqlCreationType();
-            $type_more_sql = $column_type->getMoreSql();
-            if (in_array("now", array_keys($type_more_sql))) {
-                $for_now = array_merge($for_now, $type_more_sql["now"]);
-            }
-            if (in_array("after", array_keys($type_more_sql))) {
-                $for_after = array_merge($for_after, $type_more_sql["after"]);
-            }
-            if ($type === null) {
-                continue;
-            }
-            $query .= $column_name . " " . $type . ', ';
-        }
+        foreach (array() as $column_name => $column_type) {
         $query .= 'PRIMARY KEY (id)';
         $query .= ')';

[NoCoverage] IfNegation
Adebipe/ORM/Model/Repository.php:277:13
         foreach ($this->_schema as $column_name => $column_type) {
             $type = $column_type->getSqlCreationType();
             $type_more_sql = $column_type->getMoreSql();
-            if (in_array("now", array_keys($type_more_sql))) {
-                $for_now = array_merge($for_now, $type_more_sql["now"]);
-            }
+            if (!in_array("now", array_keys($type_more_sql))) {
             if (in_array("after", array_keys($type_more_sql))) {
                 $for_after = array_merge($for_after, $type_more_sql["after"]);

[NoCoverage] UnwrapArrayMerge
Adebipe/ORM/Model/Repository.php:278:17
             $type = $column_type->getSqlCreationType();
             $type_more_sql = $column_type->getMoreSql();
             if (in_array("now", array_keys($type_more_sql))) {
-                $for_now = array_merge($for_now, $type_more_sql["now"]);
+                $for_now = $type_more_sql["now"];
             }
             if (in_array("after", array_keys($type_more_sql))) {

[NoCoverage] UnwrapArrayMerge
Adebipe/ORM/Model/Repository.php:278:17
             $type = $column_type->getSqlCreationType();
             $type_more_sql = $column_type->getMoreSql();
             if (in_array("now", array_keys($type_more_sql))) {
-                $for_now = array_merge($for_now, $type_more_sql["now"]);
+                $for_now = $for_now;
             }
             if (in_array("after", array_keys($type_more_sql))) {

[NoCoverage] IfNegation
Adebipe/ORM/Model/Repository.php:280:13
             if (in_array("now", array_keys($type_more_sql))) {
                 $for_now = array_merge($for_now, $type_more_sql["now"]);
             }
-            if (in_array("after", array_keys($type_more_sql))) {
-                $for_after = array_merge($for_after, $type_more_sql["after"]);
-            }
+            if (!in_array("after", array_keys($type_more_sql))) {
             if ($type === null) {
                 continue;

[NoCoverage] UnwrapArrayMerge
Adebipe/ORM/Model/Repository.php:281:17
                 $for_now = array_merge($for_now, $type_more_sql["now"]);
             }
             if (in_array("after", array_keys($type_more_sql))) {
-                $for_after = array_merge($for_after, $type_more_sql["after"]);
+                $for_after = $type_more_sql["after"];
             }
             if ($type === null) {

[NoCoverage] Identical
Adebipe/ORM/Model/Repository.php:283:13
             if (in_array("after", array_keys($type_more_sql))) {
                 $for_after = array_merge($for_after, $type_more_sql["after"]);
             }
-            if ($type === null) {
+            if ($type !== null) {
                 continue;
             }

[NoCoverage] Continue_
Adebipe/ORM/Model/Repository.php:284:17
                 $for_after = array_merge($for_after, $type_more_sql["after"]);
             }
             if ($type === null) {
-                continue;
+                break;
             }
             $query .= $column_name . " " . $type . ', ';

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:286:13
             if ($type === null) {
                 continue;
             }
-            $query .= $column_name . " " . $type . ', ';
+            $query = $column_name . " " . $type . ', ';
         }
         $query .= 'PRIMARY KEY (id)';

[NoCoverage] ConcatOperandRemoval
Adebipe/ORM/Model/Repository.php:286:13
             if ($type === null) {
                 continue;
             }
-            $query .= $column_name . " " . $type . ', ';
+            $query .= " " . $type . ', ';
         }
         $query .= 'PRIMARY KEY (id)';

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:288:9
             }
             $query .= $column_name . " " . $type . ', ';
         }
-        $query .= 'PRIMARY KEY (id)';
+        $query = 'PRIMARY KEY (id)';
         $query .= ')';
         $result = $this->_msql->prepare($query);

[NoCoverage] Assignment
Adebipe/ORM/Model/Repository.php:289:9
             $query .= $column_name . " " . $type . ', ';
         }
         $query .= 'PRIMARY KEY (id)';
-        $query .= ')';
+        $query = ')';
         $result = $this->_msql->prepare($query);
         $this->_msql->execute($result);

[NoCoverage] MethodCallRemoval
Adebipe/ORM/Model/Repository.php:291:9
         $query .= 'PRIMARY KEY (id)';
         $query .= ')';
         $result = $this->_msql->prepare($query);
-        $this->_msql->execute($result);
+        
         foreach ($for_now as $sql) {
             $result = $this->_msql->prepare($sql);

[NoCoverage] Foreach_
Adebipe/ORM/Model/Repository.php:292:9
         $query .= ')';
         $result = $this->_msql->prepare($query);
         $this->_msql->execute($result);
-        foreach ($for_now as $sql) {
-            $result = $this->_msql->prepare($sql);
-            $this->_msql->execute($result);
-        }
+        foreach (array() as $sql) {
         return $for_after;
     }

[NoCoverage] MethodCallRemoval
Adebipe/ORM/Model/Repository.php:294:13
         $this->_msql->execute($result);
         foreach ($for_now as $sql) {
             $result = $this->_msql->prepare($sql);
-            $this->_msql->execute($result);
+            
         }
         return $for_after;
