[NoCoverage] PublicVisibility
Adebipe/ORM/ORM.php:32:5
      *
      * @return string
      */
-    public static function classToTableName(string $class_name): string
+    protected static function classToTableName(string $class_name) : string
     {
         return strtolower(substr($class_name, strrpos($class_name, '\\') + 1));

[NoCoverage] IncrementInteger
Adebipe/ORM/ORM.php:34:9
      */
     public static function classToTableName(string $class_name): string
     {
-        return strtolower(substr($class_name, strrpos($class_name, '\\') + 1));
+        return strtolower(substr($class_name, strrpos($class_name, '\\') + 2));
     }
 

[NoCoverage] UnwrapStrToLower
Adebipe/ORM/ORM.php:34:9
      */
     public static function classToTableName(string $class_name): string
     {
-        return strtolower(substr($class_name, strrpos($class_name, '\\') + 1));
+        return substr($class_name, strrpos($class_name, '\\') + 1);
     }
 

[NoCoverage] LogicalNot
Adebipe/ORM/ORM.php:46:9
      */
     public function atStart(MsQl $msql = null): void
     {
-        if (!$msql) {
+        if ($msql) {
             throw new \Exception("MsQl service not found");
         }

[NoCoverage] Throw_
Adebipe/ORM/ORM.php:47:13
     public function atStart(MsQl $msql = null): void
     {
         if (!$msql) {
-            throw new \Exception("MsQl service not found");
+            new \Exception("MsQl service not found");
         }
         $this->_msql = $msql;

[NoCoverage] LogicalNot
Adebipe/ORM/ORM.php:51:9
         }
         $this->_msql = $msql;
         $class_creator = Settings::getConfig("CORE.ORM.TABLE_MODELS");
-        if (!$class_creator) {
+        if ($class_creator) {
             throw new \Exception("TABLE_MODELS config not set");
         }

[NoCoverage] Throw_
Adebipe/ORM/ORM.php:52:13
         $this->_msql = $msql;
         $class_creator = Settings::getConfig("CORE.ORM.TABLE_MODELS");
         if (!$class_creator) {
-            throw new \Exception("TABLE_MODELS config not set");
+            new \Exception("TABLE_MODELS config not set");
         }
         if (!class_exists($class_creator)) {

[NoCoverage] LogicalNot
Adebipe/ORM/ORM.php:54:9
         if (!$class_creator) {
             throw new \Exception("TABLE_MODELS config not set");
         }
-        if (!class_exists($class_creator)) {
+        if (class_exists($class_creator)) {
             if (Settings::getEnvVariable('ENV') == 'build') {
                 return;

[NoCoverage] Equal
Adebipe/ORM/ORM.php:55:13
             throw new \Exception("TABLE_MODELS config not set");
         }
         if (!class_exists($class_creator)) {
-            if (Settings::getEnvVariable('ENV') == 'build') {
+            if (Settings::getEnvVariable('ENV') != 'build') {
                 return;
             }

[NoCoverage] InstanceOf_
Adebipe/ORM/ORM.php:60:9
             }
         }
         $class_init = new $class_creator();
-        if (!($class_init instanceof TableModel)) {
+        if (!true) {
             throw new \Exception("The class {$class_creator} must extends Model");
         }

[NoCoverage] LogicalNot
Adebipe/ORM/ORM.php:60:9
             }
         }
         $class_init = new $class_creator();
-        if (!($class_init instanceof TableModel)) {
+        if ($class_init instanceof TableModel) {
             throw new \Exception("The class {$class_creator} must extends Model");
         }

[NoCoverage] Throw_
Adebipe/ORM/ORM.php:61:13
         }
         $class_init = new $class_creator();
         if (!($class_init instanceof TableModel)) {
-            throw new \Exception("The class {$class_creator} must extends Model");
+            new \Exception("The class {$class_creator} must extends Model");
         }
         $all_schema = $class_init->getSchema();

[NoCoverage] Foreach_
Adebipe/ORM/ORM.php:64:9
             throw new \Exception("The class {$class_creator} must extends Model");
         }
         $all_schema = $class_init->getSchema();
-        foreach ($all_schema as $table_name => $object_class) {
-            $repository = $object_class::$repository;
-            $this->_repository[$table_name] = new $repository($object_class, $this->_msql);
-        }
+        foreach (array() as $table_name => $object_class) {
         Model::$msql = $this->_msql;
     }

[NoCoverage] PublicVisibility
Adebipe/ORM/ORM.php:96:5
      *
      * @return array<Repository>
      */
-    public function getRepositories(): array
+    protected function getRepositories() : array
     {
         return $this->_repository;

[NoCoverage] PublicVisibility
Adebipe/ORM/ORM.php:108:5
      *
      * @return Repository
      */
-    public function getRepository(string $object_class): Repository
+    protected function getRepository(string $object_class) : Repository
     {
         return $this->_repository[$object_class];

[NoCoverage] PublicVisibility
Adebipe/ORM/ORM.php:119:5
      *
      * @return void
      */
-    public function update(): void
+    protected function update() : void
     {
         $already_existed = $this->_msql->getTable();

[NoCoverage] Foreach_
Adebipe/ORM/ORM.php:123:9
     {
         $already_existed = $this->_msql->getTable();
         $already_table_name = array();
-        foreach ($already_existed as $table) {
-            $already_table_name[] = $table['TABLE_NAME'];
-        }
+        foreach (array() as $table) {
         $class_creator = Settings::getConfig("CORE.ORM.TABLE_MODELS");
         $class_init = new $class_creator();

[NoCoverage] InstanceOf_
Adebipe/ORM/ORM.php:128:9
         }
         $class_creator = Settings::getConfig("CORE.ORM.TABLE_MODELS");
         $class_init = new $class_creator();
-        if (!($class_init instanceof ORMTableCreator)) {
+        if (!false) {
             throw new \Exception("The class $class_creator must extends ORMTableCreator");
         }

[NoCoverage] LogicalNot
Adebipe/ORM/ORM.php:128:9
         }
         $class_creator = Settings::getConfig("CORE.ORM.TABLE_MODELS");
         $class_init = new $class_creator();
-        if (!($class_init instanceof ORMTableCreator)) {
+        if ($class_init instanceof ORMTableCreator) {
             throw new \Exception("The class $class_creator must extends ORMTableCreator");
         }

[NoCoverage] Throw_
Adebipe/ORM/ORM.php:129:13
         $class_creator = Settings::getConfig("CORE.ORM.TABLE_MODELS");
         $class_init = new $class_creator();
         if (!($class_init instanceof ORMTableCreator)) {
-            throw new \Exception("The class $class_creator must extends ORMTableCreator");
+            new \Exception("The class {$class_creator} must extends ORMTableCreator");
         }
         $fixtures = $class_init->getFixtures();

[NoCoverage] Foreach_
Adebipe/ORM/ORM.php:132:9
             throw new \Exception("The class $class_creator must extends ORMTableCreator");
         }
         $fixtures = $class_init->getFixtures();
-        foreach ($this->_repository as $table_name => $repository) {
-            if (!in_array($table_name, $already_table_name)) {
-                $repository->createTable();
-                if (array_key_exists($table_name, $fixtures)) {
-                    foreach ($fixtures[$table_name] as $fixture) {
-                        $object = $repository->getObjectClass($fixture);
-                        $repository->save($object);
-                    }
-                }
-            }
-        }
+        foreach (array() as $table_name => $repository) {
     }
 }

[NoCoverage] LogicalNot
Adebipe/ORM/ORM.php:133:13
         }
         $fixtures = $class_init->getFixtures();
         foreach ($this->_repository as $table_name => $repository) {
-            if (!in_array($table_name, $already_table_name)) {
+            if (in_array($table_name, $already_table_name)) {
                 $repository->createTable();
                 if (array_key_exists($table_name, $fixtures)) {

[NoCoverage] MethodCallRemoval
Adebipe/ORM/ORM.php:134:17
         $fixtures = $class_init->getFixtures();
         foreach ($this->_repository as $table_name => $repository) {
             if (!in_array($table_name, $already_table_name)) {
-                $repository->createTable();
+                
                 if (array_key_exists($table_name, $fixtures)) {
                     foreach ($fixtures[$table_name] as $fixture) {

[NoCoverage] IfNegation
Adebipe/ORM/ORM.php:135:17
         foreach ($this->_repository as $table_name => $repository) {
             if (!in_array($table_name, $already_table_name)) {
                 $repository->createTable();
-                if (array_key_exists($table_name, $fixtures)) {
-                    foreach ($fixtures[$table_name] as $fixture) {
-                        $object = $repository->getObjectClass($fixture);
-                        $repository->save($object);
-                    }
-                }
+                if (!array_key_exists($table_name, $fixtures)) {
             }
         }

[NoCoverage] Foreach_
Adebipe/ORM/ORM.php:136:21
             if (!in_array($table_name, $already_table_name)) {
                 $repository->createTable();
                 if (array_key_exists($table_name, $fixtures)) {
-                    foreach ($fixtures[$table_name] as $fixture) {
-                        $object = $repository->getObjectClass($fixture);
-                        $repository->save($object);
-                    }
+                    foreach (array() as $fixture) {
                 }
             }

[NoCoverage] MethodCallRemoval
Adebipe/ORM/ORM.php:138:25
                 if (array_key_exists($table_name, $fixtures)) {
                     foreach ($fixtures[$table_name] as $fixture) {
                         $object = $repository->getObjectClass($fixture);
-                        $repository->save($object);
+                        
                     }
                 }
