[NoCoverage] ConcatOperandRemoval
Adebipe/Renderer/Renderer.php:22:9
      */
     public function __construct()
     {
-        $this->_dir = Settings::getConfig('DIR') . Settings::getConfig('CORE.RENDERER.VIEW_DIR');
+        $this->_dir = Settings::getConfig('CORE.RENDERER.VIEW_DIR');
     }
 

[NoCoverage] Concat
Adebipe/Renderer/Renderer.php:22:9
      */
     public function __construct()
     {
-        $this->_dir = Settings::getConfig('DIR') . Settings::getConfig('CORE.RENDERER.VIEW_DIR');
+        $this->_dir = Settings::getConfig('CORE.RENDERER.VIEW_DIR') . Settings::getConfig('DIR');
     }
 

[NoCoverage] PublicVisibility
Adebipe/Renderer/Renderer.php:33:5
      *
      * @return Response
      */
-    public function render(string $path, array $environements): Response
+    protected function render(string $path, array $environements) : Response
     {
         $result = 200;

[NoCoverage] IncrementInteger
Adebipe/Renderer/Renderer.php:35:9
      */
     public function render(string $path, array $environements): Response
     {
-        $result = 200;
+        $result = 201;
         try {
             $body = $this->_getTemplate($path, $environements);

[NoCoverage] DecrementInteger
Adebipe/Renderer/Renderer.php:35:9
      */
     public function render(string $path, array $environements): Response
     {
-        $result = 200;
+        $result = 199;
         try {
             $body = $this->_getTemplate($path, $environements);

[NoCoverage] DecrementInteger
Adebipe/Renderer/Renderer.php:39:13
         try {
             $body = $this->_getTemplate($path, $environements);
         } catch (\Throwable $th) {
-            $result = 500;
+            $result = 499;
             $body = $th->getMessage();
         }

[NoCoverage] IncrementInteger
Adebipe/Renderer/Renderer.php:39:13
         try {
             $body = $this->_getTemplate($path, $environements);
         } catch (\Throwable $th) {
-            $result = 500;
+            $result = 501;
             $body = $th->getMessage();
         }

[NoCoverage] FunctionCallRemoval
Adebipe/Renderer/Renderer.php:55:9
      */
     private function _getTemplate(string $path, array $environements): string
     {
-        extract($environements);
+        
         ob_start();
         include $this->_dir . $path;

[NoCoverage] FunctionCallRemoval
Adebipe/Renderer/Renderer.php:56:9
     private function _getTemplate(string $path, array $environements): string
     {
         extract($environements);
-        ob_start();
+        
         include $this->_dir . $path;
         return ob_get_clean() ?: '';

[NoCoverage] Concat
Adebipe/Renderer/Renderer.php:57:9
     {
         extract($environements);
         ob_start();
-        include $this->_dir . $path;
+        include $path . $this->_dir;
         return ob_get_clean() ?: '';
     }

[NoCoverage] ConcatOperandRemoval
Adebipe/Renderer/Renderer.php:57:9
     {
         extract($environements);
         ob_start();
-        include $this->_dir . $path;
+        include $this->_dir;
         return ob_get_clean() ?: '';
     }

[NoCoverage] Ternary
Adebipe/Renderer/Renderer.php:58:9
         extract($environements);
         ob_start();
         include $this->_dir . $path;
-        return ob_get_clean() ?: '';
+        return ob_get_clean() ? '' : ob_get_clean();
     }
 }
