[NoCoverage] IfNegation
Adebipe/Router/Request.php:103:9
          */
         public array $router_params = []
     ) {
-        if (self::_isJson($this->body)) {
-            $data = json_decode($this->body, true);
-            $this->post = array_merge($this->post, $data);
-        }
+        if (!self::_isJson($this->body)) {
     }
 

[NoCoverage] UnwrapArrayMerge
Adebipe/Router/Request.php:105:13
     ) {
         if (self::_isJson($this->body)) {
             $data = json_decode($this->body, true);
-            $this->post = array_merge($this->post, $data);
+            $this->post = $this->post;
         }
     }

[NoCoverage] PublicVisibility
Adebipe/Router/Request.php:117:5
      *
      * @return int
      */
-    public function getIntGet(string $key, int $default = 0): int
+    protected function getIntGet(string $key, int $default = 0) : int
     {
         if (!isset($this->get[$key])) {

[NoCoverage] DecrementInteger
Adebipe/Router/Request.php:117:5
      *
      * @return int
      */
-    public function getIntGet(string $key, int $default = 0): int
+    public function getIntGet(string $key, int $default = -1) : int
     {
         if (!isset($this->get[$key])) {

[NoCoverage] LogicalNot
Adebipe/Router/Request.php:119:9
      */
     public function getIntGet(string $key, int $default = 0): int
     {
-        if (!isset($this->get[$key])) {
+        if (isset($this->get[$key])) {
             return $default;
         }

[NoCoverage] LogicalNot
Adebipe/Router/Request.php:122:9
         if (!isset($this->get[$key])) {
             return $default;
         }
-        if (!is_numeric($this->get[$key])) {
+        if (is_numeric($this->get[$key])) {
             return $default;
         }

[NoCoverage] PublicVisibility
Adebipe/Router/Request.php:137:5
      *
      * @return bool
      */
-    public function validatePost(array $schema): bool
+    protected function validatePost(array $schema) : bool
     {
         foreach ($schema as $key => $type) {

[NoCoverage] Foreach_
Adebipe/Router/Request.php:139:9
      */
     public function validatePost(array $schema): bool
     {
-        foreach ($schema as $key => $type) {
-            if (strpos($type, '?') !== false) {
-                continue;
-            }
-            if (!isset($this->post[$key])) {
-                return false;
-            }
-            if (get_debug_type($this->post[$key]) !== $type) {
-                return false;
-            }
-        }
+        foreach (array() as $key => $type) {
         return true;
     }

[NoCoverage] NotIdentical
Adebipe/Router/Request.php:140:13
     public function validatePost(array $schema): bool
     {
         foreach ($schema as $key => $type) {
-            if (strpos($type, '?') !== false) {
+            if (strpos($type, '?') === false) {
                 continue;
             }

[NoCoverage] FalseValue
Adebipe/Router/Request.php:140:13
     public function validatePost(array $schema): bool
     {
         foreach ($schema as $key => $type) {
-            if (strpos($type, '?') !== false) {
+            if (strpos($type, '?') !== true) {
                 continue;
             }

[NoCoverage] Continue_
Adebipe/Router/Request.php:141:17
     {
         foreach ($schema as $key => $type) {
             if (strpos($type, '?') !== false) {
-                continue;
+                break;
             }
             if (!isset($this->post[$key])) {

[NoCoverage] LogicalNot
Adebipe/Router/Request.php:143:13
             if (strpos($type, '?') !== false) {
                 continue;
             }
-            if (!isset($this->post[$key])) {
+            if (isset($this->post[$key])) {
                 return false;
             }

[NoCoverage] FalseValue
Adebipe/Router/Request.php:144:17
                 continue;
             }
             if (!isset($this->post[$key])) {
-                return false;
+                return true;
             }
             if (get_debug_type($this->post[$key]) !== $type) {

[NoCoverage] NotIdentical
Adebipe/Router/Request.php:146:13
             if (!isset($this->post[$key])) {
                 return false;
             }
-            if (get_debug_type($this->post[$key]) !== $type) {
+            if (get_debug_type($this->post[$key]) === $type) {
                 return false;
             }

[NoCoverage] FalseValue
Adebipe/Router/Request.php:147:17
                 return false;
             }
             if (get_debug_type($this->post[$key]) !== $type) {
-                return false;
+                return true;
             }
         }

[NoCoverage] FunctionCallRemoval
Adebipe/Router/Request.php:162:9
      */
     private static function _isJson($string): bool
     {
-        json_decode($string);
+        
         return json_last_error() === JSON_ERROR_NONE;
     }

[NoCoverage] Identical
Adebipe/Router/Request.php:163:9
     private static function _isJson($string): bool
     {
         json_decode($string);
-        return json_last_error() === JSON_ERROR_NONE;
+        return json_last_error() !== JSON_ERROR_NONE;
     }
 }
