[NoCoverage] IncrementInteger
Adebipe/Router/Response/JsonResponse.php:31:9
          *
          * @var int
          */
-        int $status = 200,
+        int $status = 201,
         /**
          * Headers of the response

[NoCoverage] DecrementInteger
Adebipe/Router/Response/JsonResponse.php:31:9
          *
          * @var int
          */
-        int $status = 200,
+        int $status = 199,
         /**
          * Headers of the response

[NoCoverage] MethodCallRemoval
Adebipe/Router/Response/JsonResponse.php:40:9
         array $headers = []
     ) {
         $headers['Content-Type'] = 'application/json';
-        parent::__construct(json_encode($body) ?: "[]", $status, $headers);
+        
     }
 }

[NoCoverage] Ternary
Adebipe/Router/Response/JsonResponse.php:40:9
         array $headers = []
     ) {
         $headers['Content-Type'] = 'application/json';
-        parent::__construct(json_encode($body) ?: "[]", $status, $headers);
+        parent::__construct(json_encode($body) ? "[]" : json_encode($body), $status, $headers);
     }
 }
