[NoCoverage] DecrementInteger
Adebipe/Router/Response/Response.php:31:9
          *
          * @var int
          */
-        public int $status = 200,
+        public int $status = 199,
         /**
          * Headers of the response

[NoCoverage] IncrementInteger
Adebipe/Router/Response/Response.php:31:9
          *
          * @var int
          */
-        public int $status = 200,
+        public int $status = 201,
         /**
          * Headers of the response

[NoCoverage] PublicVisibility
Adebipe/Router/Response/Response.php:46:5
      *
      * @return void
      */
-    public function send()
+    protected function send()
     {
         http_response_code($this->status);

[NoCoverage] FunctionCallRemoval
Adebipe/Router/Response/Response.php:48:9
      */
     public function send()
     {
-        http_response_code($this->status);
+        
         foreach ($this->headers as $key => $value) {
             header("$key: $value");

[NoCoverage] Foreach_
Adebipe/Router/Response/Response.php:49:9
     public function send()
     {
         http_response_code($this->status);
-        foreach ($this->headers as $key => $value) {
-            header("$key: $value");
-        }
+        foreach (array() as $key => $value) {
         echo $this->body;
         http_response_code($this->status);

[NoCoverage] FunctionCallRemoval
Adebipe/Router/Response/Response.php:50:13
     {
         http_response_code($this->status);
         foreach ($this->headers as $key => $value) {
-            header("$key: $value");
+            
         }
         echo $this->body;

[NoCoverage] FunctionCallRemoval
Adebipe/Router/Response/Response.php:53:9
             header("$key: $value");
         }
         echo $this->body;
-        http_response_code($this->status);
+        
     }
 }
