[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:61:5
      *
      * @return void
      */
-    public function addRoute(string $path, string $method, ReflectionMethod $function, string $route): void
+    protected function addRoute(string $path, string $method, ReflectionMethod $function, string $route) : void
     {
         $this->_routes[$route][$method] = [$function, $path];

[NoCoverage] ArrayItemRemoval
Adebipe/Router/RouteKeeper.php:63:9
      */
     public function addRoute(string $path, string $method, ReflectionMethod $function, string $route): void
     {
-        $this->_routes[$route][$method] = [$function, $path];
+        $this->_routes[$route][$method] = [$path];
     }
 

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:74:5
      *
      * @return void
      */
-    public function deleteRoute(string $path, string $method): void
+    protected function deleteRoute(string $path, string $method) : void
     {
         unset($this->_routes[$path][$method]);

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:84:5
      *
      * @return void
      */
-    public function deleteAllRoutes(): void
+    protected function deleteAllRoutes() : void
     {
         $this->_routes = [];

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:97:5
      *
      * @return bool
      */
-    public function routeAlreadyExist(string $path, string $method): bool
+    protected function routeAlreadyExist(string $path, string $method) : bool
     {
         return isset($this->_routes[$path]) && isset($this->_routes[$path][$method]);

[NoCoverage] LogicalAnd
Adebipe/Router/RouteKeeper.php:99:9
      */
     public function routeAlreadyExist(string $path, string $method): bool
     {
-        return isset($this->_routes[$path]) && isset($this->_routes[$path][$method]);
+        return isset($this->_routes[$path]) || isset($this->_routes[$path][$method]);
     }
 

[NoCoverage] LogicalAndAllSubExprNegation
Adebipe/Router/RouteKeeper.php:99:9
      */
     public function routeAlreadyExist(string $path, string $method): bool
     {
-        return isset($this->_routes[$path]) && isset($this->_routes[$path][$method]);
+        return !isset($this->_routes[$path]) && !isset($this->_routes[$path][$method]);
     }
 

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:107:5
      *
      * @return array
      */
-    public function getRoutes(): array
+    protected function getRoutes() : array
     {
         return $this->_routes;

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:119:5
      *
      * @return void
      */
-    public function updateRoutes(string $env_wanted = "???"): void
+    protected function updateRoutes(string $env_wanted = "???") : void
     {
         $this->deleteAllRoutes();

[NoCoverage] MethodCallRemoval
Adebipe/Router/RouteKeeper.php:121:9
      */
     public function updateRoutes(string $env_wanted = "???"): void
     {
-        $this->deleteAllRoutes();
+        
         foreach (get_declared_classes() as $class) {
             if (preg_match('/^App\\\\Components\\\\/', $class) === 0) {

[NoCoverage] Identical
Adebipe/Router/RouteKeeper.php:123:13
     {
         $this->deleteAllRoutes();
         foreach (get_declared_classes() as $class) {
-            if (preg_match('/^App\\\\Components\\\\/', $class) === 0) {
+            if (preg_match('/^App\\\\Components\\\\/', $class) !== 0) {
                 // Don't check the class if it's not a component
                 continue;

[NoCoverage] PregMatchRemoveCaret
Adebipe/Router/RouteKeeper.php:123:13
     {
         $this->deleteAllRoutes();
         foreach (get_declared_classes() as $class) {
-            if (preg_match('/^App\\\\Components\\\\/', $class) === 0) {
+            if (preg_match('/App\\\\Components\\\\/', $class) === 0) {
                 // Don't check the class if it's not a component
                 continue;

[NoCoverage] Continue_
Adebipe/Router/RouteKeeper.php:125:17
         foreach (get_declared_classes() as $class) {
             if (preg_match('/^App\\\\Components\\\\/', $class) === 0) {
                 // Don't check the class if it's not a component
-                continue;
+                break;
             }
             $reflection = new \ReflectionClass($class);

[NoCoverage] LogicalNot
Adebipe/Router/RouteKeeper.php:131:17
             $methods = $reflection->getMethods(\ReflectionMethod::IS_PUBLIC);
             // Check all public methods
             foreach ($methods as $method) {
-                if (!$method->isStatic()) {
+                if ($method->isStatic()) {
                     throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' is not static');
                 }

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:132:21
             // Check all public methods
             foreach ($methods as $method) {
                 if (!$method->isStatic()) {
-                    throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' is not static');
+                    throw new \Exception($method->getName() . 'Method ' . ' in class ' . $class . ' is not static');
                 }
                 $attributes = $method->getAttributes(Route::class);

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:132:21
             // Check all public methods
             foreach ($methods as $method) {
                 if (!$method->isStatic()) {
-                    throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' is not static');
+                    throw new \Exception('Method ' . $method->getName() . ' in class ' . ' is not static' . $class);
                 }
                 $attributes = $method->getAttributes(Route::class);

[NoCoverage] Identical
Adebipe/Router/RouteKeeper.php:136:17
                 }
                 $attributes = $method->getAttributes(Route::class);
                 // Check if the method has a route
-                if (count($attributes) === 0) {
+                if (count($attributes) !== 0) {
                     throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' has no route');
                 }

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:137:21
                 $attributes = $method->getAttributes(Route::class);
                 // Check if the method has a route
                 if (count($attributes) === 0) {
-                    throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' has no route');
+                    throw new \Exception('Method ' . $method->getName() . ' in class ' . ' has no route' . $class);
                 }
                 $route = $attributes[0]->newInstance();

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:137:21
                 $attributes = $method->getAttributes(Route::class);
                 // Check if the method has a route
                 if (count($attributes) === 0) {
-                    throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' has no route');
+                    throw new \Exception('Method ' . $method->getName() . ' in class ' . ' has no route');
                 }
                 $route = $attributes[0]->newInstance();

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:139:17
                 if (count($attributes) === 0) {
                     throw new \Exception('Method ' . $method->getName() . ' in class ' . $class . ' has no route');
                 }
-                $route = $attributes[0]->newInstance();
+                $route = $attributes[1]->newInstance();
                 // Check if the route already exists
                 if ($this->routeAlreadyExist($route->path, $route->method)) {

[NoCoverage] IfNegation
Adebipe/Router/RouteKeeper.php:141:17
                 }
                 $route = $attributes[0]->newInstance();
                 // Check if the route already exists
-                if ($this->routeAlreadyExist($route->path, $route->method)) {
-                    throw new \Exception(
-                        'Route ' . $route->path . ' with method ' .
-                            $route->method . ' already exists'
-                    );
-                }
+                if (!$this->routeAlreadyExist($route->path, $route->method)) {
                 if ($env_wanted !== "???" && $route->env !== $env_wanted) {
                     continue;

[NoCoverage] Throw_
Adebipe/Router/RouteKeeper.php:142:21
                 $route = $attributes[0]->newInstance();
                 // Check if the route already exists
                 if ($this->routeAlreadyExist($route->path, $route->method)) {
-                    throw new \Exception(
-                        'Route ' . $route->path . ' with method ' .
-                            $route->method . ' already exists'
-                    );
+                    new \Exception('Route ' . $route->path . ' with method ' . $route->method . ' already exists');
                 }
                 if ($env_wanted !== "???" && $route->env !== $env_wanted) {

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:143:25
                 // Check if the route already exists
                 if ($this->routeAlreadyExist($route->path, $route->method)) {
                     throw new \Exception(
-                        'Route ' . $route->path . ' with method ' .
-                            $route->method . ' already exists'
+                        throw new \Exception('Route ' . $route->path . $route->method . ' with method ' . ' already exists');
                     );
                 }

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:143:25
                 // Check if the route already exists
                 if ($this->routeAlreadyExist($route->path, $route->method)) {
                     throw new \Exception(
-                        'Route ' . $route->path . ' with method ' .
-                            $route->method . ' already exists'
+                        throw new \Exception('Route ' . $route->path . ' with method ' . $route->method);
                     );
                 }

[NoCoverage] LogicalAndAllSubExprNegation
Adebipe/Router/RouteKeeper.php:147:17
                             $route->method . ' already exists'
                     );
                 }
-                if ($env_wanted !== "???" && $route->env !== $env_wanted) {
+                if (!($env_wanted !== "???") && !($route->env !== $env_wanted)) {
                     continue;
                 }

[NoCoverage] NotIdentical
Adebipe/Router/RouteKeeper.php:147:17
                             $route->method . ' already exists'
                     );
                 }
-                if ($env_wanted !== "???" && $route->env !== $env_wanted) {
+                if ($env_wanted !== "???" && $route->env === $env_wanted) {
                     continue;
                 }

[NoCoverage] Continue_
Adebipe/Router/RouteKeeper.php:148:21
                     );
                 }
                 if ($env_wanted !== "???" && $route->env !== $env_wanted) {
-                    continue;
+                    break;
                 }
                 $regex_decoded = $route->path;

[NoCoverage] NotIdentical
Adebipe/Router/RouteKeeper.php:151:17
                     continue;
                 }
                 $regex_decoded = $route->path;
-                if ($route->regex !== null) {
+                if ($route->regex === null) {
                     foreach ($route->regex as $param => $regex) {
                         if ($regex::class == RegexSimple::class) {

[NoCoverage] Foreach_
Adebipe/Router/RouteKeeper.php:152:21
                 }
                 $regex_decoded = $route->path;
                 if ($route->regex !== null) {
-                    foreach ($route->regex as $param => $regex) {
-                        if ($regex::class == RegexSimple::class) {
-                            $regex = $regex->value;
-                        }
-                        $regex_decoded = str_replace('{' . $param . '}', '(' . $regex . ')', $regex_decoded);
-                        $regex_decoded = str_replace('/', '\/', $regex_decoded);
-                        $regex_decoded = "/^" . $regex_decoded . "$/";
-                    }
+                    foreach (array() as $param => $regex) {
                 }
                 // Add the route

[NoCoverage] Equal
Adebipe/Router/RouteKeeper.php:153:25
                 $regex_decoded = $route->path;
                 if ($route->regex !== null) {
                     foreach ($route->regex as $param => $regex) {
-                        if ($regex::class == RegexSimple::class) {
+                        if ($regex::class != RegexSimple::class) {
                             $regex = $regex->value;
                         }

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:156:25
                         if ($regex::class == RegexSimple::class) {
                             $regex = $regex->value;
                         }
-                        $regex_decoded = str_replace('{' . $param . '}', '(' . $regex . ')', $regex_decoded);
+                        $regex_decoded = str_replace('{' . $param . '}', $regex . '(' . ')', $regex_decoded);
                         $regex_decoded = str_replace('/', '\/', $regex_decoded);
                         $regex_decoded = "/^" . $regex_decoded . "$/";

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:156:25
                         if ($regex::class == RegexSimple::class) {
                             $regex = $regex->value;
                         }
-                        $regex_decoded = str_replace('{' . $param . '}', '(' . $regex . ')', $regex_decoded);
+                        $regex_decoded = str_replace('{' . $param . '}', '(' . ')', $regex_decoded);
                         $regex_decoded = str_replace('/', '\/', $regex_decoded);
                         $regex_decoded = "/^" . $regex_decoded . "$/";

[NoCoverage] UnwrapStrReplace
Adebipe/Router/RouteKeeper.php:157:25
                             $regex = $regex->value;
                         }
                         $regex_decoded = str_replace('{' . $param . '}', '(' . $regex . ')', $regex_decoded);
-                        $regex_decoded = str_replace('/', '\/', $regex_decoded);
+                        $regex_decoded = $regex_decoded;
                         $regex_decoded = "/^" . $regex_decoded . "$/";
                     }

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:158:25
                         }
                         $regex_decoded = str_replace('{' . $param . '}', '(' . $regex . ')', $regex_decoded);
                         $regex_decoded = str_replace('/', '\/', $regex_decoded);
-                        $regex_decoded = "/^" . $regex_decoded . "$/";
+                        $regex_decoded = $regex_decoded . "\$/";
                     }
                 }

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:158:25
                         }
                         $regex_decoded = str_replace('{' . $param . '}', '(' . $regex . ')', $regex_decoded);
                         $regex_decoded = str_replace('/', '\/', $regex_decoded);
-                        $regex_decoded = "/^" . $regex_decoded . "$/";
+                        $regex_decoded = "/^" . "\$/";
                     }
                 }

[NoCoverage] MethodCallRemoval
Adebipe/Router/RouteKeeper.php:162:17
                     }
                 }
                 // Add the route
-                $this->addRoute($route->path, $route->method, $method, $regex_decoded);
+                
             }
         }

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:176:5
      *
      * @return array<string, mixed>
      */
-    public function performRegex(string $route, string $regex_route, string $uri): array
+    protected function performRegex(string $route, string $regex_route, string $uri) : array
     {
         $this->_logger->info('Perform regex for route: ' . $route);

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:178:9
      */
     public function performRegex(string $route, string $regex_route, string $uri): array
     {
-        $this->_logger->info('Perform regex for route: ' . $route);
+        $this->_logger->info($route . 'Perform regex for route: ');
 
         $to_inject = [];

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:178:9
      */
     public function performRegex(string $route, string $regex_route, string $uri): array
     {
-        $this->_logger->info('Perform regex for route: ' . $route);
+        $this->_logger->info($route);
 
         $to_inject = [];

[NoCoverage] FunctionCallRemoval
Adebipe/Router/RouteKeeper.php:182:9
 
         $to_inject = [];
 
-        preg_match_all('/\{([a-zA-Z0-9_]+)\}/', $route, $matches);
+        
         $id = $matches[0];
         $this->_logger->info('Get id: ' . json_encode($id));

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:183:9
         $to_inject = [];
 
         preg_match_all('/\{([a-zA-Z0-9_]+)\}/', $route, $matches);
-        $id = $matches[0];
+        $id = $matches[1];
         $this->_logger->info('Get id: ' . json_encode($id));
         preg_match($regex_route, $uri, $matches);

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:184:9
 
         preg_match_all('/\{([a-zA-Z0-9_]+)\}/', $route, $matches);
         $id = $matches[0];
-        $this->_logger->info('Get id: ' . json_encode($id));
+        $this->_logger->info('Get id: ');
         preg_match($regex_route, $uri, $matches);
         $this->_logger->info('Get matches: ' . json_encode($matches));

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:184:9
 
         preg_match_all('/\{([a-zA-Z0-9_]+)\}/', $route, $matches);
         $id = $matches[0];
-        $this->_logger->info('Get id: ' . json_encode($id));
+        $this->_logger->info(json_encode($id));
         preg_match($regex_route, $uri, $matches);
         $this->_logger->info('Get matches: ' . json_encode($matches));

[NoCoverage] PregMatchMatches
Adebipe/Router/RouteKeeper.php:185:9
         preg_match_all('/\{([a-zA-Z0-9_]+)\}/', $route, $matches);
         $id = $matches[0];
         $this->_logger->info('Get id: ' . json_encode($id));
-        preg_match($regex_route, $uri, $matches);
+        (int) ($matches = array());
         $this->_logger->info('Get matches: ' . json_encode($matches));
 

[NoCoverage] FunctionCallRemoval
Adebipe/Router/RouteKeeper.php:185:9
         preg_match_all('/\{([a-zA-Z0-9_]+)\}/', $route, $matches);
         $id = $matches[0];
         $this->_logger->info('Get id: ' . json_encode($id));
-        preg_match($regex_route, $uri, $matches);
+        
         $this->_logger->info('Get matches: ' . json_encode($matches));
 

[NoCoverage] Concat
Adebipe/Router/RouteKeeper.php:186:9
         $id = $matches[0];
         $this->_logger->info('Get id: ' . json_encode($id));
         preg_match($regex_route, $uri, $matches);
-        $this->_logger->info('Get matches: ' . json_encode($matches));
+        $this->_logger->info(json_encode($matches) . 'Get matches: ');
 
         for ($i = 0; $i < count($id); $i++) {

[NoCoverage] MethodCallRemoval
Adebipe/Router/RouteKeeper.php:186:9
         $id = $matches[0];
         $this->_logger->info('Get id: ' . json_encode($id));
         preg_match($regex_route, $uri, $matches);
-        $this->_logger->info('Get matches: ' . json_encode($matches));
+        
 
         for ($i = 0; $i < count($id); $i++) {

[NoCoverage] Increment
Adebipe/Router/RouteKeeper.php:188:9
         preg_match($regex_route, $uri, $matches);
         $this->_logger->info('Get matches: ' . json_encode($matches));
 
-        for ($i = 0; $i < count($id); $i++) {
+        for ($i = 0; $i < count($id); $i--) {
             $id_sub = substr($id[$i], 1, -1);
             $to_inject[$id_sub] = $matches[$i + 1];

[NoCoverage] LessThanNegotiation
Adebipe/Router/RouteKeeper.php:188:9
         preg_match($regex_route, $uri, $matches);
         $this->_logger->info('Get matches: ' . json_encode($matches));
 
-        for ($i = 0; $i < count($id); $i++) {
+        for ($i = 0; $i >= count($id); $i++) {
             $id_sub = substr($id[$i], 1, -1);
             $to_inject[$id_sub] = $matches[$i + 1];

[NoCoverage] UnwrapSubstr
Adebipe/Router/RouteKeeper.php:189:13
         $this->_logger->info('Get matches: ' . json_encode($matches));
 
         for ($i = 0; $i < count($id); $i++) {
-            $id_sub = substr($id[$i], 1, -1);
+            $id_sub = $id[$i];
             $to_inject[$id_sub] = $matches[$i + 1];
         }

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:189:13
         $this->_logger->info('Get matches: ' . json_encode($matches));
 
         for ($i = 0; $i < count($id); $i++) {
-            $id_sub = substr($id[$i], 1, -1);
+            $id_sub = substr($id[$i], 1, -2);
             $to_inject[$id_sub] = $matches[$i + 1];
         }

[NoCoverage] Plus
Adebipe/Router/RouteKeeper.php:190:13
 
         for ($i = 0; $i < count($id); $i++) {
             $id_sub = substr($id[$i], 1, -1);
-            $to_inject[$id_sub] = $matches[$i + 1];
+            $to_inject[$id_sub] = $matches[$i - 1];
         }
         $this->_logger->info('Get to inject: ' . json_encode($to_inject));

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:190:13
 
         for ($i = 0; $i < count($id); $i++) {
             $id_sub = substr($id[$i], 1, -1);
-            $to_inject[$id_sub] = $matches[$i + 1];
+            $to_inject[$id_sub] = $matches[$i + 0];
         }
         $this->_logger->info('Get to inject: ' . json_encode($to_inject));

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:192:9
             $id_sub = substr($id[$i], 1, -1);
             $to_inject[$id_sub] = $matches[$i + 1];
         }
-        $this->_logger->info('Get to inject: ' . json_encode($to_inject));
+        $this->_logger->info(json_encode($to_inject));
         return $to_inject;
     }

[NoCoverage] ConcatOperandRemoval
Adebipe/Router/RouteKeeper.php:192:9
             $id_sub = substr($id[$i], 1, -1);
             $to_inject[$id_sub] = $matches[$i + 1];
         }
-        $this->_logger->info('Get to inject: ' . json_encode($to_inject));
+        $this->_logger->info('Get to inject: ');
         return $to_inject;
     }

[NoCoverage] PublicVisibility
Adebipe/Router/RouteKeeper.php:204:5
      *
      * @return array|null [function, [regex_result]] or null or [string, string]
      */
-    public function findRoute(string $path, string $method): ?array
+    protected function findRoute(string $path, string $method) : ?array
     {
         if (isset($this->_routes[$path])) {

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:208:17
     {
         if (isset($this->_routes[$path])) {
             if (isset($this->_routes[$path][$method])) {
-                if (isset($this->_routes[$path][$method][0])) {
+                if (isset($this->_routes[$path][$method][1])) {
                     return [$this->_routes[$path][$method][0], []];
                 }

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:209:21
         if (isset($this->_routes[$path])) {
             if (isset($this->_routes[$path][$method])) {
                 if (isset($this->_routes[$path][$method][0])) {
-                    return [$this->_routes[$path][$method][0], []];
+                    return [$this->_routes[$path][$method][1], []];
                 }
                 return [500, "Internal server error"];

[NoCoverage] ArrayItemRemoval
Adebipe/Router/RouteKeeper.php:209:21
         if (isset($this->_routes[$path])) {
             if (isset($this->_routes[$path][$method])) {
                 if (isset($this->_routes[$path][$method][0])) {
-                    return [$this->_routes[$path][$method][0], []];
+                    return [[]];
                 }
                 return [500, "Internal server error"];

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:211:17
                 if (isset($this->_routes[$path][$method][0])) {
                     return [$this->_routes[$path][$method][0], []];
                 }
-                return [500, "Internal server error"];
+                return [501, "Internal server error"];
             }
             return [405, "Method not allowed"];

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:211:17
                 if (isset($this->_routes[$path][$method][0])) {
                     return [$this->_routes[$path][$method][0], []];
                 }
-                return [500, "Internal server error"];
+                return [499, "Internal server error"];
             }
             return [405, "Method not allowed"];

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:213:13
                 }
                 return [500, "Internal server error"];
             }
-            return [405, "Method not allowed"];
+            return [404, "Method not allowed"];
         }
         $route = null;

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:213:13
                 }
                 return [500, "Internal server error"];
             }
-            return [405, "Method not allowed"];
+            return [406, "Method not allowed"];
         }
         $route = null;

[NoCoverage] Foreach_
Adebipe/Router/RouteKeeper.php:218:9
         $route = null;
         $regex = [];
 
-        foreach ($this->_routes as $key => $value) {
-            if (preg_match('/^\/\^.*\$\/$/', $key) === 0) {
-                continue;
-            }
-            if (preg_match($key, $path)) {
-                $this->_logger->info('Regex match');
-                if (!isset($this->_routes[$key][$method])) {
-                    return [405, "Method not allowed"];
-                }
-                if (!isset($this->_routes[$key][$method][1])) {
-                    return [500, "Internal server error"];
-                }
-                $regex = $this->performRegex($value[$method][1], $key, $path);
-                $route = $key;
-                foreach ($regex as $key => $value) {
-                    $add_to_injector[$key] = $value;
-                }
-                break;
-            }
-        }
+        foreach (array() as $key => $value) {
 
         if ($route === null) {

[NoCoverage] Identical
Adebipe/Router/RouteKeeper.php:219:13
         $regex = [];
 
         foreach ($this->_routes as $key => $value) {
-            if (preg_match('/^\/\^.*\$\/$/', $key) === 0) {
+            if (preg_match('/^\\/\\^.*\\$\\/$/', $key) !== 0) {
                 continue;
             }

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:219:13
         $regex = [];
 
         foreach ($this->_routes as $key => $value) {
-            if (preg_match('/^\/\^.*\$\/$/', $key) === 0) {
+            if (preg_match('/^\\/\\^.*\\$\\/$/', $key) === -1) {
                 continue;
             }

[NoCoverage] Continue_
Adebipe/Router/RouteKeeper.php:220:17
 
         foreach ($this->_routes as $key => $value) {
             if (preg_match('/^\/\^.*\$\/$/', $key) === 0) {
-                continue;
+                break;
             }
             if (preg_match($key, $path)) {

[NoCoverage] IfNegation
Adebipe/Router/RouteKeeper.php:222:13
             if (preg_match('/^\/\^.*\$\/$/', $key) === 0) {
                 continue;
             }
-            if (preg_match($key, $path)) {
-                $this->_logger->info('Regex match');
-                if (!isset($this->_routes[$key][$method])) {
-                    return [405, "Method not allowed"];
-                }
-                if (!isset($this->_routes[$key][$method][1])) {
-                    return [500, "Internal server error"];
-                }
-                $regex = $this->performRegex($value[$method][1], $key, $path);
-                $route = $key;
-                foreach ($regex as $key => $value) {
-                    $add_to_injector[$key] = $value;
-                }
-                break;
-            }
+            if (!preg_match($key, $path)) {
         }
 

[NoCoverage] MethodCallRemoval
Adebipe/Router/RouteKeeper.php:223:17
                 continue;
             }
             if (preg_match($key, $path)) {
-                $this->_logger->info('Regex match');
+                
                 if (!isset($this->_routes[$key][$method])) {
                     return [405, "Method not allowed"];

[NoCoverage] LogicalNot
Adebipe/Router/RouteKeeper.php:224:17
             }
             if (preg_match($key, $path)) {
                 $this->_logger->info('Regex match');
-                if (!isset($this->_routes[$key][$method])) {
+                if (isset($this->_routes[$key][$method])) {
                     return [405, "Method not allowed"];
                 }

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:225:21
             if (preg_match($key, $path)) {
                 $this->_logger->info('Regex match');
                 if (!isset($this->_routes[$key][$method])) {
-                    return [405, "Method not allowed"];
+                    return [406, "Method not allowed"];
                 }
                 if (!isset($this->_routes[$key][$method][1])) {

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:225:21
             if (preg_match($key, $path)) {
                 $this->_logger->info('Regex match');
                 if (!isset($this->_routes[$key][$method])) {
-                    return [405, "Method not allowed"];
+                    return [404, "Method not allowed"];
                 }
                 if (!isset($this->_routes[$key][$method][1])) {
