[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:227:17
                 if (!isset($this->_routes[$key][$method])) {
                     return [405, "Method not allowed"];
                 }
-                if (!isset($this->_routes[$key][$method][1])) {
+                if (!isset($this->_routes[$key][$method][0])) {
                     return [500, "Internal server error"];
                 }

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:227:17
                 if (!isset($this->_routes[$key][$method])) {
                     return [405, "Method not allowed"];
                 }
-                if (!isset($this->_routes[$key][$method][1])) {
+                if (!isset($this->_routes[$key][$method][2])) {
                     return [500, "Internal server error"];
                 }

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:228:21
                     return [405, "Method not allowed"];
                 }
                 if (!isset($this->_routes[$key][$method][1])) {
-                    return [500, "Internal server error"];
+                    return [499, "Internal server error"];
                 }
                 $regex = $this->performRegex($value[$method][1], $key, $path);

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:228:21
                     return [405, "Method not allowed"];
                 }
                 if (!isset($this->_routes[$key][$method][1])) {
-                    return [500, "Internal server error"];
+                    return [501, "Internal server error"];
                 }
                 $regex = $this->performRegex($value[$method][1], $key, $path);

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:230:17
                 if (!isset($this->_routes[$key][$method][1])) {
                     return [500, "Internal server error"];
                 }
-                $regex = $this->performRegex($value[$method][1], $key, $path);
+                $regex = $this->performRegex($value[$method][0], $key, $path);
                 $route = $key;
                 foreach ($regex as $key => $value) {

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:230:17
                 if (!isset($this->_routes[$key][$method][1])) {
                     return [500, "Internal server error"];
                 }
-                $regex = $this->performRegex($value[$method][1], $key, $path);
+                $regex = $this->performRegex($value[$method][2], $key, $path);
                 $route = $key;
                 foreach ($regex as $key => $value) {

[NoCoverage] Foreach_
Adebipe/Router/RouteKeeper.php:232:17
                 }
                 $regex = $this->performRegex($value[$method][1], $key, $path);
                 $route = $key;
-                foreach ($regex as $key => $value) {
-                    $add_to_injector[$key] = $value;
-                }
+                foreach (array() as $key => $value) {
                 break;
             }

[NoCoverage] Break_
Adebipe/Router/RouteKeeper.php:235:17
                 foreach ($regex as $key => $value) {
                     $add_to_injector[$key] = $value;
                 }
-                break;
+                continue;
             }
         }

[NoCoverage] Identical
Adebipe/Router/RouteKeeper.php:239:9
             }
         }
 
-        if ($route === null) {
+        if ($route !== null) {
             $this->_logger->info('Route not found');
             return [404, "Not found"];

[NoCoverage] MethodCallRemoval
Adebipe/Router/RouteKeeper.php:240:13
         }
 
         if ($route === null) {
-            $this->_logger->info('Route not found');
+            
             return [404, "Not found"];
         }

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:241:13
 
         if ($route === null) {
             $this->_logger->info('Route not found');
-            return [404, "Not found"];
+            return [405, "Not found"];
         }
         return [$this->_routes[$route][$method][0], $regex];

[NoCoverage] DecrementInteger
Adebipe/Router/RouteKeeper.php:241:13
 
         if ($route === null) {
             $this->_logger->info('Route not found');
-            return [404, "Not found"];
+            return [403, "Not found"];
         }
         return [$this->_routes[$route][$method][0], $regex];

[NoCoverage] IncrementInteger
Adebipe/Router/RouteKeeper.php:243:9
             $this->_logger->info('Route not found');
             return [404, "Not found"];
         }
-        return [$this->_routes[$route][$method][0], $regex];
+        return [$this->_routes[$route][$method][1], $regex];
     }
 }

[NoCoverage] ArrayItemRemoval
Adebipe/Router/RouteKeeper.php:243:9
             $this->_logger->info('Route not found');
             return [404, "Not found"];
         }
-        return [$this->_routes[$route][$method][0], $regex];
+        return [$regex];
     }
 }
