[NoCoverage] PublicVisibility
Cli/Builder/Builder.php:49:5
      *
      * @return void
      */
-    public function build()
+    protected function build()
     {
         $getcwd = getcwd();

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:52:9
     public function build()
     {
         $getcwd = getcwd();
-        $build_dir = $getcwd . '/builddir';
+        $build_dir = $getcwd;
         $this->_build_dir = $build_dir;
         $this->_createBuildir();

[NoCoverage] Concat
Cli/Builder/Builder.php:52:9
     public function build()
     {
         $getcwd = getcwd();
-        $build_dir = $getcwd . '/builddir';
+        $build_dir = '/builddir' . $getcwd;
         $this->_build_dir = $build_dir;
         $this->_createBuildir();

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:54:9
         $getcwd = getcwd();
         $build_dir = $getcwd . '/builddir';
         $this->_build_dir = $build_dir;
-        $this->_createBuildir();
+        
         recurseCopy($getcwd . '/public', $build_dir . '/public');
 

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:55:9
         $build_dir = $getcwd . '/builddir';
         $this->_build_dir = $build_dir;
         $this->_createBuildir();
-        recurseCopy($getcwd . '/public', $build_dir . '/public');
+        recurseCopy($getcwd . '/public', $build_dir);
 
         $get_services_classes = $this->_includer->includeAllFile($getcwd . '/services');

[NoCoverage] Concat
Cli/Builder/Builder.php:55:9
         $build_dir = $getcwd . '/builddir';
         $this->_build_dir = $build_dir;
         $this->_createBuildir();
-        recurseCopy($getcwd . '/public', $build_dir . '/public');
+        recurseCopy($getcwd . '/public', '/public' . $build_dir);
 
         $get_services_classes = $this->_includer->includeAllFile($getcwd . '/services');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:57:9
         $this->_createBuildir();
         recurseCopy($getcwd . '/public', $build_dir . '/public');
 
-        $get_services_classes = $this->_includer->includeAllFile($getcwd . '/services');
+        $get_services_classes = $this->_includer->includeAllFile('/services');
         $all_services = MakeClasses::makeClasses($get_services_classes);
 

[NoCoverage] Concat
Cli/Builder/Builder.php:57:9
         $this->_createBuildir();
         recurseCopy($getcwd . '/public', $build_dir . '/public');
 
-        $get_services_classes = $this->_includer->includeAllFile($getcwd . '/services');
+        $get_services_classes = $this->_includer->includeAllFile('/services' . $getcwd);
         $all_services = MakeClasses::makeClasses($get_services_classes);
 

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:65:9
 
         $include_list = new IncludeList();
 
-        $this->_buildInterfaces($include_list);
+        
 
         $this->_buildServices($include_list, $all_services);

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:67:9
 
         $this->_buildInterfaces($include_list);
 
-        $this->_buildServices($include_list, $all_services);
+        
 
         foreach ($this->_started_services as $service_function) {

[NoCoverage] Foreach_
Cli/Builder/Builder.php:69:9
 
         $this->_buildServices($include_list, $all_services);
 
-        foreach ($this->_started_services as $service_function) {
-            $include_list->addOther($service_function . '();');
-        }
+        foreach (array() as $service_function) {
 
         $this->_generateInjectorFunction($include_list);

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:70:13
         $this->_buildServices($include_list, $all_services);
 
         foreach ($this->_started_services as $service_function) {
-            $include_list->addOther($service_function . '();');
+            
         }
 

[NoCoverage] Concat
Cli/Builder/Builder.php:70:13
         $this->_buildServices($include_list, $all_services);
 
         foreach ($this->_started_services as $service_function) {
-            $include_list->addOther($service_function . '();');
+            $include_list->addOther('();' . $service_function);
         }
 

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:73:9
             $include_list->addOther($service_function . '();');
         }
 
-        $this->_generateInjectorFunction($include_list);
+        
 
         $include_list->addOther('function atEnd() {' . "\n");

[NoCoverage] Concat
Cli/Builder/Builder.php:75:9
 
         $this->_generateInjectorFunction($include_list);
 
-        $include_list->addOther('function atEnd() {' . "\n");
+        $include_list->addOther("\n" . 'function atEnd() {');
 
         foreach ($this->_at_end as $at_end) {

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:75:9
 
         $this->_generateInjectorFunction($include_list);
 
-        $include_list->addOther('function atEnd() {' . "\n");
+        $include_list->addOther("\n");
 
         foreach ($this->_at_end as $at_end) {

[NoCoverage] Foreach_
Cli/Builder/Builder.php:77:9
 
         $include_list->addOther('function atEnd() {' . "\n");
 
-        foreach ($this->_at_end as $at_end) {
-            $include_list->addOther($at_end);
-        }
+        foreach (array() as $at_end) {
         $include_list->addOther('}');
 

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:78:13
         $include_list->addOther('function atEnd() {' . "\n");
 
         foreach ($this->_at_end as $at_end) {
-            $include_list->addOther($at_end);
+            
         }
         $include_list->addOther('}');

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:80:9
         foreach ($this->_at_end as $at_end) {
             $include_list->addOther($at_end);
         }
-        $include_list->addOther('}');
+        
 
         $include_list->generate($build_dir . '/services.php');

[NoCoverage] Concat
Cli/Builder/Builder.php:82:9
         }
         $include_list->addOther('}');
 
-        $include_list->generate($build_dir . '/services.php');
+        $include_list->generate('/services.php' . $build_dir);
 
         removeDir($build_dir . '/tmp');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:82:9
         }
         $include_list->addOther('}');
 
-        $include_list->generate($build_dir . '/services.php');
+        $include_list->generate($build_dir);
 
         removeDir($build_dir . '/tmp');

[NoCoverage] Concat
Cli/Builder/Builder.php:84:9
 
         $include_list->generate($build_dir . '/services.php');
 
-        removeDir($build_dir . '/tmp');
+        removeDir('/tmp' . $build_dir);
 
         file_put_contents(

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:84:9
 
         $include_list->generate($build_dir . '/services.php');
 
-        removeDir($build_dir . '/tmp');
+        removeDir($build_dir);
 
         file_put_contents(

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:86:9
 
         removeDir($build_dir . '/tmp');
 
-        file_put_contents(
-            $build_dir . '/router.php',
-            file_get_contents("src/Builder/adebipe/router")
-        );
+        
     }
 

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:87:13
         removeDir($build_dir . '/tmp');
 
         file_put_contents(
-            $build_dir . '/router.php',
+            file_put_contents($build_dir, file_get_contents("src/Builder/adebipe/router"));
             file_get_contents("src/Builder/adebipe/router")
         );

[NoCoverage] Concat
Cli/Builder/Builder.php:87:13
         removeDir($build_dir . '/tmp');
 
         file_put_contents(
-            $build_dir . '/router.php',
+            file_put_contents('/router.php' . $build_dir, file_get_contents("src/Builder/adebipe/router"));
             file_get_contents("src/Builder/adebipe/router")
         );

[NoCoverage] IfNegation
Cli/Builder/Builder.php:100:9
     private function _createBuildir()
     {
 
-        if (is_dir($this->_build_dir)) {
-            // Remove the build folder
-            removeDir($this->_build_dir);
-        }
+        if (!is_dir($this->_build_dir)) {
         mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/services');

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:102:13
 
         if (is_dir($this->_build_dir)) {
             // Remove the build folder
-            removeDir($this->_build_dir);
+            
         }
         mkdir($this->_build_dir);

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:104:9
             // Remove the build folder
             removeDir($this->_build_dir);
         }
-        mkdir($this->_build_dir);
+        
         mkdir($this->_build_dir . '/services');
         mkdir($this->_build_dir . '/services/interfaces');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:105:9
             removeDir($this->_build_dir);
         }
         mkdir($this->_build_dir);
-        mkdir($this->_build_dir . '/services');
+        mkdir('/services');
         mkdir($this->_build_dir . '/services/interfaces');
         mkdir($this->_build_dir . '/services/others');

[NoCoverage] Concat
Cli/Builder/Builder.php:105:9
             removeDir($this->_build_dir);
         }
         mkdir($this->_build_dir);
-        mkdir($this->_build_dir . '/services');
+        mkdir('/services' . $this->_build_dir);
         mkdir($this->_build_dir . '/services/interfaces');
         mkdir($this->_build_dir . '/services/others');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:106:9
         }
         mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/services');
-        mkdir($this->_build_dir . '/services/interfaces');
+        mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/services/others');
         mkdir($this->_build_dir . '/includes');

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:106:9
         }
         mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/services');
-        mkdir($this->_build_dir . '/services/interfaces');
+        
         mkdir($this->_build_dir . '/services/others');
         mkdir($this->_build_dir . '/includes');

[NoCoverage] Concat
Cli/Builder/Builder.php:107:9
         mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/services');
         mkdir($this->_build_dir . '/services/interfaces');
-        mkdir($this->_build_dir . '/services/others');
+        mkdir('/services/others' . $this->_build_dir);
         mkdir($this->_build_dir . '/includes');
         mkdir($this->_build_dir . '/tmp');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:107:9
         mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/services');
         mkdir($this->_build_dir . '/services/interfaces');
-        mkdir($this->_build_dir . '/services/others');
+        mkdir('/services/others');
         mkdir($this->_build_dir . '/includes');
         mkdir($this->_build_dir . '/tmp');

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:108:9
         mkdir($this->_build_dir . '/services');
         mkdir($this->_build_dir . '/services/interfaces');
         mkdir($this->_build_dir . '/services/others');
-        mkdir($this->_build_dir . '/includes');
+        
         mkdir($this->_build_dir . '/tmp');
     }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:108:9
         mkdir($this->_build_dir . '/services');
         mkdir($this->_build_dir . '/services/interfaces');
         mkdir($this->_build_dir . '/services/others');
-        mkdir($this->_build_dir . '/includes');
+        mkdir($this->_build_dir);
         mkdir($this->_build_dir . '/tmp');
     }

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:109:9
         mkdir($this->_build_dir . '/services/interfaces');
         mkdir($this->_build_dir . '/services/others');
         mkdir($this->_build_dir . '/includes');
-        mkdir($this->_build_dir . '/tmp');
+        
     }
 

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:109:9
         mkdir($this->_build_dir . '/services/interfaces');
         mkdir($this->_build_dir . '/services/others');
         mkdir($this->_build_dir . '/includes');
-        mkdir($this->_build_dir . '/tmp');
+        mkdir($this->_build_dir);
     }
 

[NoCoverage] Foreach_
Cli/Builder/Builder.php:121:9
      */
     private function _buildInterfaces(IncludeList $include_list): void
     {
-        foreach (get_declared_interfaces() as $interface) {
-            $interface = new ReflectionClass($interface);
-            if (!preg_match('/^Adebipe\\\\/', $interface->getName())) {
-                continue;
-            }
-            if ($interface->getAttributes(NoBuildable::class)) {
-                continue;
-            }
-            $this->_buildFile($include_list, $interface, '/services/interfaces/');
-        }
+        foreach (array() as $interface) {
     }
 

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:123:13
     {
         foreach (get_declared_interfaces() as $interface) {
             $interface = new ReflectionClass($interface);
-            if (!preg_match('/^Adebipe\\\\/', $interface->getName())) {
+            if (preg_match('/^Adebipe\\\\/', $interface->getName())) {
                 continue;
             }

[NoCoverage] PregMatchRemoveCaret
Cli/Builder/Builder.php:123:13
     {
         foreach (get_declared_interfaces() as $interface) {
             $interface = new ReflectionClass($interface);
-            if (!preg_match('/^Adebipe\\\\/', $interface->getName())) {
+            if (!preg_match('/Adebipe\\\\/', $interface->getName())) {
                 continue;
             }

[NoCoverage] Continue_
Cli/Builder/Builder.php:124:17
         foreach (get_declared_interfaces() as $interface) {
             $interface = new ReflectionClass($interface);
             if (!preg_match('/^Adebipe\\\\/', $interface->getName())) {
-                continue;
+                break;
             }
             if ($interface->getAttributes(NoBuildable::class)) {

[NoCoverage] IfNegation
Cli/Builder/Builder.php:126:13
             if (!preg_match('/^Adebipe\\\\/', $interface->getName())) {
                 continue;
             }
-            if ($interface->getAttributes(NoBuildable::class)) {
-                continue;
-            }
+            if (!$interface->getAttributes(NoBuildable::class)) {
             $this->_buildFile($include_list, $interface, '/services/interfaces/');
         }

[NoCoverage] Continue_
Cli/Builder/Builder.php:127:17
                 continue;
             }
             if ($interface->getAttributes(NoBuildable::class)) {
-                continue;
+                break;
             }
             $this->_buildFile($include_list, $interface, '/services/interfaces/');

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:129:13
             if ($interface->getAttributes(NoBuildable::class)) {
                 continue;
             }
-            $this->_buildFile($include_list, $interface, '/services/interfaces/');
+            
         }
     }

[NoCoverage] Foreach_
Cli/Builder/Builder.php:144:9
     private function _buildServices(IncludeList $include_list, array $all_services): void
     {
         $contained_services = [];
-        foreach ($all_services as $service) {
-            if ($service->isInterface()) {
-                continue;
-            }
-            if ($service->getAttributes(NoBuildable::class)) {
-                continue;
-            }
-            if ($service->getName() === NoBuildable::class) {
-                continue;
-            }
-            if (Container::class === $service->getName()) {
-                continue;
-            }
-            if (in_array(BuilderServiceInterface::class, $service->getInterfaceNames())) {
-                $service = $this->_buildBuilder($include_list, $service);
-            }
-            if (in_array(CreatorInterface::class, $service->getInterfaceNames())) {
-                $this->_buildCreator($include_list, $service);
-                continue;
-            }
-            $this->_buildOther($include_list, $service);
-        }
+        foreach (array() as $service) {
     }
 

[NoCoverage] IfNegation
Cli/Builder/Builder.php:145:13
     {
         $contained_services = [];
         foreach ($all_services as $service) {
-            if ($service->isInterface()) {
-                continue;
-            }
+            if (!$service->isInterface()) {
             if ($service->getAttributes(NoBuildable::class)) {
                 continue;

[NoCoverage] Continue_
Cli/Builder/Builder.php:146:17
         $contained_services = [];
         foreach ($all_services as $service) {
             if ($service->isInterface()) {
-                continue;
+                break;
             }
             if ($service->getAttributes(NoBuildable::class)) {

[NoCoverage] IfNegation
Cli/Builder/Builder.php:148:13
             if ($service->isInterface()) {
                 continue;
             }
-            if ($service->getAttributes(NoBuildable::class)) {
-                continue;
-            }
+            if (!$service->getAttributes(NoBuildable::class)) {
             if ($service->getName() === NoBuildable::class) {
                 continue;

[NoCoverage] Continue_
Cli/Builder/Builder.php:149:17
                 continue;
             }
             if ($service->getAttributes(NoBuildable::class)) {
-                continue;
+                break;
             }
             if ($service->getName() === NoBuildable::class) {

[NoCoverage] Identical
Cli/Builder/Builder.php:151:13
             if ($service->getAttributes(NoBuildable::class)) {
                 continue;
             }
-            if ($service->getName() === NoBuildable::class) {
+            if ($service->getName() !== NoBuildable::class) {
                 continue;
             }

[NoCoverage] Continue_
Cli/Builder/Builder.php:152:17
                 continue;
             }
             if ($service->getName() === NoBuildable::class) {
-                continue;
+                break;
             }
             if (Container::class === $service->getName()) {

[NoCoverage] Identical
Cli/Builder/Builder.php:154:13
             if ($service->getName() === NoBuildable::class) {
                 continue;
             }
-            if (Container::class === $service->getName()) {
+            if (Container::class !== $service->getName()) {
                 continue;
             }

[NoCoverage] Continue_
Cli/Builder/Builder.php:155:17
                 continue;
             }
             if (Container::class === $service->getName()) {
-                continue;
+                break;
             }
             if (in_array(BuilderServiceInterface::class, $service->getInterfaceNames())) {

[NoCoverage] IfNegation
Cli/Builder/Builder.php:157:13
             if (Container::class === $service->getName()) {
                 continue;
             }
-            if (in_array(BuilderServiceInterface::class, $service->getInterfaceNames())) {
-                $service = $this->_buildBuilder($include_list, $service);
-            }
+            if (!in_array(BuilderServiceInterface::class, $service->getInterfaceNames())) {
             if (in_array(CreatorInterface::class, $service->getInterfaceNames())) {
                 $this->_buildCreator($include_list, $service);

[NoCoverage] IfNegation
Cli/Builder/Builder.php:160:13
             if (in_array(BuilderServiceInterface::class, $service->getInterfaceNames())) {
                 $service = $this->_buildBuilder($include_list, $service);
             }
-            if (in_array(CreatorInterface::class, $service->getInterfaceNames())) {
-                $this->_buildCreator($include_list, $service);
-                continue;
-            }
+            if (!in_array(CreatorInterface::class, $service->getInterfaceNames())) {
             $this->_buildOther($include_list, $service);
         }

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:161:17
                 $service = $this->_buildBuilder($include_list, $service);
             }
             if (in_array(CreatorInterface::class, $service->getInterfaceNames())) {
-                $this->_buildCreator($include_list, $service);
+                
                 continue;
             }

[NoCoverage] Continue_
Cli/Builder/Builder.php:162:17
             }
             if (in_array(CreatorInterface::class, $service->getInterfaceNames())) {
                 $this->_buildCreator($include_list, $service);
-                continue;
+                break;
             }
             $this->_buildOther($include_list, $service);

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:164:13
                 $this->_buildCreator($include_list, $service);
                 continue;
             }
-            $this->_buildOther($include_list, $service);
+            
         }
     }

[NoCoverage] InstanceOf_
Cli/Builder/Builder.php:180:9
     {
         $container = MakeClasses::$container;
         $class = $container->getService($service->getName());
-        if (!$class instanceof BuilderServiceInterface) {
+        if (!true) {
             return $service;
         }

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:180:9
     {
         $container = MakeClasses::$container;
         $class = $container->getService($service->getName());
-        if (!$class instanceof BuilderServiceInterface) {
+        if ($class instanceof BuilderServiceInterface) {
             return $service;
         }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:185:13
         }
         $builder_name = $class->build();
         try {
-            $builder_class_name = $this->_includer->includeFile("src/Builder/" . $builder_name)[0];
+            $builder_class_name = $this->_includer->includeFile("src/Builder/")[0];
         } catch (Throwable $e) {
             return $service;

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:185:13
         }
         $builder_name = $class->build();
         try {
-            $builder_class_name = $this->_includer->includeFile("src/Builder/" . $builder_name)[0];
+            $builder_class_name = $this->_includer->includeFile($builder_name)[0];
         } catch (Throwable $e) {
             return $service;

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:189:9
         } catch (Throwable $e) {
             return $service;
         }
-        if (!class_exists($builder_class_name)) {
+        if (class_exists($builder_class_name)) {
             return $service;
         }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:194:9
         }
         $builder_class = new ReflectionClass($builder_class_name);
 
-        $tmp = $this->_build_dir . '/tmp/' . uniqid() . '.php';
+        $tmp = '/tmp/' . uniqid() . '.php';
 
         $instance = $builder_class->newInstance();

[NoCoverage] Concat
Cli/Builder/Builder.php:194:9
         }
         $builder_class = new ReflectionClass($builder_class_name);
 
-        $tmp = $this->_build_dir . '/tmp/' . uniqid() . '.php';
+        $tmp = $this->_build_dir . '/tmp/' . '.php' . uniqid();
 
         $instance = $builder_class->newInstance();

[NoCoverage] InstanceOf_
Cli/Builder/Builder.php:198:9
 
         $instance = $builder_class->newInstance();
 
-        if (!$instance instanceof BuilderInterface) {
+        if (!false) {
             return $service;
         }

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:198:9
 
         $instance = $builder_class->newInstance();
 
-        if (!$instance instanceof BuilderInterface) {
+        if ($instance instanceof BuilderInterface) {
             return $service;
         }

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:202:9
             return $service;
         }
 
-        $instance->build($tmp, $this->_builder_helper);
+        
 
         $all_included = $instance->includeFiles();

[NoCoverage] Foreach_
Cli/Builder/Builder.php:206:9
 
         $all_included = $instance->includeFiles();
 
-        foreach ($all_included as $file) {
-            $filename = explode('/', $file);
-            $filename = $filename[count($filename) - 1];
-            $new_file = $this->_build_dir . '/includes/' . $filename;
-            file_put_contents($new_file, file_get_contents($file));
-            $include = substr($new_file, strlen($this->_build_dir . '/'));
-            $include_list->add($include);
-        }
+        foreach (array() as $file) {
 
         $result = $this->_includer->includeFile($tmp);

[NoCoverage] IncrementInteger
Cli/Builder/Builder.php:208:13
 
         foreach ($all_included as $file) {
             $filename = explode('/', $file);
-            $filename = $filename[count($filename) - 1];
+            $filename = $filename[count($filename) - 2];
             $new_file = $this->_build_dir . '/includes/' . $filename;
             file_put_contents($new_file, file_get_contents($file));

[NoCoverage] DecrementInteger
Cli/Builder/Builder.php:208:13
 
         foreach ($all_included as $file) {
             $filename = explode('/', $file);
-            $filename = $filename[count($filename) - 1];
+            $filename = $filename[count($filename) - 0];
             $new_file = $this->_build_dir . '/includes/' . $filename;
             file_put_contents($new_file, file_get_contents($file));

[NoCoverage] Concat
Cli/Builder/Builder.php:209:13
         foreach ($all_included as $file) {
             $filename = explode('/', $file);
             $filename = $filename[count($filename) - 1];
-            $new_file = $this->_build_dir . '/includes/' . $filename;
+            $new_file = '/includes/' . $this->_build_dir . $filename;
             file_put_contents($new_file, file_get_contents($file));
             $include = substr($new_file, strlen($this->_build_dir . '/'));

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:209:13
         foreach ($all_included as $file) {
             $filename = explode('/', $file);
             $filename = $filename[count($filename) - 1];
-            $new_file = $this->_build_dir . '/includes/' . $filename;
+            $new_file = $this->_build_dir . '/includes/';
             file_put_contents($new_file, file_get_contents($file));
             $include = substr($new_file, strlen($this->_build_dir . '/'));

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:210:13
             $filename = explode('/', $file);
             $filename = $filename[count($filename) - 1];
             $new_file = $this->_build_dir . '/includes/' . $filename;
-            file_put_contents($new_file, file_get_contents($file));
+            
             $include = substr($new_file, strlen($this->_build_dir . '/'));
             $include_list->add($include);

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:211:13
             $filename = $filename[count($filename) - 1];
             $new_file = $this->_build_dir . '/includes/' . $filename;
             file_put_contents($new_file, file_get_contents($file));
-            $include = substr($new_file, strlen($this->_build_dir . '/'));
+            $include = substr($new_file, strlen($this->_build_dir));
             $include_list->add($include);
         }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:211:13
             $filename = $filename[count($filename) - 1];
             $new_file = $this->_build_dir . '/includes/' . $filename;
             file_put_contents($new_file, file_get_contents($file));
-            $include = substr($new_file, strlen($this->_build_dir . '/'));
+            $include = substr($new_file, strlen('/'));
             $include_list->add($include);
         }

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:212:13
             $new_file = $this->_build_dir . '/includes/' . $filename;
             file_put_contents($new_file, file_get_contents($file));
             $include = substr($new_file, strlen($this->_build_dir . '/'));
-            $include_list->add($include);
+            
         }
 

[NoCoverage] IncrementInteger
Cli/Builder/Builder.php:216:9
         }
 
         $result = $this->_includer->includeFile($tmp);
-        $result = $result[0];
+        $result = $result[1];
         if (!class_exists($result)) {
             throw new \Exception("The builder must return a class");

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:217:9
 
         $result = $this->_includer->includeFile($tmp);
         $result = $result[0];
-        if (!class_exists($result)) {
+        if (class_exists($result)) {
             throw new \Exception("The builder must return a class");
         }

[NoCoverage] Throw_
Cli/Builder/Builder.php:218:13
         $result = $this->_includer->includeFile($tmp);
         $result = $result[0];
         if (!class_exists($result)) {
-            throw new \Exception("The builder must return a class");
+            new \Exception("The builder must return a class");
         }
         $result = new ReflectionClass($result);

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:234:9
      */
     private function _buildCreator(IncludeList $include_list, ReflectionClass $service): void
     {
-        $this->_buildFile($include_list, $service, '/services/');
+        
         $service_builder = new ServicesBuilder($service);
         $include_list->addFunction($service_builder->generateFunctionConstructor());

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:236:9
     {
         $this->_buildFile($include_list, $service, '/services/');
         $service_builder = new ServicesBuilder($service);
-        $include_list->addFunction($service_builder->generateFunctionConstructor());
+        
         $name = ServicesBuilder::getName($service->getName());
         $this->_at_end[] = $service_builder->atEnd();
