[NoCoverage] IfNegation
Cli/Builder/Builder.php:239:9
         $include_list->addFunction($service_builder->generateFunctionConstructor());
         $name = ServicesBuilder::getName($service->getName());
         $this->_at_end[] = $service_builder->atEnd();
-        if (in_array(RegisterServiceInterface::class, $service->getInterfaceNames())) {
-            $this->_injector_services[] = $name;
-            return;
-        }
+        if (!in_array(RegisterServiceInterface::class, $service->getInterfaceNames())) {
         $this->_started_services[] = $name;
     }

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:256:9
      */
     private function _buildOther(IncludeList $include_list, ReflectionClass $service): void
     {
-        $this->_buildFile($include_list, $service, '/services/others/');
+        
     }
 

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:272:9
     private function _buildFile(IncludeList $include_list, ReflectionClass $service, string $directory)
     {
         $file = $service->getFileName();
-        if (!$file) {
+        if ($file) {
             return;
         }

[NoCoverage] LogicalNot
Cli/Builder/Builder.php:276:9
             return;
         }
         $file_code = file_get_contents($file);
-        if (!$file_code) {
+        if ($file_code) {
             return;
         }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:279:9
         if (!$file_code) {
             return;
         }
-        $file_path = $this->_build_dir . $directory . $service->getShortName() . '.php';
+        $file_path = $this->_build_dir . $directory . $service->getShortName();
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
             $file_code = str_replace(

[NoCoverage] Concat
Cli/Builder/Builder.php:279:9
         if (!$file_code) {
             return;
         }
-        $file_path = $this->_build_dir . $directory . $service->getShortName() . '.php';
+        $file_path = $this->_build_dir . $service->getShortName() . $directory . '.php';
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
             $file_code = str_replace(

[NoCoverage] IfNegation
Cli/Builder/Builder.php:280:9
             return;
         }
         $file_path = $this->_build_dir . $directory . $service->getShortName() . '.php';
-        if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
-            $file_code = str_replace(
-                "namespace " . $service->getNamespaceName() . ";",
-                "namespace " . $matches[1][0] . ";",
-                $file_code
-            );
-        }
+        if (!preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
         file_put_contents($file_path, $file_code);
         $include = substr($file_path, strlen($this->_build_dir . '/'));

[NoCoverage] UnwrapStrReplace
Cli/Builder/Builder.php:281:13
         }
         $file_path = $this->_build_dir . $directory . $service->getShortName() . '.php';
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
-            $file_code = str_replace(
-                "namespace " . $service->getNamespaceName() . ";",
-                "namespace " . $matches[1][0] . ";",
-                $file_code
-            );
+            $file_code = $file_code;
         }
         file_put_contents($file_path, $file_code);

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:282:17
         $file_path = $this->_build_dir . $directory . $service->getShortName() . '.php';
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
             $file_code = str_replace(
-                "namespace " . $service->getNamespaceName() . ";",
+                $file_code = str_replace("namespace " . $service->getNamespaceName(), "namespace " . $matches[1][0] . ";", $file_code);
                 "namespace " . $matches[1][0] . ";",
                 $file_code

[NoCoverage] Concat
Cli/Builder/Builder.php:282:17
         $file_path = $this->_build_dir . $directory . $service->getShortName() . '.php';
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
             $file_code = str_replace(
-                "namespace " . $service->getNamespaceName() . ";",
+                $file_code = str_replace($service->getNamespaceName() . "namespace " . ";", "namespace " . $matches[1][0] . ";", $file_code);
                 "namespace " . $matches[1][0] . ";",
                 $file_code

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:283:17
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
             $file_code = str_replace(
                 "namespace " . $service->getNamespaceName() . ";",
-                "namespace " . $matches[1][0] . ";",
+                $file_code = str_replace("namespace " . $service->getNamespaceName() . ";", "namespace " . ";", $file_code);
                 $file_code
             );

[NoCoverage] IncrementInteger
Cli/Builder/Builder.php:283:17
         if (preg_match_all("/namespace (.*)\\\\Generated;/", $file_code, $matches)) {
             $file_code = str_replace(
                 "namespace " . $service->getNamespaceName() . ";",
-                "namespace " . $matches[1][0] . ";",
+                $file_code = str_replace("namespace " . $service->getNamespaceName() . ";", "namespace " . $matches[1][1] . ";", $file_code);
                 $file_code
             );

[NoCoverage] FunctionCallRemoval
Cli/Builder/Builder.php:287:9
                 $file_code
             );
         }
-        file_put_contents($file_path, $file_code);
+        
         $include = substr($file_path, strlen($this->_build_dir . '/'));
         $include_list->add($include);

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:288:9
             );
         }
         file_put_contents($file_path, $file_code);
-        $include = substr($file_path, strlen($this->_build_dir . '/'));
+        $include = substr($file_path, strlen($this->_build_dir));
         $include_list->add($include);
     }

[NoCoverage] Concat
Cli/Builder/Builder.php:288:9
             );
         }
         file_put_contents($file_path, $file_code);
-        $include = substr($file_path, strlen($this->_build_dir . '/'));
+        $include = substr($file_path, strlen('/' . $this->_build_dir));
         $include_list->add($include);
     }

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:289:9
         }
         file_put_contents($file_path, $file_code);
         $include = substr($file_path, strlen($this->_build_dir . '/'));
-        $include_list->add($include);
+        
     }
 

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Builder.php:301:9
      */
     private function _generateInjectorFunction(IncludeList $include_list)
     {
-        $include_list->addOther('$injector = ' . ServicesBuilder::getName(Injector::class) . '();' . "\n");
+        $include_list->addOther(ServicesBuilder::getName(Injector::class) . '();' . "\n");
         foreach ($this->_injector_services as $service) {
             $include_list->addOther('$injector->addService(' . $service . '());' . "\n");

[NoCoverage] MethodCallRemoval
Cli/Builder/Builder.php:301:9
      */
     private function _generateInjectorFunction(IncludeList $include_list)
     {
-        $include_list->addOther('$injector = ' . ServicesBuilder::getName(Injector::class) . '();' . "\n");
+        
         foreach ($this->_injector_services as $service) {
             $include_list->addOther('$injector->addService(' . $service . '());' . "\n");

[NoCoverage] Foreach_
Cli/Builder/Builder.php:302:9
     private function _generateInjectorFunction(IncludeList $include_list)
     {
         $include_list->addOther('$injector = ' . ServicesBuilder::getName(Injector::class) . '();' . "\n");
-        foreach ($this->_injector_services as $service) {
-            $include_list->addOther('$injector->addService(' . $service . '());' . "\n");
-        }
+        foreach (array() as $service) {
     }
 }

[NoCoverage] Concat
Cli/Builder/Builder.php:303:13
     {
         $include_list->addOther('$injector = ' . ServicesBuilder::getName(Injector::class) . '();' . "\n");
         foreach ($this->_injector_services as $service) {
-            $include_list->addOther('$injector->addService(' . $service . '());' . "\n");
+            $include_list->addOther('$injector->addService(' . $service . "\n" . '());');
         }
     }

[NoCoverage] Concat
Cli/Builder/Builder.php:303:13
     {
         $include_list->addOther('$injector = ' . ServicesBuilder::getName(Injector::class) . '();' . "\n");
         foreach ($this->_injector_services as $service) {
-            $include_list->addOther('$injector->addService(' . $service . '());' . "\n");
+            $include_list->addOther('$injector->addService(' . '());' . $service . "\n");
         }
     }
