[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:26:5
      *
      * @return void
      */
-    public function add(string $file): void
+    protected function add(string $file) : void
     {
         $this->_include_list[] = $file;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:36:5
      *
      * @return array<string> List of files to include
      */
-    public function get(): array
+    protected function get() : array
     {
         return $this->_include_list;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:48:5
      *
      * @return void
      */
-    public function addFunction(string $function): void
+    protected function addFunction(string $function) : void
     {
         $this->_function_list[] = $function;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:59:5
      *
      * @return array<string> List of functions to add
      */
-    public function getFunction(): array
+    protected function getFunction() : array
     {
         return $this->_function_list;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:71:5
      *
      * @return void
      */
-    public function addOther(string $other): void
+    protected function addOther(string $other) : void
     {
         $this->_other_list[] = $other;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:81:5
      *
      * @return array<string> List of other lines to add
      */
-    public function getOther(): array
+    protected function getOther() : array
     {
         return $this->_other_list;

[NoCoverage] Foreach_
Cli/Builder/Constructor/IncludeList.php:95:9
     private function _includeList(): string
     {
         $include_list = '';
-        foreach ($this->_include_list as $file) {
-            $include_list .= "require_once __DIR__ . '/$file';\n";
-        }
+        foreach (array() as $file) {
         return $include_list;
     }

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:96:13
     {
         $include_list = '';
         foreach ($this->_include_list as $file) {
-            $include_list .= "require_once __DIR__ . '/$file';\n";
+            $include_list = "require_once __DIR__ . '/{$file}';\n";
         }
         return $include_list;

[NoCoverage] Foreach_
Cli/Builder/Constructor/IncludeList.php:109:9
     private function _functionList(): string
     {
         $function_list = '';
-        foreach ($this->_function_list as $function) {
-            $function_list .= $function . "\n";
-        }
+        foreach (array() as $function) {
         return $function_list;
     }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/IncludeList.php:110:13
     {
         $function_list = '';
         foreach ($this->_function_list as $function) {
-            $function_list .= $function . "\n";
+            $function_list .= "\n";
         }
         return $function_list;

[NoCoverage] Concat
Cli/Builder/Constructor/IncludeList.php:110:13
     {
         $function_list = '';
         foreach ($this->_function_list as $function) {
-            $function_list .= $function . "\n";
+            $function_list .= "\n" . $function;
         }
         return $function_list;

[NoCoverage] Foreach_
Cli/Builder/Constructor/IncludeList.php:123:9
     private function _otherList(): string
     {
         $other_list = '';
-        foreach ($this->_other_list as $other) {
-            $other_list .= $other . "\n";
-        }
+        foreach (array() as $other) {
         return $other_list;
     }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/IncludeList.php:124:13
     {
         $other_list = '';
         foreach ($this->_other_list as $other) {
-            $other_list .= $other . "\n";
+            $other_list .= "\n";
         }
         return $other_list;

[NoCoverage] Concat
Cli/Builder/Constructor/IncludeList.php:124:13
     {
         $other_list = '';
         foreach ($this->_other_list as $other) {
-            $other_list .= $other . "\n";
+            $other_list .= "\n" . $other;
         }
         return $other_list;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/IncludeList.php:136:5
      *
      * @return void
      */
-    public function generate(string $file)
+    protected function generate(string $file)
     {
         $content = "<?php";

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:139:9
     public function generate(string $file)
     {
         $content = "<?php";
-        $content .= "\n\n";
+        $content = "\n\n";
         $content .= $this->_includeList();
         $content .= "\n\n";

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:140:9
     {
         $content = "<?php";
         $content .= "\n\n";
-        $content .= $this->_includeList();
+        $content = $this->_includeList();
         $content .= "\n\n";
         $content .= $this->_functionList();

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:141:9
         $content = "<?php";
         $content .= "\n\n";
         $content .= $this->_includeList();
-        $content .= "\n\n";
+        $content = "\n\n";
         $content .= $this->_functionList();
         $content .= "\n\n";

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:142:9
         $content .= "\n\n";
         $content .= $this->_includeList();
         $content .= "\n\n";
-        $content .= $this->_functionList();
+        $content = $this->_functionList();
         $content .= "\n\n";
         $content .= $this->_otherList();

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:143:9
         $content .= $this->_includeList();
         $content .= "\n\n";
         $content .= $this->_functionList();
-        $content .= "\n\n";
+        $content = "\n\n";
         $content .= $this->_otherList();
         file_put_contents($file, $content);

[NoCoverage] Assignment
Cli/Builder/Constructor/IncludeList.php:144:9
         $content .= "\n\n";
         $content .= $this->_functionList();
         $content .= "\n\n";
-        $content .= $this->_otherList();
+        $content = $this->_otherList();
         file_put_contents($file, $content);
     }

[NoCoverage] FunctionCallRemoval
Cli/Builder/Constructor/IncludeList.php:145:9
         $content .= $this->_functionList();
         $content .= "\n\n";
         $content .= $this->_otherList();
-        file_put_contents($file, $content);
+        
     }
 }
