[NoCoverage] PublicVisibility
Cli/Builder/Constructor/ServicesBuilder.php:27:5
      *
      * @return string Name of the service
      */
-    public static function decodedName($function_name): string
+    protected static function decodedName($function_name) : string
     {
         if (strpos($function_name, "\\Generated")) {

[NoCoverage] IfNegation
Cli/Builder/Constructor/ServicesBuilder.php:29:9
      */
     public static function decodedName($function_name): string
     {
-        if (strpos($function_name, "\\Generated")) {
-            $function_name = str_replace("\\Generated", "", $function_name);
-        }
+        if (!strpos($function_name, "\\Generated")) {
         return $function_name;
     }

[NoCoverage] UnwrapStrReplace
Cli/Builder/Constructor/ServicesBuilder.php:30:13
     public static function decodedName($function_name): string
     {
         if (strpos($function_name, "\\Generated")) {
-            $function_name = str_replace("\\Generated", "", $function_name);
+            $function_name = $function_name;
         }
         return $function_name;

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/ServicesBuilder.php:42:5
      *
      * @return string Name of the function service
      */
-    public static function getName($function_name): string
+    protected static function getName($function_name) : string
     {
         $function_name = self::decodedName($function_name);

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:45:9
     public static function getName($function_name): string
     {
         $function_name = self::decodedName($function_name);
-        $function_name = "get" . implode('_', explode('\\', $function_name));
+        $function_name = "get";
         return $function_name;
     }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:45:9
     public static function getName($function_name): string
     {
         $function_name = self::decodedName($function_name);
-        $function_name = "get" . implode('_', explode('\\', $function_name));
+        $function_name = implode('_', explode('\\', $function_name));
         return $function_name;
     }

[NoCoverage] Identical
Cli/Builder/Constructor/ServicesBuilder.php:57:9
     public function __construct(ReflectionClass $class)
     {
         $this->_class = $class;
-        if ($this->_class->getConstructor() === null) {
+        if ($this->_class->getConstructor() !== null) {
             return;
         }

[NoCoverage] Foreach_
Cli/Builder/Constructor/ServicesBuilder.php:60:9
         if ($this->_class->getConstructor() === null) {
             return;
         }
-        foreach ($this->_class->getConstructor()->getParameters() as $param) {
-            $type = $param->getType();
-            if ($type instanceof ReflectionNamedType) {
-                $param_class = $type->getName();
-                $this->_constructor_service_needed[] = $param_class;
-                continue;
-            }
-            throw new \Exception('The service ' . $this->_class->getName() . ' has a parameter without type');
-        }
+        foreach (array() as $param) {
     }
 

[NoCoverage] InstanceOf_
Cli/Builder/Constructor/ServicesBuilder.php:62:13
         }
         foreach ($this->_class->getConstructor()->getParameters() as $param) {
             $type = $param->getType();
-            if ($type instanceof ReflectionNamedType) {
+            if (false) {
                 $param_class = $type->getName();
                 $this->_constructor_service_needed[] = $param_class;

[NoCoverage] InstanceOf_
Cli/Builder/Constructor/ServicesBuilder.php:62:13
         }
         foreach ($this->_class->getConstructor()->getParameters() as $param) {
             $type = $param->getType();
-            if ($type instanceof ReflectionNamedType) {
+            if (true) {
                 $param_class = $type->getName();
                 $this->_constructor_service_needed[] = $param_class;

[NoCoverage] Continue_
Cli/Builder/Constructor/ServicesBuilder.php:65:17
             if ($type instanceof ReflectionNamedType) {
                 $param_class = $type->getName();
                 $this->_constructor_service_needed[] = $param_class;
-                continue;
+                break;
             }
             throw new \Exception('The service ' . $this->_class->getName() . ' has a parameter without type');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:67:13
                 $this->_constructor_service_needed[] = $param_class;
                 continue;
             }
-            throw new \Exception('The service ' . $this->_class->getName() . ' has a parameter without type');
+            throw new \Exception($this->_class->getName() . ' has a parameter without type');
         }
     }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:67:13
                 $this->_constructor_service_needed[] = $param_class;
                 continue;
             }
-            throw new \Exception('The service ' . $this->_class->getName() . ' has a parameter without type');
+            throw new \Exception('The service ' . ' has a parameter without type');
         }
     }

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/ServicesBuilder.php:76:5
      *
      * @return string Function to get the service
      */
-    public function generateFunctionConstructor()
+    protected function generateFunctionConstructor()
     {
         $class_name = $this->_class->getName();

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:82:9
         $class_name = self::decodedName($class_name);
 
         $function_name = self::getName($class_name);
-        $function =  'function ' . $function_name . "() {\n";
+        $function = $function_name . 'function ' . "() {\n";
         $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:82:9
         $class_name = self::decodedName($class_name);
 
         $function_name = self::getName($class_name);
-        $function =  'function ' . $function_name . "() {\n";
+        $function = $function_name . "() {\n";
         $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:83:9
 
         $function_name = self::getName($class_name);
         $function =  'function ' . $function_name . "() {\n";
-        $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
+        $function .= 'if (isset($GLOBALS[\'' . $class_name . "\n";
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
         $function .= '}' . "\n";

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:83:9
 
         $function_name = self::getName($class_name);
         $function =  'function ' . $function_name . "() {\n";
-        $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
+        $function .= $class_name . 'if (isset($GLOBALS[\'' . '\'])) {' . "\n";
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
         $function .= '}' . "\n";

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:84:9
         $function_name = self::getName($class_name);
         $function =  'function ' . $function_name . "() {\n";
         $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
-        $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
+        $function .= 'return $GLOBALS[\'' . '\'];' . $class_name . "\n";
         $function .= '}' . "\n";
         $parameters = [];

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:84:9
         $function_name = self::getName($class_name);
         $function =  'function ' . $function_name . "() {\n";
         $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
-        $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
+        $function .= 'return $GLOBALS[\'' . '\'];' . "\n";
         $function .= '}' . "\n";
         $parameters = [];

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:85:9
         $function =  'function ' . $function_name . "() {\n";
         $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
-        $function .= '}' . "\n";
+        $function .= "\n";
         $parameters = [];
         foreach ($this->_constructor_service_needed as $service) {

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:85:9
         $function =  'function ' . $function_name . "() {\n";
         $function .= 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
-        $function .= '}' . "\n";
+        $function .= "\n" . '}';
         $parameters = [];
         foreach ($this->_constructor_service_needed as $service) {

[NoCoverage] Foreach_
Cli/Builder/Constructor/ServicesBuilder.php:87:9
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];' . "\n";
         $function .= '}' . "\n";
         $parameters = [];
-        foreach ($this->_constructor_service_needed as $service) {
-            $parameters[] = ServicesBuilder::getName($service) . '()';
-        }
+        foreach (array() as $service) {
         $function .= '$GLOBALS[\'' . $class_name . '\'] = ' .
             'new ' . $class_name . '(' . implode(",\n", $parameters) . ");\n";

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:88:13
         $function .= '}' . "\n";
         $parameters = [];
         foreach ($this->_constructor_service_needed as $service) {
-            $parameters[] = ServicesBuilder::getName($service) . '()';
+            $parameters[] = '()' . ServicesBuilder::getName($service);
         }
         $function .= '$GLOBALS[\'' . $class_name . '\'] = ' .

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:88:13
         $function .= '}' . "\n";
         $parameters = [];
         foreach ($this->_constructor_service_needed as $service) {
-            $parameters[] = ServicesBuilder::getName($service) . '()';
+            $parameters[] = '()';
         }
         $function .= '$GLOBALS[\'' . $class_name . '\'] = ' .

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:90:9
         foreach ($this->_constructor_service_needed as $service) {
             $parameters[] = ServicesBuilder::getName($service) . '()';
         }
-        $function .= '$GLOBALS[\'' . $class_name . '\'] = ' .
-            'new ' . $class_name . '(' . implode(",\n", $parameters) . ");\n";
+        $function .= '$GLOBALS[\'' . $class_name . '\'] = ' . 'new ' . $class_name . '(' . ");\n";meters) . ");\n";
         if (in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
             $function_start = $this->_class->getMethod('atStart');

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:90:9
         foreach ($this->_constructor_service_needed as $service) {
             $parameters[] = ServicesBuilder::getName($service) . '()';
         }
-        $function .= '$GLOBALS[\'' . $class_name . '\'] = ' .
-            'new ' . $class_name . '(' . implode(",\n", $parameters) . ");\n";
+        $function .= '$GLOBALS[\'' . $class_name . 'new ' . '\'] = ' . $class_name . '(' . implode(",\n", $parameters) . ");\n";meters) . ");\n";
         if (in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
             $function_start = $this->_class->getMethod('atStart');

[NoCoverage] IfNegation
Cli/Builder/Constructor/ServicesBuilder.php:92:9
         }
         $function .= '$GLOBALS[\'' . $class_name . '\'] = ' .
             'new ' . $class_name . '(' . implode(",\n", $parameters) . ");\n";
-        if (in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
-            $function_start = $this->_class->getMethod('atStart');
-            $function_parameters = [];
-            foreach ($function_start->getParameters() as $param) {
-                $type = $param->getType();
-                if ($type instanceof ReflectionNamedType) {
-                    $param_class = $type->getName();
-                    $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
-                    continue;
-                }
-                throw new \Exception('The service ' . $class_name . ' has a parameter without type');
-            }
-            $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
-        }
+        if (!in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];';
         $function .= '}';

[NoCoverage] Foreach_
Cli/Builder/Constructor/ServicesBuilder.php:95:13
         if (in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
             $function_start = $this->_class->getMethod('atStart');
             $function_parameters = [];
-            foreach ($function_start->getParameters() as $param) {
-                $type = $param->getType();
-                if ($type instanceof ReflectionNamedType) {
-                    $param_class = $type->getName();
-                    $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
-                    continue;
-                }
-                throw new \Exception('The service ' . $class_name . ' has a parameter without type');
-            }
+            foreach (array() as $param) {
             $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
         }

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:99:21
                 $type = $param->getType();
                 if ($type instanceof ReflectionNamedType) {
                     $param_class = $type->getName();
-                    $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
+                    $function_parameters[] = '()';
                     continue;
                 }

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:99:21
                 $type = $param->getType();
                 if ($type instanceof ReflectionNamedType) {
                     $param_class = $type->getName();
-                    $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
+                    $function_parameters[] = '()' . ServicesBuilder::getName($param_class);
                     continue;
                 }

[NoCoverage] Continue_
Cli/Builder/Constructor/ServicesBuilder.php:100:21
                 if ($type instanceof ReflectionNamedType) {
                     $param_class = $type->getName();
                     $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
-                    continue;
+                    break;
                 }
                 throw new \Exception('The service ' . $class_name . ' has a parameter without type');

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:102:17
                     $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
                     continue;
                 }
-                throw new \Exception('The service ' . $class_name . ' has a parameter without type');
+                throw new \Exception($class_name . ' has a parameter without type');
             }
             $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:102:17
                     $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
                     continue;
                 }
-                throw new \Exception('The service ' . $class_name . ' has a parameter without type');
+                throw new \Exception('The service ' . $class_name);
             }
             $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:104:13
                 }
                 throw new \Exception('The service ' . $class_name . ' has a parameter without type');
             }
-            $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
+            $function .= '$GLOBALS[\'' . $class_name . implode(",\n", $function_parameters) . '\']->atStart(' . ");\n";
         }
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];';

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:104:13
                 }
                 throw new \Exception('The service ' . $class_name . ' has a parameter without type');
             }
-            $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
+            $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters);
         }
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];';

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:106:9
             }
             $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
         }
-        $function .= 'return $GLOBALS[\'' . $class_name . '\'];';
+        $function .= 'return $GLOBALS[\'' . '\'];';
         $function .= '}';
         return $function;

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:106:9
             }
             $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
         }
-        $function .= 'return $GLOBALS[\'' . $class_name . '\'];';
+        $function .= 'return $GLOBALS[\'' . $class_name;
         $function .= '}';
         return $function;

[NoCoverage] Assignment
Cli/Builder/Constructor/ServicesBuilder.php:107:9
             $function .= '$GLOBALS[\'' . $class_name . '\']->atStart(' . implode(",\n", $function_parameters) . ");\n";
         }
         $function .= 'return $GLOBALS[\'' . $class_name . '\'];';
-        $function .= '}';
+        $function = '}';
         return $function;
     }

[NoCoverage] PublicVisibility
Cli/Builder/Constructor/ServicesBuilder.php:116:5
      *
      * @return string Function to stop the service
      */
-    public function atEnd()
+    protected function atEnd()
     {
         if (!in_array($this->_starter_service, $this->_class->getInterfaceNames())) {

[NoCoverage] LogicalNot
Cli/Builder/Constructor/ServicesBuilder.php:118:9
      */
     public function atEnd()
     {
-        if (!in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
+        if (in_array($this->_starter_service, $this->_class->getInterfaceNames())) {
             return '';
         }

[NoCoverage] Foreach_
Cli/Builder/Constructor/ServicesBuilder.php:125:9
         $class_name = self::decodedName($class_name);
         $function_end = $this->_class->getMethod('atEnd');
         $function_parameters = [];
-        foreach ($function_end->getParameters() as $param) {
-            $type = $param->getType();
-            if ($type instanceof ReflectionNamedType) {
-                $param_class = $type->getName();
-                $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
-                continue;
-            }
-            throw new \Exception('The service ' . $class_name . ' has a parameter without type');
-        }
+        foreach (array() as $param) {
         $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
         $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:129:17
             $type = $param->getType();
             if ($type instanceof ReflectionNamedType) {
                 $param_class = $type->getName();
-                $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
+                $function_parameters[] = ServicesBuilder::getName($param_class);
                 continue;
             }

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:132:13
                 $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
                 continue;
             }
-            throw new \Exception('The service ' . $class_name . ' has a parameter without type');
+            throw new \Exception('The service ' . ' has a parameter without type' . $class_name);
         }
         $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";

[NoCoverage] Throw_
Cli/Builder/Constructor/ServicesBuilder.php:132:13
                 $function_parameters[] = ServicesBuilder::getName($param_class) . '()';
                 continue;
             }
-            throw new \Exception('The service ' . $class_name . ' has a parameter without type');
+            new \Exception('The service ' . $class_name . ' has a parameter without type');
         }
         $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";

[NoCoverage] ConcatOperandRemoval
Cli/Builder/Constructor/ServicesBuilder.php:134:9
             }
             throw new \Exception('The service ' . $class_name . ' has a parameter without type');
         }
-        $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
+        $function = 'if (isset($GLOBALS[\'' . $class_name . "\n";
         $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";
         $function .= '}';

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:134:9
             }
             throw new \Exception('The service ' . $class_name . ' has a parameter without type');
         }
-        $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
+        $function = $class_name . 'if (isset($GLOBALS[\'' . '\'])) {' . "\n";
         $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";
         $function .= '}';

[NoCoverage] Assignment
Cli/Builder/Constructor/ServicesBuilder.php:135:9
             throw new \Exception('The service ' . $class_name . ' has a parameter without type');
         }
         $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
-        $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";
+        $function = '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";
         $function .= '}';
         return $function;

[NoCoverage] Concat
Cli/Builder/Constructor/ServicesBuilder.php:135:9
             throw new \Exception('The service ' . $class_name . ' has a parameter without type');
         }
         $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
-        $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";
+        $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . ");\n" . implode(",\n", $function_parameters);
         $function .= '}';
         return $function;

[NoCoverage] Assignment
Cli/Builder/Constructor/ServicesBuilder.php:136:9
         }
         $function = 'if (isset($GLOBALS[\'' . $class_name . '\'])) {' . "\n";
         $function .= '$GLOBALS[\'' . $class_name . '\']->atEnd(' . implode(",\n", $function_parameters) . ");\n";
-        $function .= '}';
+        $function = '}';
         return $function;
     }
