[NoCoverage] LogicalNot
Cli/Includer/Includer.php:26:9
             "middle" => [],
             "atEnd" => []
         ];
-        if (!is_dir($path)) { // If it's a file
+        if (is_dir($path)) {
             $result["middle"][] = $path;
             return $result;

[NoCoverage] ArrayOneItem
Cli/Includer/Includer.php:28:13
         ];
         if (!is_dir($path)) { // If it's a file
             $result["middle"][] = $path;
-            return $result;
+            return count($result) > 1 ? array_slice($result, 0, 1, true) : $result;
         }
 

[NoCoverage] Identical
Cli/Includer/Includer.php:32:9
         }
 
         $in_dir = scandir($path);
-        if ($in_dir === false) {
+        if ($in_dir !== false) {
             throw new \Exception("Can't read the directory: " . $path);
         }

[NoCoverage] FalseValue
Cli/Includer/Includer.php:32:9
         }
 
         $in_dir = scandir($path);
-        if ($in_dir === false) {
+        if ($in_dir === true) {
             throw new \Exception("Can't read the directory: " . $path);
         }

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:33:13
 
         $in_dir = scandir($path);
         if ($in_dir === false) {
-            throw new \Exception("Can't read the directory: " . $path);
+            throw new \Exception($path);
         }
         if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:33:13
 
         $in_dir = scandir($path);
         if ($in_dir === false) {
-            throw new \Exception("Can't read the directory: " . $path);
+            throw new \Exception("Can't read the directory: ");
         }
         if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime

[NoCoverage] LogicalNot
Cli/Includer/Includer.php:35:9
         if ($in_dir === false) {
             throw new \Exception("Can't read the directory: " . $path);
         }
-        if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime
+        if (in_array("runtime", $in_dir)) {
             foreach ($in_dir as $item) {
                 if ($item === "." || $item === "..") {

[NoCoverage] Foreach_
Cli/Includer/Includer.php:36:13
             throw new \Exception("Can't read the directory: " . $path);
         }
         if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime
-            foreach ($in_dir as $item) {
-                if ($item === "." || $item === "..") {
-                    continue;
-                }
-                $loaded = $this->_readPath($path . "/" . $item);
-                $result["atStart"] = array_merge($result["atStart"], $loaded["atStart"]);
-                $result["middle"] = array_merge($result["middle"], $loaded["middle"]);
-                $result["atEnd"] = array_merge($result["atEnd"], $loaded["atEnd"]);
-            }
+            foreach (array() as $item) {
             return $result;
         }

[NoCoverage] LogicalOrNegation
Cli/Includer/Includer.php:37:17
         }
         if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime
             foreach ($in_dir as $item) {
-                if ($item === "." || $item === "..") {
+                if (!($item === "." || $item === "..")) {
                     continue;
                 }

[NoCoverage] Identical
Cli/Includer/Includer.php:37:17
         }
         if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime
             foreach ($in_dir as $item) {
-                if ($item === "." || $item === "..") {
+                if ($item === "." || $item !== "..") {
                     continue;
                 }

[NoCoverage] Continue_
Cli/Includer/Includer.php:38:21
         if (!in_array("runtime", $in_dir)) { // If it's a directory without runtime
             foreach ($in_dir as $item) {
                 if ($item === "." || $item === "..") {
-                    continue;
+                    break;
                 }
                 $loaded = $this->_readPath($path . "/" . $item);

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:40:17
                 if ($item === "." || $item === "..") {
                     continue;
                 }
-                $loaded = $this->_readPath($path . "/" . $item);
+                $loaded = $this->_readPath("/" . $item);
                 $result["atStart"] = array_merge($result["atStart"], $loaded["atStart"]);
                 $result["middle"] = array_merge($result["middle"], $loaded["middle"]);

[NoCoverage] Concat
Cli/Includer/Includer.php:40:17
                 if ($item === "." || $item === "..") {
                     continue;
                 }
-                $loaded = $this->_readPath($path . "/" . $item);
+                $loaded = $this->_readPath("/" . $path . $item);
                 $result["atStart"] = array_merge($result["atStart"], $loaded["atStart"]);
                 $result["middle"] = array_merge($result["middle"], $loaded["middle"]);

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:43:17
                 $loaded = $this->_readPath($path . "/" . $item);
                 $result["atStart"] = array_merge($result["atStart"], $loaded["atStart"]);
                 $result["middle"] = array_merge($result["middle"], $loaded["middle"]);
-                $result["atEnd"] = array_merge($result["atEnd"], $loaded["atEnd"]);
+                $result["atEnd"] = $result["atEnd"];
             }
             return $result;

[NoCoverage] ArrayOneItem
Cli/Includer/Includer.php:45:13
                 $result["middle"] = array_merge($result["middle"], $loaded["middle"]);
                 $result["atEnd"] = array_merge($result["atEnd"], $loaded["atEnd"]);
             }
-            return $result;
+            return count($result) > 1 ? array_slice($result, 0, 1, true) : $result;
         }
         $loaded = $this->_decodeDirRuntime($path); // If it's a directory with runtime

[NoCoverage] ArrayItemRemoval
Cli/Includer/Includer.php:70:9
         ];
         $in_dir = scandir($path);
 
-        $already_process = [".", "..", "runtime"];
+        $already_process = ["..", "runtime"];
         $runtime = fopen($path . '/runtime', 'r');
         if ($runtime === false) {

[NoCoverage] Concat
Cli/Includer/Includer.php:71:9
         $in_dir = scandir($path);
 
         $already_process = [".", "..", "runtime"];
-        $runtime = fopen($path . '/runtime', 'r');
+        $runtime = fopen('/runtime' . $path, 'r');
         if ($runtime === false) {
             throw new \Exception("Can't read the runtime file: " . $path . '/runtime');

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:71:9
         $in_dir = scandir($path);
 
         $already_process = [".", "..", "runtime"];
-        $runtime = fopen($path . '/runtime', 'r');
+        $runtime = fopen($path, 'r');
         if ($runtime === false) {
             throw new \Exception("Can't read the runtime file: " . $path . '/runtime');

[NoCoverage] FalseValue
Cli/Includer/Includer.php:72:9
 
         $already_process = [".", "..", "runtime"];
         $runtime = fopen($path . '/runtime', 'r');
-        if ($runtime === false) {
+        if ($runtime === true) {
             throw new \Exception("Can't read the runtime file: " . $path . '/runtime');
         }

[NoCoverage] Identical
Cli/Includer/Includer.php:72:9
 
         $already_process = [".", "..", "runtime"];
         $runtime = fopen($path . '/runtime', 'r');
-        if ($runtime === false) {
+        if ($runtime !== false) {
             throw new \Exception("Can't read the runtime file: " . $path . '/runtime');
         }

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:73:13
         $already_process = [".", "..", "runtime"];
         $runtime = fopen($path . '/runtime', 'r');
         if ($runtime === false) {
-            throw new \Exception("Can't read the runtime file: " . $path . '/runtime');
+            throw new \Exception("Can't read the runtime file: " . '/runtime');
         }
         $data = fread($runtime, filesize($path . '/runtime') ?: 0);

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:73:13
         $already_process = [".", "..", "runtime"];
         $runtime = fopen($path . '/runtime', 'r');
         if ($runtime === false) {
-            throw new \Exception("Can't read the runtime file: " . $path . '/runtime');
+            throw new \Exception($path . '/runtime');
         }
         $data = fread($runtime, filesize($path . '/runtime') ?: 0);

[NoCoverage] DecrementInteger
Cli/Includer/Includer.php:75:9
         if ($runtime === false) {
             throw new \Exception("Can't read the runtime file: " . $path . '/runtime');
         }
-        $data = fread($runtime, filesize($path . '/runtime') ?: 0);
+        $data = fread($runtime, filesize($path . '/runtime') ?: -1);
         fclose($runtime);
         $runtime_data = explode(PHP_EOL, $data ?: "");

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:75:9
         if ($runtime === false) {
             throw new \Exception("Can't read the runtime file: " . $path . '/runtime');
         }
-        $data = fread($runtime, filesize($path . '/runtime') ?: 0);
+        $data = fread($runtime, filesize($path) ?: 0);
         fclose($runtime);
         $runtime_data = explode(PHP_EOL, $data ?: "");

[NoCoverage] Ternary
Cli/Includer/Includer.php:77:9
         }
         $data = fread($runtime, filesize($path . '/runtime') ?: 0);
         fclose($runtime);
-        $runtime_data = explode(PHP_EOL, $data ?: "");
+        $runtime_data = explode(PHP_EOL, $data ? "" : $data);
         foreach ($runtime_data as $item) {
             if (strpos($item, '@Not ') !== false) {

[NoCoverage] Foreach_
Cli/Includer/Includer.php:78:9
         $data = fread($runtime, filesize($path . '/runtime') ?: 0);
         fclose($runtime);
         $runtime_data = explode(PHP_EOL, $data ?: "");
-        foreach ($runtime_data as $item) {
-            if (strpos($item, '@Not ') !== false) {
-                $filename = str_replace('@Not ', '', $item);
-                $already_process[] = $filename;
-                continue;
-            }
-            if (strpos($item, '@Last ') !== false) {
-                $filename = str_replace('@Last ', '', $item);
-                $new_file = $path . "/" . $filename;
-                $already_process[] = $filename;
-                $new_file = $this->_readPath($new_file);
-                $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["atStart"]);
-                $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["middle"]);
-                $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["atEnd"]);
-                continue;
-            }
-            $already_process[] = $item;
-            $new_file = $path . '/' . $item;
-            $new_file = $this->_readPath($new_file);
-            $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atStart"]);
-            $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["middle"]);
-            $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atEnd"]);
-        }
+        foreach (array() as $item) {
 
         if (!is_array($in_dir)) {

[NoCoverage] FalseValue
Cli/Includer/Includer.php:79:13
         fclose($runtime);
         $runtime_data = explode(PHP_EOL, $data ?: "");
         foreach ($runtime_data as $item) {
-            if (strpos($item, '@Not ') !== false) {
+            if (strpos($item, '@Not ') !== true) {
                 $filename = str_replace('@Not ', '', $item);
                 $already_process[] = $filename;

[NoCoverage] NotIdentical
Cli/Includer/Includer.php:79:13
         fclose($runtime);
         $runtime_data = explode(PHP_EOL, $data ?: "");
         foreach ($runtime_data as $item) {
-            if (strpos($item, '@Not ') !== false) {
+            if (strpos($item, '@Not ') === false) {
                 $filename = str_replace('@Not ', '', $item);
                 $already_process[] = $filename;

[NoCoverage] UnwrapStrReplace
Cli/Includer/Includer.php:80:17
         $runtime_data = explode(PHP_EOL, $data ?: "");
         foreach ($runtime_data as $item) {
             if (strpos($item, '@Not ') !== false) {
-                $filename = str_replace('@Not ', '', $item);
+                $filename = $item;
                 $already_process[] = $filename;
                 continue;

[NoCoverage] Continue_
Cli/Includer/Includer.php:82:17
             if (strpos($item, '@Not ') !== false) {
                 $filename = str_replace('@Not ', '', $item);
                 $already_process[] = $filename;
-                continue;
+                break;
             }
             if (strpos($item, '@Last ') !== false) {

[NoCoverage] FalseValue
Cli/Includer/Includer.php:84:13
                 $already_process[] = $filename;
                 continue;
             }
-            if (strpos($item, '@Last ') !== false) {
+            if (strpos($item, '@Last ') !== true) {
                 $filename = str_replace('@Last ', '', $item);
                 $new_file = $path . "/" . $filename;

[NoCoverage] NotIdentical
Cli/Includer/Includer.php:84:13
                 $already_process[] = $filename;
                 continue;
             }
-            if (strpos($item, '@Last ') !== false) {
+            if (strpos($item, '@Last ') === false) {
                 $filename = str_replace('@Last ', '', $item);
                 $new_file = $path . "/" . $filename;

[NoCoverage] UnwrapStrReplace
Cli/Includer/Includer.php:85:17
                 continue;
             }
             if (strpos($item, '@Last ') !== false) {
-                $filename = str_replace('@Last ', '', $item);
+                $filename = $item;
                 $new_file = $path . "/" . $filename;
                 $already_process[] = $filename;

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:86:17
             }
             if (strpos($item, '@Last ') !== false) {
                 $filename = str_replace('@Last ', '', $item);
-                $new_file = $path . "/" . $filename;
+                $new_file = "/" . $filename;
                 $already_process[] = $filename;
                 $new_file = $this->_readPath($new_file);

[NoCoverage] Concat
Cli/Includer/Includer.php:86:17
             }
             if (strpos($item, '@Last ') !== false) {
                 $filename = str_replace('@Last ', '', $item);
-                $new_file = $path . "/" . $filename;
+                $new_file = $path . $filename . "/";
                 $already_process[] = $filename;
                 $new_file = $this->_readPath($new_file);

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:89:17
                 $new_file = $path . "/" . $filename;
                 $already_process[] = $filename;
                 $new_file = $this->_readPath($new_file);
-                $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["atStart"]);
+                $decoded_runtime["atEnd"] = $decoded_runtime["atEnd"];
                 $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["middle"]);
                 $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["atEnd"]);

[NoCoverage] Continue_
Cli/Includer/Includer.php:92:17
                 $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["atStart"]);
                 $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["middle"]);
                 $decoded_runtime["atEnd"] = array_merge($decoded_runtime["atEnd"], $new_file["atEnd"]);
-                continue;
+                break;
             }
             $already_process[] = $item;

[NoCoverage] Concat
Cli/Includer/Includer.php:95:13
                 continue;
             }
             $already_process[] = $item;
-            $new_file = $path . '/' . $item;
+            $new_file = '/' . $path . $item;
             $new_file = $this->_readPath($new_file);
             $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atStart"]);

[NoCoverage] Concat
Cli/Includer/Includer.php:95:13
                 continue;
             }
             $already_process[] = $item;
-            $new_file = $path . '/' . $item;
+            $new_file = $path . $item . '/';
             $new_file = $this->_readPath($new_file);
             $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atStart"]);

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:97:13
             $already_process[] = $item;
             $new_file = $path . '/' . $item;
             $new_file = $this->_readPath($new_file);
-            $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atStart"]);
+            $decoded_runtime["atStart"] = $decoded_runtime["atStart"];
             $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["middle"]);
             $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atEnd"]);

[NoCoverage] LogicalNot
Cli/Includer/Includer.php:102:9
             $decoded_runtime["atStart"] = array_merge($decoded_runtime["atStart"], $new_file["atEnd"]);
         }
 
-        if (!is_array($in_dir)) {
+        if (is_array($in_dir)) {
             throw new \Exception("Can't read the directory: " . $path);
         }

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:103:13
         }
 
         if (!is_array($in_dir)) {
-            throw new \Exception("Can't read the directory: " . $path);
+            throw new \Exception($path);
         }
 

[NoCoverage] Throw_
Cli/Includer/Includer.php:103:13
         }
 
         if (!is_array($in_dir)) {
-            throw new \Exception("Can't read the directory: " . $path);
+            new \Exception("Can't read the directory: " . $path);
         }
 

[NoCoverage] Foreach_
Cli/Includer/Includer.php:106:9
             throw new \Exception("Can't read the directory: " . $path);
         }
 
-        foreach ($in_dir as $item) {
-            if (in_array($item, $already_process)) {
-                continue;
-            }
-            $already_process[] = $item;
-            $new_file = $path . '/' . $item;
-            $new_file = $this->_readPath($new_file);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["middle"]);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atEnd"]);
-        }
+        foreach (array() as $item) {
         return $decoded_runtime;
     }

[NoCoverage] IfNegation
Cli/Includer/Includer.php:107:13
         }
 
         foreach ($in_dir as $item) {
-            if (in_array($item, $already_process)) {
-                continue;
-            }
+            if (!in_array($item, $already_process)) {
             $already_process[] = $item;
             $new_file = $path . '/' . $item;

[NoCoverage] Continue_
Cli/Includer/Includer.php:108:17
 
         foreach ($in_dir as $item) {
             if (in_array($item, $already_process)) {
-                continue;
+                break;
             }
             $already_process[] = $item;

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:111:13
                 continue;
             }
             $already_process[] = $item;
-            $new_file = $path . '/' . $item;
+            $new_file = $path . '/';
             $new_file = $this->_readPath($new_file);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:111:13
                 continue;
             }
             $already_process[] = $item;
-            $new_file = $path . '/' . $item;
+            $new_file = '/' . $item;
             $new_file = $this->_readPath($new_file);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:113:13
             $already_process[] = $item;
             $new_file = $path . '/' . $item;
             $new_file = $this->_readPath($new_file);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);
+            $decoded_runtime["middle"] = $new_file["atStart"];
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["middle"]);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atEnd"]);

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:113:13
             $already_process[] = $item;
             $new_file = $path . '/' . $item;
             $new_file = $this->_readPath($new_file);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);
+            $decoded_runtime["middle"] = $decoded_runtime["middle"];
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["middle"]);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atEnd"]);

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:114:13
             $new_file = $path . '/' . $item;
             $new_file = $this->_readPath($new_file);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["middle"]);
+            $decoded_runtime["middle"] = $new_file["middle"];
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atEnd"]);
         }

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:115:13
             $new_file = $this->_readPath($new_file);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atStart"]);
             $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["middle"]);
-            $decoded_runtime["middle"] = array_merge($decoded_runtime["middle"], $new_file["atEnd"]);
+            $decoded_runtime["middle"] = $new_file["atEnd"];
         }
         return $decoded_runtime;

[NoCoverage] UnwrapArrayMerge
Cli/Includer/Includer.php:130:9
     public function findAllFile($path): array
     {
         $result = $this->_readPath($path);
-        $result = array_merge($result["atStart"], $result["middle"], $result["atEnd"]);
+        $result = $result["atStart"];
         $result = array_unique($result);
         $result = array_filter(

[NoCoverage] Identical
Cli/Includer/Includer.php:135:17
         $result = array_filter(
             $result,
             function ($item) {
-                return !is_dir($item) && strpos($item, '.php') === strlen($item) - 4;
+                return !is_dir($item) && strpos($item, '.php') !== strlen($item) - 4;
             }
         );

[NoCoverage] LogicalAndAllSubExprNegation
Cli/Includer/Includer.php:135:17
         $result = array_filter(
             $result,
             function ($item) {
-                return !is_dir($item) && strpos($item, '.php') === strlen($item) - 4;
+                return is_dir($item) && !(strpos($item, '.php') === strlen($item) - 4);
             }
         );

[NoCoverage] Foreach_
Cli/Includer/Includer.php:152:9
     {
         $all_file = $this->findAllFile($path);
         $initialized_class = [];
-        foreach ($all_file as $file) {
-            $initialized_class = array_merge($initialized_class, $this->includeFile($file));
-        }
+        foreach (array() as $file) {
         return $initialized_class;
     }

[NoCoverage] LogicalNot
Cli/Includer/Includer.php:167:9
      */
     public function includeFile($path): array
     {
-        if (!file_exists($path)) {
+        if (file_exists($path)) {
             throw new \Exception("File not found: " . $path);
         }

[NoCoverage] ConcatOperandRemoval
Cli/Includer/Includer.php:168:13
     public function includeFile($path): array
     {
         if (!file_exists($path)) {
-            throw new \Exception("File not found: " . $path);
+            throw new \Exception($path);
         }
         $all_class = get_declared_classes();

[NoCoverage] Throw_
Cli/Includer/Includer.php:168:13
     public function includeFile($path): array
     {
         if (!file_exists($path)) {
-            throw new \Exception("File not found: " . $path);
+            new \Exception("File not found: " . $path);
         }
         $all_class = get_declared_classes();

[NoCoverage] UnwrapArrayDiff
Cli/Includer/Includer.php:172:9
         }
         $all_class = get_declared_classes();
         include_once $path;
-        $new_class = array_diff(get_declared_classes(), $all_class);
+        $new_class = get_declared_classes();
         $new_class = array_values($new_class);
         return $new_class;
