[NoCoverage] PublicVisibility
Cli/MakeClasses.php:32:5
      *
      * @return array<ReflectionClass>
      */
-    public static function makeClasses(array $classes, ConfigRunner $config_runner = null): array
+    protected static function makeClasses(array $classes, ConfigRunner $config_runner = null) : array
     {
         if ($config_runner === null) {

[NoCoverage] Identical
Cli/MakeClasses.php:34:9
      */
     public static function makeClasses(array $classes, ConfigRunner $config_runner = null): array
     {
-        if ($config_runner === null) {
+        if ($config_runner !== null) {
             $config_runner = new ConfigRunner();
         }

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:38:9
             $config_runner = new ConfigRunner();
         }
         $logger = new Logger();
-        $logger->info('Initialize the services');
+        
         $injector = new Injector($logger);
         MakeClasses::$injector = $injector;

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:41:9
         $logger->info('Initialize the services');
         $injector = new Injector($logger);
         MakeClasses::$injector = $injector;
-        $injector->addService($logger);
+        
 
         $container = $injector->createClass(new ReflectionClass(Container::class));

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:44:9
         $injector->addService($logger);
 
         $container = $injector->createClass(new ReflectionClass(Container::class));
-        if (!$container instanceof Container) {
+        if (!true) {
             throw new \Exception('The container is not a container');
         }

[NoCoverage] LogicalNot
Cli/MakeClasses.php:44:9
         $injector->addService($logger);
 
         $container = $injector->createClass(new ReflectionClass(Container::class));
-        if (!$container instanceof Container) {
+        if ($container instanceof Container) {
             throw new \Exception('The container is not a container');
         }

[NoCoverage] Throw_
Cli/MakeClasses.php:45:13
 
         $container = $injector->createClass(new ReflectionClass(Container::class));
         if (!$container instanceof Container) {
-            throw new \Exception('The container is not a container');
+            new \Exception('The container is not a container');
         }
         MakeClasses::$container = $container;

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:48:9
             throw new \Exception('The container is not a container');
         }
         MakeClasses::$container = $container;
-        $injector->addService($container);
+        
         $injector->addService($injector);
 

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:49:9
         }
         MakeClasses::$container = $container;
         $injector->addService($container);
-        $injector->addService($injector);
+        
 
         $container->addService($config_runner);

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:51:9
         $injector->addService($container);
         $injector->addService($injector);
 
-        $container->addService($config_runner);
+        
         $container->addService($logger);
         $container->addService($injector);

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:52:9
         $injector->addService($injector);
 
         $container->addService($config_runner);
-        $container->addService($logger);
+        
         $container->addService($injector);
         $container->addService($container);

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:53:9
 
         $container->addService($config_runner);
         $container->addService($logger);
-        $container->addService($injector);
+        
         $container->addService($container);
 

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:54:9
         $container->addService($config_runner);
         $container->addService($logger);
         $container->addService($injector);
-        $container->addService($container);
+        
 
         $all_class = array();

[NoCoverage] LogicalNot
Cli/MakeClasses.php:59:13
         $all_class = array();
         $atStart = array();
         foreach ($classes as $class) {
-            if (!class_exists($class)) {
+            if (class_exists($class)) {
                 continue;
             }

[NoCoverage] Continue_
Cli/MakeClasses.php:60:17
         $atStart = array();
         foreach ($classes as $class) {
             if (!class_exists($class)) {
-                continue;
+                break;
             }
             $reflection = new ReflectionClass($class);

[NoCoverage] NotIdentical
Cli/MakeClasses.php:64:13
             }
             $reflection = new ReflectionClass($class);
             $all_class[] = $reflection;
-            if (strpos($class, 'Adebipe\\Services\\') !== 0) {
+            if (strpos($class, 'Adebipe\\Services\\') === 0) {
                 continue;
             }

[NoCoverage] DecrementInteger
Cli/MakeClasses.php:64:13
             }
             $reflection = new ReflectionClass($class);
             $all_class[] = $reflection;
-            if (strpos($class, 'Adebipe\\Services\\') !== 0) {
+            if (strpos($class, 'Adebipe\\Services\\') !== -1) {
                 continue;
             }

[NoCoverage] Continue_
Cli/MakeClasses.php:65:17
             $reflection = new ReflectionClass($class);
             $all_class[] = $reflection;
             if (strpos($class, 'Adebipe\\Services\\') !== 0) {
-                continue;
+                break;
             }
             $container->addReflection($reflection);

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:67:13
             if (strpos($class, 'Adebipe\\Services\\') !== 0) {
                 continue;
             }
-            $container->addReflection($reflection);
+            
             if (in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
                 $logger->info('Skip service: ' . $class);

[NoCoverage] IfNegation
Cli/MakeClasses.php:68:13
                 continue;
             }
             $container->addReflection($reflection);
-            if (in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
-                $logger->info('Skip service: ' . $class);
-                continue;
-            }
+            if (!in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
             if ($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait()) {
                 continue;

[NoCoverage] ArrayItemRemoval
Cli/MakeClasses.php:68:13
                 continue;
             }
             $container->addReflection($reflection);
-            if (in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
+            if (in_array($class, [Logger::class, Injector::class, Container::class])) {
                 $logger->info('Skip service: ' . $class);
                 continue;

[NoCoverage] Concat
Cli/MakeClasses.php:69:17
             }
             $container->addReflection($reflection);
             if (in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
-                $logger->info('Skip service: ' . $class);
+                $logger->info($class . 'Skip service: ');
                 continue;
             }

[NoCoverage] ConcatOperandRemoval
Cli/MakeClasses.php:69:17
             }
             $container->addReflection($reflection);
             if (in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
-                $logger->info('Skip service: ' . $class);
+                $logger->info('Skip service: ');
                 continue;
             }

[NoCoverage] Continue_
Cli/MakeClasses.php:70:17
             $container->addReflection($reflection);
             if (in_array($class, [ConfigRunner::class, Logger::class, Injector::class, Container::class])) {
                 $logger->info('Skip service: ' . $class);
-                continue;
+                break;
             }
             if ($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait()) {

[NoCoverage] LogicalOrSingleSubExprNegation
Cli/MakeClasses.php:72:13
                 $logger->info('Skip service: ' . $class);
                 continue;
             }
-            if ($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait()) {
+            if ($reflection->isAbstract() || !$reflection->isInterface() || $reflection->isTrait()) {
                 continue;
             }

[NoCoverage] LogicalOrNegation
Cli/MakeClasses.php:72:13
                 $logger->info('Skip service: ' . $class);
                 continue;
             }
-            if ($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait()) {
+            if (!($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait())) {
                 continue;
             }

[NoCoverage] Continue_
Cli/MakeClasses.php:73:17
                 continue;
             }
             if ($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait()) {
-                continue;
+                break;
             }
             if ($reflection->implementsInterface(CreatorInterface::class)) {

[NoCoverage] IfNegation
Cli/MakeClasses.php:75:13
             if ($reflection->isAbstract() || $reflection->isInterface() || $reflection->isTrait()) {
                 continue;
             }
-            if ($reflection->implementsInterface(CreatorInterface::class)) {
-                $class = $injector->createClass($reflection);
-                if ($class instanceof RegisterServiceInterface) {
-                    $injector->addService($class);
-                }
-                if ($class instanceof StarterServiceInterface) {
-                    $atStart_function = $reflection->getMethod('atStart');
-                    $atStart[] = [$atStart_function, $class];
-                }
-                $container->addService($class);
-            }
+            if (!$reflection->implementsInterface(CreatorInterface::class)) {
         }
         foreach ($atStart as $function) {

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:77:17
             }
             if ($reflection->implementsInterface(CreatorInterface::class)) {
                 $class = $injector->createClass($reflection);
-                if ($class instanceof RegisterServiceInterface) {
+                if (true) {
                     $injector->addService($class);
                 }

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:77:17
             }
             if ($reflection->implementsInterface(CreatorInterface::class)) {
                 $class = $injector->createClass($reflection);
-                if ($class instanceof RegisterServiceInterface) {
+                if (false) {
                     $injector->addService($class);
                 }

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:78:21
             if ($reflection->implementsInterface(CreatorInterface::class)) {
                 $class = $injector->createClass($reflection);
                 if ($class instanceof RegisterServiceInterface) {
-                    $injector->addService($class);
+                    
                 }
                 if ($class instanceof StarterServiceInterface) {

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:80:17
                 if ($class instanceof RegisterServiceInterface) {
                     $injector->addService($class);
                 }
-                if ($class instanceof StarterServiceInterface) {
+                if (false) {
                     $atStart_function = $reflection->getMethod('atStart');
                     $atStart[] = [$atStart_function, $class];

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:80:17
                 if ($class instanceof RegisterServiceInterface) {
                     $injector->addService($class);
                 }
-                if ($class instanceof StarterServiceInterface) {
+                if (true) {
                     $atStart_function = $reflection->getMethod('atStart');
                     $atStart[] = [$atStart_function, $class];

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:84:17
                     $atStart_function = $reflection->getMethod('atStart');
                     $atStart[] = [$atStart_function, $class];
                 }
-                $container->addService($class);
+                
             }
         }

[NoCoverage] Foreach_
Cli/MakeClasses.php:87:9
                 $container->addService($class);
             }
         }
-        foreach ($atStart as $function) {
-            $injector->execute($function[0], $function[1]);
-        }
+        foreach (array() as $function) {
         $logger->atStart();
         return $all_class;

[NoCoverage] IncrementInteger
Cli/MakeClasses.php:88:13
             }
         }
         foreach ($atStart as $function) {
-            $injector->execute($function[0], $function[1]);
+            $injector->execute($function[1], $function[1]);
         }
         $logger->atStart();

[NoCoverage] IncrementInteger
Cli/MakeClasses.php:88:13
             }
         }
         foreach ($atStart as $function) {
-            $injector->execute($function[0], $function[1]);
+            $injector->execute($function[0], $function[2]);
         }
         $logger->atStart();

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:90:9
         foreach ($atStart as $function) {
             $injector->execute($function[0], $function[1]);
         }
-        $logger->atStart();
+        
         return $all_class;
     }

[NoCoverage] PublicVisibility
Cli/MakeClasses.php:99:5
      *
      * @return void
      */
-    public static function stopServices(): void
+    protected static function stopServices() : void
     {
         $logger = MakeClasses::$injector->getService(Logger::class);

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:102:9
     public static function stopServices(): void
     {
         $logger = MakeClasses::$injector->getService(Logger::class);
-        if (!$logger instanceof Logger) {
+        if (!false) {
             return;
         }

[NoCoverage] InstanceOf_
Cli/MakeClasses.php:102:9
     public static function stopServices(): void
     {
         $logger = MakeClasses::$injector->getService(Logger::class);
-        if (!$logger instanceof Logger) {
+        if (!true) {
             return;
         }

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:105:9
         if (!$logger instanceof Logger) {
             return;
         }
-        $logger->info('Stopping the services');
+        
         foreach (MakeClasses::$container->getSubclassInterfaces(StarterServiceInterface::class) as $service) {
             if ($service::class === Logger::class) {

[NoCoverage] Foreach_
Cli/MakeClasses.php:106:9
             return;
         }
         $logger->info('Stopping the services');
-        foreach (MakeClasses::$container->getSubclassInterfaces(StarterServiceInterface::class) as $service) {
-            if ($service::class === Logger::class) {
-                continue;
-            }
-            $reflection = new ReflectionClass($service);
-            $atEnd = $reflection->getMethod('atEnd');
-            MakeClasses::$injector->execute($atEnd, $service);
-        }
+        foreach (array() as $service) {
         $logger->atEnd();
     }

[NoCoverage] Identical
Cli/MakeClasses.php:107:13
         }
         $logger->info('Stopping the services');
         foreach (MakeClasses::$container->getSubclassInterfaces(StarterServiceInterface::class) as $service) {
-            if ($service::class === Logger::class) {
+            if ($service::class !== Logger::class) {
                 continue;
             }

[NoCoverage] Continue_
Cli/MakeClasses.php:108:17
         $logger->info('Stopping the services');
         foreach (MakeClasses::$container->getSubclassInterfaces(StarterServiceInterface::class) as $service) {
             if ($service::class === Logger::class) {
-                continue;
+                break;
             }
             $reflection = new ReflectionClass($service);

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:112:13
             }
             $reflection = new ReflectionClass($service);
             $atEnd = $reflection->getMethod('atEnd');
-            MakeClasses::$injector->execute($atEnd, $service);
+            
         }
         $logger->atEnd();

[NoCoverage] MethodCallRemoval
Cli/MakeClasses.php:114:9
             $atEnd = $reflection->getMethod('atEnd');
             MakeClasses::$injector->execute($atEnd, $service);
         }
-        $logger->atEnd();
+        
     }
 }
