[NoCoverage] LogicalNot
Cli/Router/Router.php:29:9
     public function __construct()
     {
         $this->_time_start = microtime(true);
-        if (!defined('STDOUT')) {
+        if (defined('STDOUT')) {
             define('STDOUT', fopen('php://stdout', 'w'));
         }

[NoCoverage] FunctionCallRemoval
Cli/Router/Router.php:30:13
     {
         $this->_time_start = microtime(true);
         if (!defined('STDOUT')) {
-            define('STDOUT', fopen('php://stdout', 'w'));
+            
         }
 

[NoCoverage] LogicalNot
Cli/Router/Router.php:33:9
             define('STDOUT', fopen('php://stdout', 'w'));
         }
 
-        if (!defined('STDERR')) {
+        if (defined('STDERR')) {
             define('STDERR', fopen('php://stderr', 'w'));
         }

[NoCoverage] FunctionCallRemoval
Cli/Router/Router.php:34:13
         }
 
         if (!defined('STDERR')) {
-            define('STDERR', fopen('php://stderr', 'w'));
+            
         }
 

[NoCoverage] LogicalNot
Cli/Router/Router.php:37:9
             define('STDERR', fopen('php://stderr', 'w'));
         }
 
-        if (!defined('STDIN')) {
+        if (defined('STDIN')) {
             define('STDIN', fopen('php://stdin', 'r'));
         }

[NoCoverage] FunctionCallRemoval
Cli/Router/Router.php:38:13
         }
 
         if (!defined('STDIN')) {
-            define('STDIN', fopen('php://stdin', 'r'));
+            
         }
     }

[NoCoverage] PublicVisibility
Cli/Router/Router.php:49:5
      *
      * @return void
      */
-    public function run($cwd = __DIR__): void
+    protected function run($cwd = __DIR__) : void
     {
         chdir($cwd);

[NoCoverage] FunctionCallRemoval
Cli/Router/Router.php:51:9
      */
     public function run($cwd = __DIR__): void
     {
-        chdir($cwd);
+        
         $includer = new Includer();
         $data = $includer->includeAllFile($cwd . '/services');

[NoCoverage] Concat
Cli/Router/Router.php:53:9
     {
         chdir($cwd);
         $includer = new Includer();
-        $data = $includer->includeAllFile($cwd . '/services');
+        $data = $includer->includeAllFile('/services' . $cwd);
         $config_runner = new ConfigRunner();
         $data2 = $includer->includeAllFile($cwd . '/' . Settings::getConfig('DIR'));

[NoCoverage] ConcatOperandRemoval
Cli/Router/Router.php:53:9
     {
         chdir($cwd);
         $includer = new Includer();
-        $data = $includer->includeAllFile($cwd . '/services');
+        $data = $includer->includeAllFile($cwd);
         $config_runner = new ConfigRunner();
         $data2 = $includer->includeAllFile($cwd . '/' . Settings::getConfig('DIR'));

[NoCoverage] ConcatOperandRemoval
Cli/Router/Router.php:55:9
         $includer = new Includer();
         $data = $includer->includeAllFile($cwd . '/services');
         $config_runner = new ConfigRunner();
-        $data2 = $includer->includeAllFile($cwd . '/' . Settings::getConfig('DIR'));
+        $data2 = $includer->includeAllFile($cwd . Settings::getConfig('DIR'));
 
         MakeClasses::makeClasses(array_merge($data, $data2), $config_runner);

[NoCoverage] ConcatOperandRemoval
Cli/Router/Router.php:55:9
         $includer = new Includer();
         $data = $includer->includeAllFile($cwd . '/services');
         $config_runner = new ConfigRunner();
-        $data2 = $includer->includeAllFile($cwd . '/' . Settings::getConfig('DIR'));
+        $data2 = $includer->includeAllFile($cwd . '/');
 
         MakeClasses::makeClasses(array_merge($data, $data2), $config_runner);

[NoCoverage] MethodCallRemoval
Cli/Router/Router.php:57:9
         $config_runner = new ConfigRunner();
         $data2 = $includer->includeAllFile($cwd . '/' . Settings::getConfig('DIR'));
 
-        MakeClasses::makeClasses(array_merge($data, $data2), $config_runner);
+        
         $logger = MakeClasses::$container->getService(Logger::class);
         if (!($logger instanceof Logger)) {

[NoCoverage] InstanceOf_
Cli/Router/Router.php:59:9
 
         MakeClasses::makeClasses(array_merge($data, $data2), $config_runner);
         $logger = MakeClasses::$container->getService(Logger::class);
-        if (!($logger instanceof Logger)) {
+        if (!false) {
             throw new \Exception("Unable to get the logger");
         }

[NoCoverage] InstanceOf_
Cli/Router/Router.php:59:9
 
         MakeClasses::makeClasses(array_merge($data, $data2), $config_runner);
         $logger = MakeClasses::$container->getService(Logger::class);
-        if (!($logger instanceof Logger)) {
+        if (!true) {
             throw new \Exception("Unable to get the logger");
         }

[NoCoverage] Throw_
Cli/Router/Router.php:60:13
         MakeClasses::makeClasses(array_merge($data, $data2), $config_runner);
         $logger = MakeClasses::$container->getService(Logger::class);
         if (!($logger instanceof Logger)) {
-            throw new \Exception("Unable to get the logger");
+            new \Exception("Unable to get the logger");
         }
         $logger->info('Router running');

[NoCoverage] MethodCallRemoval
Cli/Router/Router.php:62:9
         if (!($logger instanceof Logger)) {
             throw new \Exception("Unable to get the logger");
         }
-        $logger->info('Router running');
+        
 
         $request = new Request(

[NoCoverage] LogicalNot
Cli/Router/Router.php:79:9
         );
 
         $router = MakeClasses::$container->getService(ServicesRouter::class);
-        if (!($router instanceof ServicesRouter)) {
+        if ($router instanceof ServicesRouter) {
             throw new \Exception("Unable to get the router");
         }

[NoCoverage] InstanceOf_
Cli/Router/Router.php:79:9
         );
 
         $router = MakeClasses::$container->getService(ServicesRouter::class);
-        if (!($router instanceof ServicesRouter)) {
+        if (!false) {
             throw new \Exception("Unable to get the router");
         }

[NoCoverage] Throw_
Cli/Router/Router.php:80:13
 
         $router = MakeClasses::$container->getService(ServicesRouter::class);
         if (!($router instanceof ServicesRouter)) {
-            throw new \Exception("Unable to get the router");
+            new \Exception("Unable to get the router");
         }
 

[NoCoverage] MethodCallRemoval
Cli/Router/Router.php:85:9
 
         $response = $router->getResponse($request, MakeClasses::$injector);
 
-        $response->send();
+        
 
         $logger->info('End of router');

[NoCoverage] MethodCallRemoval
Cli/Router/Router.php:87:9
 
         $response->send();
 
-        $logger->info('End of router');
+        
 
         $time_end = microtime(true);

[NoCoverage] MethodCallRemoval
Cli/Router/Router.php:91:9
 
         $time_end = microtime(true);
 
-        $logger->info(
-            'information about dev Router: ' . PHP_EOL .
-                'Peak memory usage: ' . memory_get_peak_usage() / 1024 / 1024 . 'MB' . PHP_EOL .
-                'Memory usage: ' . memory_get_usage() / 1024 / 1024 . 'MB' . PHP_EOL .
-                'Time: ' . ($time_end - $this->_time_start) * 1000 . 'ms'
-        );
+        
 
         MakeClasses::stopServices();

[NoCoverage] MethodCallRemoval
Cli/Router/Router.php:98:9
                 'Time: ' . ($time_end - $this->_time_start) * 1000 . 'ms'
         );
 
-        MakeClasses::stopServices();
+        
     }
 }
