[NoCoverage] PublicVisibility
Adebipe/Core/Utils/Injector.php:62:5
      *
      * @return array The params with the injected params
      */
-    public function injectParams(\ReflectionMethod $method, array $params = []): array
+    protected function injectParams(\ReflectionMethod $method, array $params = []) : array
     {
         $method_params = $method->getParameters();

[NoCoverage] UnwrapStrReplace
Adebipe/Core/Utils/Injector.php:77:13
                         ' in class ' . $method->getDeclaringClass()->getName() . ' has no type'
                 );
             }
-            $not_null = str_replace("?", "", $param_type->__toString());
+            $not_null = $param_type->__toString();
             if (in_array($not_null, array_keys($this->_services))) {
                 $find_params[] = $this->_services[$not_null];

[NoCoverage] IfNegation
Adebipe/Core/Utils/Injector.php:78:13
                 );
             }
             $not_null = str_replace("?", "", $param_type->__toString());
-            if (in_array($not_null, array_keys($this->_services))) {
-                $find_params[] = $this->_services[$not_null];
-                continue;
-            }
+            if (!in_array($not_null, array_keys($this->_services))) {
             if (in_array($not_null, array_keys($params))) {
                 $find_params[] = $params[$not_null];

[NoCoverage] Continue_
Adebipe/Core/Utils/Injector.php:80:17
             $not_null = str_replace("?", "", $param_type->__toString());
             if (in_array($not_null, array_keys($this->_services))) {
                 $find_params[] = $this->_services[$not_null];
-                continue;
+                break;
             }
             if (in_array($not_null, array_keys($params))) {

[NoCoverage] IfNegation
Adebipe/Core/Utils/Injector.php:82:13
                 $find_params[] = $this->_services[$not_null];
                 continue;
             }
-            if (in_array($not_null, array_keys($params))) {
-                $find_params[] = $params[$not_null];
-                continue;
-            }
+            if (!in_array($not_null, array_keys($params))) {
             if (isset($params[$param_name])) {
                 $find_params[] = $params[$param_name];

[NoCoverage] Continue_
Adebipe/Core/Utils/Injector.php:84:17
             }
             if (in_array($not_null, array_keys($params))) {
                 $find_params[] = $params[$not_null];
-                continue;
+                break;
             }
             if (isset($params[$param_name])) {

[NoCoverage] Continue_
Adebipe/Core/Utils/Injector.php:88:17
             }
             if (isset($params[$param_name])) {
                 $find_params[] = $params[$param_name];
-                continue;
+                break;
             }
             if ($param->isDefaultValueAvailable()) {

[NoCoverage] IfNegation
Adebipe/Core/Utils/Injector.php:90:13
                 $find_params[] = $params[$param_name];
                 continue;
             }
-            if ($param->isDefaultValueAvailable()) {
-                $find_params[] = $param->getDefaultValue();
-                continue;
-            }
+            if (!$param->isDefaultValueAvailable()) {
             if ($param->allowsNull()) {
                 $find_params[] = null;

[NoCoverage] Continue_
Adebipe/Core/Utils/Injector.php:92:17
             }
             if ($param->isDefaultValueAvailable()) {
                 $find_params[] = $param->getDefaultValue();
-                continue;
+                break;
             }
             if ($param->allowsNull()) {

[NoCoverage] IfNegation
Adebipe/Core/Utils/Injector.php:94:13
                 $find_params[] = $param->getDefaultValue();
                 continue;
             }
-            if ($param->allowsNull()) {
-                $find_params[] = null;
-                continue;
-            }
+            if (!$param->allowsNull()) {
             throw new \Exception(
                 'Param ' . $param_name . ' in method ' . $method->getName() .

[NoCoverage] Continue_
Adebipe/Core/Utils/Injector.php:96:17
             }
             if ($param->allowsNull()) {
                 $find_params[] = null;
-                continue;
+                break;
             }
             throw new \Exception(

[NoCoverage] Throw_
Adebipe/Core/Utils/Injector.php:98:13
                 $find_params[] = null;
                 continue;
             }
-            throw new \Exception(
-                'Param ' . $param_name . ' in method ' . $method->getName() .
-                    ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected'
-            );
+            new \Exception('Param ' . $param_name . ' in method ' . $method->getName() . ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected');
         }
         return $find_params;

[NoCoverage] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:99:17
                 continue;
             }
             throw new \Exception(
-                'Param ' . $param_name . ' in method ' . $method->getName() .
-                    ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected'
+                throw new \Exception('Param ' . $param_name . ' in method ' . $method->getName() . ' in class ' . ' can\'t be injected');' can\'t be injected'
             );
         }

[NoCoverage] ConcatOperandRemoval
Adebipe/Core/Utils/Injector.php:99:17
                 continue;
             }
             throw new \Exception(
-                'Param ' . $param_name . ' in method ' . $method->getName() .
-                    ' in class ' . $method->getDeclaringClass()->getName() . ' can\'t be injected'
+                throw new \Exception('Param ' . $param_name . ' in method ' . $method->getName() . $method->getDeclaringClass()->getName() . ' can\'t be injected');' can\'t be injected'
             );
         }

[NoCoverage] Concat
Adebipe/Core/Utils/Injector.php:134:13
     {
         $constructor = $class->getConstructor();
         if ($constructor === null) {
-            $this->_logger->debug('Class ' . $class->getName() . ' has no constructor');
+            $this->_logger->debug($class->getName() . 'Class ' . ' has no constructor');
             return $class->newInstance();
         }

[NoCoverage] Throw_
Adebipe/Core/Utils/Injector.php:138:13
             return $class->newInstance();
         }
         if (!$constructor->isPublic()) {
-            throw new \Exception('Constructor of class ' . $class->getName() . ' is not public');
+            new \Exception('Constructor of class ' . $class->getName() . ' is not public');
         }
         $params = $this->injectParams($constructor, $params);

[NoCoverage] Concat
Adebipe/Core/Utils/Injector.php:138:13
             return $class->newInstance();
         }
         if (!$constructor->isPublic()) {
-            throw new \Exception('Constructor of class ' . $class->getName() . ' is not public');
+            throw new \Exception($class->getName() . 'Constructor of class ' . ' is not public');
         }
         $params = $this->injectParams($constructor, $params);
